{"id":103,"date":"2012-02-14T18:07:49","date_gmt":"2012-02-14T18:07:49","guid":{"rendered":"http:\/\/www.mirandanet.org\/mirandamods\/?page_id=103"},"modified":"2013-01-17T12:14:12","modified_gmt":"2013-01-17T12:14:12","slug":"workshop-sessions-at-bett12","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12\/workshop-sessions-at-bett12\/","title":{"rendered":"Workshop sessions at BETT12"},"content":{"rendered":"<p>The outputs of these sessions have been used to create a web-based Professional Knowledge Hub.<\/p>\n<p>During the sessions people followed the proceedings on Twitter, using the hashtag #MMAfA. You can view the TwitterStream and the montage of Tweets and images that Theo Kuechel has curated <a title=\"The TwitterStream and images from BETT12\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/workshop-sessions-at-bett12\/the-twitterstream-storify-curated-by-theo-kuechel\/\">on this page<\/a>. If you are interested, you can <a href=\"http:\/\/mirandamod.wikispaces.com\/Home\">join the MirandaMod wiki<\/a>.<\/p>\n<p>MirandaNet would like to thank the <a title=\"University of Bedfordshire students\" href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events\/mirandanet-bett12-programme-11th-14th-january-london\/workshop-sessions-at-bett12\/university-of-bedfordshire-students\/\">students from the University of Bedfordshire<\/a>, who provided invaluable technical support for the team throughout the sessions. Their details can be found <a title=\"University of Bedfordshire students\" href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events\/mirandanet-bett12-programme-11th-14th-january-london\/workshop-sessions-at-bett12\/university-of-bedfordshire-students\/\">here<\/a>.<\/p>\n<p><span class=\"Apple-style-span\" style=\"color: #000000; font-size: 22px; line-height: 32px;\">The classroom is not the only place for learning<\/span><\/p>\n<h3><a title=\"The classroom is not the only place for learning\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/the-classroom-is-not-the-only-place-for-learning\/\">Exploiting mobile technologies in learning<\/a> (Part One)<strong><br \/>\nWednesday 11<sup>th<\/sup> January. <\/strong><\/h3>\n<p>The London Mobile Learning Group (<a href=\"http:\/\/www.londonmobilelearning.net\">www.londonmobilelearning.net<\/a>) draws on the findings from their international research to inform the work of practitioners supporting at-risk learners. The session outlined the key principles of the socio-cultural ecology of mobile learning with particular emphasis on at-risk learners and with reference to specific mobile learning projects. The topics under discussion were: different ways of integrating mobile media into schools in constructive learning contexts; bridging the gap between the use of technologies in school and in everyday life; and harnessing the power of mobile technologies in promoting learning in informal contexts.<\/p>\n<p>Invited experts who introduced the themes will include Professors Norbert Pachler and Ben Bachmair, Institute of Education, University of London and John Cook, London Metropolitan University.<\/p>\n<h2>Improving opportunities in school for at-risk learners<\/h2>\n<h3><a title=\"Improving access to achievement using digital technologies\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/improving-access-to-achievement-using-digital-technologies\/\">Exploiting mobile technologies in learning<\/a> (Part Two)<strong><br \/>\nWednesday 11<sup>th<\/sup> January <\/strong><\/h3>\n<p>This workshop introduced practical approaches and solutions to teaching and learning with mobile technologies:<\/p>\n<ul>\n<li>teaching approaches, systematic change management issues and dos &amp; don&#8217;ts concerning the implementation of mobile learning in classrooms;<\/li>\n<li>benefits and challenges of bringing tablet PCs (such as iPads) into schools ; and<\/li>\n<li>learner-generated videos and community platform specific solutions for at-risk learners.<\/li>\n<\/ul>\n<p>The short presentations were followed by open discussions where participants provided their own experience and responded to questions. Invited experts were: Judith Seipold, MirandaNet Fellow (London Mobile Learning Group), Klaus Rummler (University of Bremen) and Luise Ludwig (Johannes Gutenberg-Universität Mainz); Ruth Lydall, Deputy Headteacher &amp; Future Leader Programme, Andy Gill, Head of Faculty ICT, Copland Community School, Brent.<\/p>\n<h2>Tools for improving effective learning for vulnerable learners<\/h2>\n<h3><a title=\"Improving access to achievement using digital technologies\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/improving-access-to-achievement-using-digital-technologies\/\">Improving access to achievement using digital technologies<\/a> (Part One)<strong><br \/>\nThursday 12<sup>th<\/sup> January<\/strong><\/h3>\n<p>Participants explored what has been learnt about the value of digital technologies for vulnerable learners. Themes included diversifying styles of teaching, exploring independent learning and harnessing the power of learning technologies used in the home and in social exchanges. Speakers included Brendan Heath,  Assistant Headteacher  Wilmington Grammar School for Boys.<\/p>\n<h3><a title=\"Empowering students to harness the power of social networking for learning\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/empowering-students-to-harness-the-power-of-social-networking-for-learning\/\">Improving access to achievement using digital technologies<\/a> (Part Two)<strong> <\/strong><\/h3>\n<h3><strong>Thursday 12<sup>th<\/sup> January<\/strong><\/h3>\n<p>In this session the key themes related to the role that parents, carers and the wider community can take in using social media and publication opportunities to improve the learning chances of vulnerable young people.<\/p>\n<p>Participants discussed what is known about the value of digital technologies for vulnerable learners and what questions need to be answered about building communities of learners. Themes included: the importance of carers, parents and the wider community, exploring independent learning and harnessing the power of learning technologies used in the home and in social exchanges.<\/p>\n<h2>World wide educational innovation<\/h2>\n<h3><a title=\"World-wide educational innovation (1)\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/world-wide-educational-innovation-1\/\">Using the social media to enhance learning communities for teachers and students<\/a><strong><\/strong><\/h3>\n<h3><strong>Friday 13th January<\/strong><\/h3>\n<p>Being part of a virtual community can be a powerful means of learning if the participants know how to use these powerful social media wisely, safely and for positive learning outcomes. In this live conference leading practitioners and theoreticians debated the value and the dangers of social networking in learning contexts at home and in school. The participants looked at current practice and future developments to anticipate how social networking might be used to support vulnerable learners and their teachers, and what checks and balances need to be put in place to harness the power of these new media. There was a focus on case studies where social networking has already increased learning opportunities for teachers and students. Invited experts introducing the theme included: Christina Preston, Bedfordshire University;  Eeva Leinonen, Kings College, University of London; Dr John Cuthell, Leon Cych and Theo Keuchel, Senior MirandaNet Fellows, Pam Smith, Associate Principal Consultant: Outstream Consulting. Sangheet Bhullar, Wisekids.<\/span><\/p>\n<h2><span class=\"Apple-style-span\" style=\"font-size: 17px; line-height: 25px;\"><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/?page_id=815\">Raising the achievement of pupils who are not reaching their full learning potential: senior manager perspective<\/a><\/span><\/h2>\n<h3><strong> Friday 13<sup>th<\/sup> January <\/strong><\/h3>\n<p>This workshop was supported by experts from professional organisations and companies who have been engaged in writing three recent publications that  can inform the debate:<\/p>\n<p><a href=\" http:\/\/www.wlecentre.ac.uk\/cms\/index.php?option=com_content&amp;task=view&amp;id=363&amp;Itemid=87\">Pachler, N, C. Preston, J. Cuthell, A. Allen and Pinheiro Torres (2011)  The ICT CPD Landscape in England. Becta <\/a><\/p>\n<p><strong>EDUSummit IT report<\/strong> (UNESCO Paris, 2011) written by world educators who are looking at ways in which vulnerable learners can be supported by digital technologies in a range of global contexts: rural and urban; privileged and underprivileged; learners who are challenged and those who are gifted and talented. A key element of this report is the need for better deployment strategies by senior managers in ensuing that digital technologies can be exploited in school. Experts introducing the themes will be Dr Christina Preston, Professor of Educational Innovation, Bedfordshire University; Professors Margaret Cox and Eeva Leinonen, and Dr Mary Webb, Kings College, University of London; John Galloway.<\/p>\n<p><strong>UK White Paper on Digital Technologies in Education <\/strong>(London 2011) developed by leading professional organizations, Naace, MirandaNet, ITTE and the Schools Network. Lead participants, who will concentrate on case studies of effective practice, will be Bernadette Brookes, Richard Allen, Outstream, and Allison Allen, Naace; Rachel Jones, Steljes; Ray Barker, BESA; Hannah Jones,  SLICT. Other contributors will include authors of an ITTE white paper on ICT in education  from teacher educators (ITTE 2011) as well as Steve Moss, Partnership for Schools, Doug Brown, Step A international, Jan Lepeltak, UPS, Pete Bradshaw, Open University, Dra. Silvina Gvirtz,  Gerente Inclusión Digital Educativa Programa Conectar Igualdad, Argentina, Lord Lucas, Behind the Screen, Des Chavunduka, Zimbabwe.<\/p>\n<h3><span class=\"Apple-style-span\" style=\"color: #000000; font-size: 22px; line-height: 32px;\">Professional development<\/span><\/h3>\n<h3><a title=\"Teachers taking charge of their own professional learning\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/teachers-taking-charge-of-their-own-professional-learning\/\">Teachers taking charge of their own professional learning<\/a><\/h3>\n<p><strong>Designing effective continuing professional development programmes in digital technologies<br \/>\n<\/strong><\/p>\n<h3><strong>Saturday 14<sup>th<\/sup> January<\/strong><\/h3>\n<p>Members of ITTE and MirandaNet investigated existing research findings to consider the best ways for participants to learn new ways of exploiting digital media to engage vulnerable learners. In this live workshop some of the international contributors came in online from Australia.<\/p>\n<p>Speakers included Professor Christina Preston, University of Bedfordshire, Sarah Younie, Leicester University, Eva Dakich, Victoria University, Melbourne, Rodger Carroll, Chisholm Institute, Melbourne, Dr John Cuthell from MirandaNet, Jack Whitehead, Bath University, Maria Huxtable, Bath and North East Somerset, Center for Child and Family and Liverpool Hope University, Margaret Farren, Dublin City University, Dave Smith, London Borough of Havering, Albin Wallace, Church Schools Trust, Kayhan Karli, Ogretmen Akademisi Vakfi &#8211; Teachers Academy Foundation, John Galloway.<\/p>\n<p><a href=\"http:\/\/www.beds.ac.uk\/howtoapply\/departments\/es\/marilyn-leask\/publications  \">Leask, M and Preston, C. (2009) ICT tools for future teachers. Brunel University for BECTA<\/a><\/p>\n<h3><span class=\"Apple-style-span\" style=\"color: #000000; font-size: 22px; line-height: 32px;\">One world for learning<\/span><\/h3>\n<h3><a title=\"World-wide educational innovation (2)\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12-11th-14th-january-london\/world-wide-educational-innovation-2\/\">Developing global publishing opportunities for teachers and their pupils in curriculum exchange projects<\/a><\/h3>\n<h3><strong>Saturday 14<sup>th<\/sup> January<\/strong><\/h3>\n<p>Research shows that learning improves when self esteem is high. In this context, engaging with other children around the world is known to promote a strong sense of identity and personal value.<strong> <\/strong>World Ecitizens teacher members discussed the value of their curriculum exchange projects between schools with MirandaNet Fellows and colleagues from countries including Czech Republic, India, Germany, France, Australia. The aim, to set up some projects between attendees, will be reported on during the coming year. The participants continued their discussion over a meal, after BETT had closed for the year.<\/p>\n<p>Classroom experts introducing the themes included: Lawrence Williams, World Ecitizens’ Trustee; Katya Toneva, Middlesex University and International School, London; Andree Jordan, Ravensbourne School, Bromley; Marion Scott Baker, Cheam Pre-prep School; Benjamin Semwayo,  Paul Vale, Glenys Hart, David Obst, Gaynor Sharpe, Anne Gilleran, EUN partnership, Poncelet O. Ileleji, The Gambia YMCAs Computer Training Centre &amp; Digital Studio, Nigel Riley, Plymouth University, Jane Finch, Learning Technologies Adviser, Dr Annamarie Mostert, Sacred Heart College Research and Development Unit, John Sosna, Great Ormond St. Hospital.<\/p>\n<p>MirandaNet would like to thank the <a title=\"University of Bedfordshire students\" href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events\/mirandanet-bett12-programme-11th-14th-january-london\/workshop-sessions-at-bett12\/university-of-bedfordshire-students\/\">students from the University of Bedfordshire<\/a>, who provided invaluable technical support for the team throughout the sessions. Their details can be found <a title=\"University of Bedfordshire students\" href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events\/mirandanet-bett12-programme-11th-14th-january-london\/workshop-sessions-at-bett12\/university-of-bedfordshire-students\/\">here<\/a>.<br \/>\n<span style=\"color: #000000;\"><strong><br \/>\n<\/strong><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The outputs of these sessions have been used to create a web-based Professional Knowledge Hub. During the sessions people followed the proceedings on Twitter, using the hashtag #MMAfA. You can view the TwitterStream and the montage of Tweets and images that &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/mirandamods\/mirandamods-at-bett\/bett12\/workshop-sessions-at-bett12\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":44,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/103"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/comments?post=103"}],"version-history":[{"count":16,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/103\/revisions"}],"predecessor-version":[{"id":115,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/103\/revisions\/115"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/44"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/media?parent=103"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}