{"id":11,"date":"2012-02-14T13:08:20","date_gmt":"2012-02-14T13:08:20","guid":{"rendered":"http:\/\/www.mirandanet.org\/mirandamods\/?page_id=11"},"modified":"2015-05-24T08:45:42","modified_gmt":"2015-05-24T08:45:42","slug":"2011-2012","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/mirandamods\/2011-2012\/","title":{"rendered":"Learning Futures"},"content":{"rendered":"<p style=\"text-align: center;\"><a title=\"mmshift2 by Learn4Life, on Flickr\" href=\"http:\/\/www.flickr.com\/photos\/learn4life\/6485966863\/\"><img loading=\"lazy\" class=\"alignnone\" src=\"http:\/\/farm8.staticflickr.com\/7030\/6485966863_56722456b6.jpg\" alt=\"mmshift2\" width=\"500\" height=\"281\" \/><\/a><\/p>\n<h3 align=\"center\"><\/h3>\n<h3 align=\"center\"><strong>in association with<\/strong><\/h3>\n<h3 align=\"center\"><strong>Befordshire University and BCSE, BESA, InspireWords, Immersive Education, NelsonThorne, Radiowaves and  Steljes<\/strong><\/h3>\n<p>The<a href=\"http:\/\/www.mirandanet.org.uk\"> MirandaNet Fellowship<\/a> professional community invites educators to join us, face-to-face or online, to discuss the role of digital technologies in enriching learning. Policy makers, senior managers, teachers and student teachers will all benefit from participating in these unconferences, called <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMods<\/a>, where the contribution of the participants, mostly teachers, is valued as much the expert input from educators. We aim to build on the contributions to create new knowledge together. It’s rather like Twitter on steroids.<\/p>\n<h1>Exploring Education Futures: November 5th – 7th 2012<\/h1>\n<div>\n<h3><strong>Exploring Education Futures: linking digital technologies, grassroots practice and the making of policy<\/strong><\/h3>\n<p><em>A professional development event organised by the MirandaNet Fellowship, Education Futures Collaboration, and the Future Learning Research Centre, University of Bedfordshire, Bedford, UK. Also with support of MirandaNet Associates: LightSpeed, Iris, Steljes and Toshiba.<\/em><\/p>\n<p>The event will be held at the Park Inn Hotel, St. Mary&#8217;s Street, Bedford.<\/p>\n<p><a href=\"http:\/\/www.beds.ac.uk\/howtoapply\/departments\/es\/the-future-of-learning-events\">Register here<\/a>.<\/p>\n<p>Hotel registration only <a href=\"http:\/\/tiny.cc\/3cbilw\">here<\/a>.<\/p>\n<p><strong>Introduction<\/strong><\/p>\n<p>This event will be a three day professional development event at which we are proposing new ways of working collaboratively to influence policy and practice. The participants are educators, developers of digital education technologies and government representatives.<\/p>\n<p>This process has been developing over the last thirty years. The work at this conference will take further the issues that have been raised at a variety of meetings in 2012:  the MirandaNet conference in Prague; two Education Futures Collaboration in London and Wolverhampton;  and,  meetings about initiatives being developed by the Department of Education to explore evidence-based education.<\/p>\n<p>From these different sources the participants have identified areas of interest focused on Exploring Education Futures through technologies:<\/p>\n<ul>\n<li>continuing professional development led by Rachel Jones<\/li>\n<li>building professional knowledge led by Matthew Pearson<\/li>\n<li>developing an evidence based profession led by Marilyn Leask<\/li>\n<li>safeguarding identities, wellness and safety led by Carsten Trinitis<\/li>\n<li>developing theories of learning led by Sarah Younie<\/li>\n<\/ul>\n<p>It is anticipated that further areas of interest will be generated through the course of the conference.<\/p>\n<p><strong>MONDAY 5th Nov: 1000 – 1630 MirandaMod 1700 – 1830<\/strong><\/p>\n<p><strong>Exploring Education Futures: emerging technologies and their implications for practice.<\/strong><\/p>\n<p><strong>Digital technologies and  practice. Where are we? Who are we influencing?<\/strong><\/p>\n<p>Introduced and chaired by Dr Chris Yapp<\/p>\n<p>This is an interactive session  between MirandaNetters in Bedford and colleagues from around the world. Participants are expected to talk for no more than 5 minutes and allow for questions and comments. Presentation software is not recommended as it impedes the flow of the discussion unless illustrations are essential to the argument.<\/p>\n<p>Participants: Bob Harrison, Toshiba; Eva Dakich, Victoria University, Melbourne; David Obst, Technische Universität, Dresden;  Poncelet Ileleji, Gambia; David Longman, Swansea University; Liam Murphy: Dan Ainscow; Fiona Aubrey Smith; Katya Toneva.<\/p>\n<h3>You can <a href=\"http:\/\/flashmeeting.e2bn.net\/fm\/fmm.php?pwd=0f7cd9-16088\">watch the MirandaMod recording<\/a><\/h3>\n<p>The session starts 30 minutes in to the recording. The first section is where participants are testing their settings.<\/p>\n<p>You can access abstracts and presentations from the conference and the MirandaMod <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/exploring-education-futures-linking-digital-technologies-grassroots-practice-and-the-making-of-policy\/abstracts\/\">here<\/a>.<\/p>\n<h2>Earlier events in the Learning Futures series<\/h2>\n<h2>MirandaMod Three: Assessing the value of physical and virtual spaces in enriching learning.<\/h2>\n<\/div>\n<p><strong>May 3rd 1630-1930<\/strong><\/p>\n<p><em>“One of the greatest changes can be seen in the lives of children and young people, who are at ease with the world of technology and who communicate, socialise and participate online effortlessly….. Yet the classrooms of today don&#8217;t reflect these changes.” Michael Gove 2011<\/em><\/p>\n<p><strong>Part One 1630<\/strong><\/p>\n<p>Looking into space: Chris Yapp<br \/>\nLearning in Space: Nusrat Faizullah<br \/>\nTo ban, or not to ban? Social networking\u2028: Leon Cych<br \/>\nSkills for virtual environments &#8211; developing e-facilitation skills:\u2028 John Cuthell<br \/>\nLearning in games spaces: Donna Burton-Wilcock<br \/>\nAre Twitterers Twits? Virtual life in 140 characters:  Matthew Pearson<br \/>\nSchool involved in global learning: Glenys Hart<br \/>\nUniversities creating learning spaces for schools? Dicle Kortantamer<br \/>\nCopyright and web publishing: Theo Keuchel<\/p>\n<p><strong>Part Two 1830 Workshop<\/strong><\/p>\n<p>Into the liminal space: from social networking to collaborative knowledge creation<\/p>\n<p>Marilyn Leask, Gareth Evans, John Cuthell, Andrea Raiker and Christina Preston<\/p>\n<p>********************************************************<\/p>\n<h2>Professional development in the use of digital technologies for educators<\/h2>\n<p><strong>Accreditation<\/strong> These  MirandaMod events provide an opportunity to meet the MirandaNet tutors who will be running <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/professional-development-programmes\/\">iCatalyst<\/a> Professional Development programmes in digital technologies at the University of Bedfordshire from September 2012. You can sign up at variety of postgraduate levels for a short or long course. <a href=\"\/consultancy\/professional-development-programmes\/\">Read more&#8230;..<\/a><\/p>\n<p><strong>A professional development workshop 3rd March 2012<br \/>\n<\/strong><\/p>\n<p>As a taster for the  <a href=\"\/consultancy\/professional-development-programmes\/\">iCatalyst<\/a> programme the MirandaNet team invites you to join our workshop,  <em><strong>An &#8216;un&#8217; what? How to run an unconference,<\/strong><\/em> that will be held before the MirandaMod on May 3rd.  This will also include a follow up workshop and support setting up an event in-house. <a href=\"\/researchexchange\/events-2\/1123-2\/\">More information about this training session on the Bedford campus from 1300-1530<\/a><\/p>\n<p><strong>Background<\/strong><\/p>\n<ul>\n<li><a href=\"\/mirandamods\">MirandaMods as a continuing professional development tool<\/a><\/li>\n<li><a href=\"\/mirandamods\/2011-2012\/the-future-of-learning-series\/\">Resources from the MirandaMod at University Bedfordshire 30<sup>th<\/sup> November 2011<\/a><\/li>\n<li><a href=\"\/mirandamods\/mirandamods-at-bett\/bett12\/\">Resources from University Bedfordshire students working on MirandaMods at BETT12 in London January 2012<\/a><\/li>\n<\/ul>\n<p><strong>How to get there:<\/strong><\/p>\n<p>The Learning Hub, Bedfordshire University, Bedford.<\/p>\n<p>Main reception, Bedford Campus, Polhill Avenue, Bedford MK41 9EA<\/p>\n<p><a href=\"http:\/\/www.beds.ac.uk\/studentlife\/registration\/map  \">Map of the Bedford campus<\/a><\/p>\n<p>There is parking on site at low cost.<\/p>\n<p>(Note: this event is not at the Luton campus.)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>in association with Befordshire University and BCSE, BESA, InspireWords, Immersive Education, NelsonThorne, Radiowaves and  Steljes The MirandaNet Fellowship professional community invites educators to join us, face-to-face or online, to discuss the role of digital technologies in enriching learning. Policy makers, &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/mirandamods\/2011-2012\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":1,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/11"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/comments?post=11"}],"version-history":[{"count":38,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/11\/revisions"}],"predecessor-version":[{"id":677,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/11\/revisions\/677"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/media?parent=11"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}