{"id":145,"date":"2012-02-15T10:30:33","date_gmt":"2012-02-15T10:30:33","guid":{"rendered":"http:\/\/www.mirandanet.org\/mirandamods\/?page_id=145"},"modified":"2012-07-03T11:47:20","modified_gmt":"2012-07-03T11:47:20","slug":"whats-a-mirandamod","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/mirandamods\/whats-a-mirandamod\/","title":{"rendered":"What&#8217;s a MirandaMod?"},"content":{"rendered":"<p><a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/wp-content\/uploads\/2012\/02\/Tag-cloud.jpg\"><img loading=\"lazy\" class=\"size-medium wp-image-174 aligncenter\" title=\"Tag cloud\" src=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/wp-content\/uploads\/2012\/02\/Tag-cloud-300x164.jpg\" alt=\"\" width=\"300\" height=\"164\" srcset=\"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-content\/uploads\/2012\/02\/Tag-cloud-300x164.jpg 300w, https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-content\/uploads\/2012\/02\/Tag-cloud.jpg 1020w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><br \/>\nThe term ‘unconference’ is a generic term for an informal conference among peer professionals, who come together to set their agenda and determine the format and content of their conference, rather than having to accept the more formal agenda of traditional conference committees and organisers. Participants are seen as equals, regardless of status, culture and nationality. The unconference mode of informal learning has recently been modified by professional educators from MirandaNet in a version called a MirandaMod . In these events a wide range of education professionals choose a theme for a face-to-face meeting. Others join in across national boundaries, using a range of such digital communications as video conferencing, microblogging and collaborative concept maps. The technologies used – whether laptops, smartphones, desktop computers or Netbooks – enable people to participate from a range of locations. Some lead participants set the tone in five-minute talks, usually without presentation software, and further contributions can be selected by the chairperson to achieve a balance in participation between teachers, researchers and teacher educators.<\/p>\n<p>Many of the educators in MirandaNet are interested in exploring the theories and the pedagogies underpinning their teaching practice, which means that those pursuing postgraduate studies find the debate merging with their formal learning. These MirandaMods, therefore, provide an innovative extension to Continuing Professional Development (CPD) where professionals collaborate to manage their own learning agenda. This online and virtual social interaction was first recorded face-to-face in the process of building ‘communities of practice’ as a means of informal learning (Lave and Wenger, 1991).<\/p>\n<p>Braided Learning theory (Haythornthwaite, 2007; Preston 2008; Preston and Cuthell 2011) tracks the informal dynamic knowledge creation in the collaborative contexts of MirandaNet and MirandaMods, as participants move from textual debate in a conventional mailing list to video conferencing, micro blogging contributions and collaborative concept maps. This collaborative technology creates a liminal space – a term drawn from anthropology that describes a rite of passage, in which a person moves from one state of being to another. In the MirandaMod communities participants are observed to be transformed in this liminal space by acquiring new knowledge, a new status and a new identity in the community. If learning is to be successful, this change is of critical importance. Whilst remote and informal learning is largely is what has been understood about mobile learning, the concept can now be extended to include these informal spaces in which learning takes place – the liminal spaces that those who push the boundaries of digital possibilities now inhabit intellectually (Cuthell, Preston, Kuechel and Cych, 2009).<\/p>\n<p>Our work aims to extend understanding of liminal spaces and their contribution to the Braided Learning process. The processes can be described as a form of Bricolage (Levi Strauss, 1962), in which people build new knowledge from what is at hand.<\/p>\n<p>You can download some papers on MirandaMods<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/wp-content\/uploads\/2012\/02\/Liminal-Spaces-Bremen.pdf\">Liminal Spaces<\/a> (Cuthell, Cych &amp; Preston), presented at the Mobile Learning conference in Bremen, March 2011.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/wp-content\/uploads\/2012\/02\/Master-140312-v-10.pdf\">Master 140312 v 10<\/a>. Collaborative professional Learning (Andrea Raiker, Christina Preston, John Cuthell in draft)<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/wp-content\/uploads\/2012\/02\/Beyond-collaboration.pdf\">Beyond collaboration<\/a> (Cuthell and Preston 2005)<\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/\">Publications<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The term ‘unconference’ is a generic term for an informal conference among peer professionals, who come together to set their agenda and determine the format and content of their conference, rather than having to accept the more formal agenda of &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/mirandamods\/whats-a-mirandamod\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":6,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/145"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/comments?post=145"}],"version-history":[{"count":13,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/145\/revisions"}],"predecessor-version":[{"id":153,"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/pages\/145\/revisions\/153"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/mirandamods\/wp-json\/wp\/v2\/media?parent=145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}