{"id":40,"date":"2009-02-23T09:52:00","date_gmt":"2009-02-23T09:52:00","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=40"},"modified":"2015-02-03T12:31:51","modified_gmt":"2015-02-03T12:31:51","slug":"creating-maps-of-ideas-christina-preston","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=40","title":{"rendered":"Creating Maps of Ideas."},"content":{"rendered":"<p><a href=\"http:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/concept-maps.jpg\"><img loading=\"lazy\" class=\"aligncenter size-medium wp-image-358\" title=\"concept-maps\" src=\"http:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/concept-maps-300x225.jpg\" alt=\"concept-maps\" width=\"300\" height=\"225\" srcset=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/concept-maps-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/concept-maps.jpg 500w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/p>\n<p style=\"text-align: center;\">Building Learning Power Mind Map by <strong><a href=\"http:\/\/www.flickr.com\/photos\/vaxzine\/\">vaXzine<\/a><strong> <span style=\"font-weight: normal;\">cc Creative Commons<\/span><\/strong><\/strong><\/p>\n<p><strong>Creating Maps of Ideas<\/strong><br \/>\n<strong><em>Christina Preston<\/em><\/strong><\/p>\n<p>Concept mapping is the formation of connections between concepts or ideas by using links which may or may not be labelled. Pioneered by J.Novak and developed by many researchers like McAleese, Ahlberg and Jonnassen, concept mapping is a more cognitively demanding form of diagrammatic representation.<br \/>\nThe development of graphic representations Representations are what cognitive processes act on in creativity, learning and understanding to construct meanings of the world. They have internal and external expression.<br \/>\n• External representations of knowledge involve both symbolic, as in linguistic forms, and analogical representations, as in graphic or pictorial forms.<br \/>\n• Internal representations are able to represent only some aspects of the environment and parallel external representations by differences between propositional and analogical representations.<br \/>\n&#8211; Propositional representations capture ideational content of mind and are language-like.<br \/>\n&#8211; &#8211; Analogical representations tend to be perceptual images: visual, auditory or kinaesthetic.<br \/>\n&#8211; How can we access external and internal representations that indicate quality of learning?<br \/>\n&#8211; • A method for supporting ideation and the generation of connections between thoughts or accepted concepts is the use of diagrammatic forms of representation about the world.<br \/>\n&#8211; • These diagrammatic representations have different levels of complexity which develop from spidergrams into concept mapping.<br \/>\n&#8211; • Concept mapping is more advanced and includes relational links, to keep the mapping refined and of a higher order of representation.<br \/>\n&#8211; • A way of strengthening links is to include vectors. This enhances the connections visually, impacting on the relational interpretation between the concepts, making the relationship more meaningful in terms of actional and transactional structure.<br \/>\n&#8211; • The combination of both graphic and linguistic notation in concept mapping may more closely define the idea or concept being represented and reduces the possible number of interpretations.<br \/>\nIs there a valid place in practice for another form of expression to compete with literacy, art and drama? The development of ICT-based concept mapping software has meant that mapping can be designed using digital objects available in multimedia. This has meant an evolution of the term concept mapping to multimodal mapping to encompass representation in auditory, graphic, image, videographic, cinematic and text modalities.<\/p>\n<p><strong>Useful communities<\/strong><br \/>\nUseful communities include:<br \/>\nInstitute for Human and Machine Cognition &#8211; Organisation started by Joseph Novak that inaugurated the World Congress into Concept Mapping. Many resources and research papers to download [www.ihmc.us]<br \/>\nWWMAPS Project &#8211; An interesting project linking ideas through multilingual concept mapping [www.2wmaps.com]<br \/>\nINTEL’s visual mapping tool and community &#8211; Online tool and community. [www.intel.com]<br \/>\nInspiration Ltd &#8211; Resources and info about concept mapping from a well known product.<br \/>\n[www.inspiration.com]<br \/>\ni4C &#8211; Online tutorial for using Inspiration software<br \/>\n[www.internet4classrooms.com]<\/p>\n<p><strong>Self-study resources<\/strong><br \/>\nThe best way to learn about mapping ideas is to have a go!<\/p>\n<p>What resources can we use?<\/p>\n<ul>\n<li> New technologies and the digital resources provide opportunities for interaction, participation, and the active demonstration of imagination, production, purpose, originality and value that may not be available when using traditional media and resources.<\/li>\n<li> In an analysis of ICT capability Loveless (2003) generated a set of criteria that identify features of ICT as: Provisionality; Interactivity; Capacity; Range; Speed; Automatic functions<\/li>\n<li> These features facilitate easy construction, revision and storage of concept mapping when using ICT-based resources such as Inspiration, IHMC Cmap Tools and INTEL’s Seeing Reason.<\/li>\n<\/ul>\n<p>Starting to map: For example in creating a story.<\/p>\n<ol>\n<li> Think of the concepts or ideas that you wish to explore.<\/li>\n<li> Then link them using labelled links with verbs and connectives.<\/li>\n<li> The construction of links and defining the relations between ideas are the important features of creating maps and indicate the level of understanding and knowledge of the mapping author\/authors.<\/li>\n<\/ol>\n<p>Concept maps use verbal expressions in the links and inside concept labels. The link labels can often become labels for concepts.<br \/>\nIf these possible concepts become important while constructing and improving a concept map, you may draw a frame round them and use them as ‘real’ concepts.<\/p>\n<p><strong>Activity<\/strong><br \/>\nFor practice and modelling try mapping a well known story such as ‘Matilda’ by Roald Dahl or a favourite of yours.<br \/>\nMap only the main elements from which all the and action are introduced.<br \/>\nNow try mapping the middle on a new map.<br \/>\nTry reading it back to yourself.<br \/>\nDoes it include the basic plot ‘kernel’?<br \/>\nNow map the ending. Do all three maps cover the basic plot structure of the story? Have you labelled all the links?<br \/>\nCan your maps be converted into speech and \/ or writing? Do other people agree with your ideas? Does your map accurately represent the plot ‘kernel’ ? Sometimes it is good to be able to read concept maps in the order that you intend it to be read therefore links may be numbered.<br \/>\nThese are some good self-study resources:<br \/>\nCaviglioli, O. &amp; Harris, I. (2000) Mapwise Stafford: Network Educational Press.<br \/>\nKress, G. and Van Leeuwen, T. (1996) Reading Images: The Grammar of Visual design, London: Routledge.<br \/>\nBuzan, T and Buzan, B. (2000) The Mind Map Book, London: BBC Worldwide Ltd.<br \/>\n[www.sci.sdsu.edu]<\/p>\n<p><strong>Relevant research<\/strong><br \/>\nThese are some starting points for further reading and research about multimodal maps and concept maps.<br \/>\nNovak, J.D. and Gowin, D.R. (1984) Learning How to Learn, Cambridge: Cambridge University Press.<br \/>\nNovak, J.D. (1998) Learning,Creating and Using Knowledge, New Jersey: Lawrence Erlbaum.<br \/>\nBaron, G.-L., Dansac, C., Harrari, M., Bruillard, E. (1999). European project REPRESENTATION : Modélisation conceptuelle initiale. France : Educational Multimedia Task Force.<br \/>\n[edutice.archives-ouvertes.fr]<br \/>\nThese provide good overviews to the development of graphic representations.<br \/>\nOther useful readings are:<br \/>\nSomekh, B., Mavers, D., Scrimshaw, P., Harrison, C., Hawe, K., Fisher,T., and Lewin,C. (2000) Pupil Attainment and the New Technologies: some methodological design issues in the Impact2 Project Paper presented at the British Educational Research Association Conference, Cardiff University, 7-10 September 2000. Retrieved online at: [www.leeds.ac.uk]<br \/>\nRiley, N.R. and Åhlberg, M. (2004) Investigating the use of ICT (information and communication technologies)-based concept mapping techniques on creativity in literacy tasks, Journal of Computer Assisted Learning 20, pp244-256.<br \/>\nRiley, N.R (2006) Methods for evaluating critical learning using online discussion forums, Technology, Pedagogy and Education Vol. 15, No. 1, March, pp. 63–78.<br \/>\nSome useful links can be found at: [www.w3.org] [www.indiana.edu] E Bruillard, GL Baron (2000)<br \/>\nComputer-based concept mapping: a review of a cognitive tool for students Proceedings of Conference on Educational Uses of Information [www.ifip.or.at]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Building Learning Power Mind Map by vaXzine cc Creative Commons Creating Maps of Ideas Christina Preston Concept mapping is the formation of connections between concepts or ideas by using links which may or may not be labelled. Pioneered by J.Novak and developed &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=40\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":9,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/40"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=40"}],"version-history":[{"count":11,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/40\/revisions"}],"predecessor-version":[{"id":1120,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/40\/revisions\/1120"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/9"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=40"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}