{"id":173,"date":"2009-02-23T16:03:24","date_gmt":"2009-02-23T16:03:24","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=173"},"modified":"2009-02-26T08:33:43","modified_gmt":"2009-02-26T08:33:43","slug":"case-studies-from-14-19-practitioners","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=173","title":{"rendered":"Case Studies from 14 &#8211; 19 Practitioners"},"content":{"rendered":"<p><strong>Designing an interactive whiteboard game to encourage childcare students to participate and contribute in class.<\/strong><\/p>\n<p>Author: Sandra Hall, Childcare Tutor, Bishop Auckland College, County Durham. Date: 2005<\/p>\n<p>Sandra designed a game for use with the whole class on the interactive whiteboard, mirroring the style of TV quiz games such as Countdown. She perceived that the technique encouraged class participation from typically reticent students, such that they gained knowledge and confidence simultaneously.<\/p>\n<p>Children are not the only learners who learn effectively through play, she notes. &#8220;I believe that as adults we are able to consolidate information more clearly when it is gained in an enjoyable, non-threatening learning environment in which students are involved and have a sense of belonging. This contrasts with students&#8217; past experiences of being bored and excluded in a &#8216;set to fail&#8217; situation.&#8221;<\/p>\n<p>View the full case study: <a href=\"http:\/\/tinyurl.com\/5e8q35\">http:\/\/tinyurl.com\/5e8q35<\/a><strong> <\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Teacher and students&#8217; perspectives on Smartboard use in Access and A-Level classes<\/strong><\/p>\n<p>Author: Tony Martin Sandwell College. Date: 2005<\/p>\n<p>Tony notes the following advantages of Interactive Whiteboards, giving details and examples of each:<\/p>\n<ol>\n<li>The ability to save notes and call them back in subsequent lessons.<\/li>\n<li>The opportunity to build up a complete set of notes with regard to a topic.<\/li>\n<li>Use of resources on the internet.<\/li>\n<li>Use of images in teaching.<\/li>\n<li>The use of CD Rom material.<\/li>\n<li>The opportunity for students to get involved and to develop their own skills.<\/li>\n<\/ol>\n<p>Students confirmed points 1, 3 and 5 above in their feedback forms.<\/p>\n<p>View the full case study: <a href=\"http:\/\/tinyurl.com\/szvj8\">http:\/\/tinyurl.com\/szvj8<\/a><strong> <\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Encouraging A level Accounting students&#8217; participation in sessions through use of the video playback facility on Interactive Whiteboards<\/strong><\/p>\n<p>Author: Angela Bhandari Sandwell College. Date: 2005<\/p>\n<p>Angela Bhandari used a facility to playback demonstrations on an Interactive Whiteboard to support teaching of accounting. She found that supporting students in creating short (1 minute) video clips considerably improved student retention of spreadsheet layouts. This was due to a variety of factors including:<\/p>\n<ul>\n<li>Improved student motivation<\/li>\n<li>Student ownership of the clips<\/li>\n<li>Re-usability of the clips<\/li>\n<li>The fact clips can be talked through without the need for writing everything down at the same time<\/li>\n<\/ul>\n<p>Angela emphasises the fact that the improvements to the learning experience were led by the students, which encouraged ownership.<\/p>\n<p>View the full case study: <a href=\"http:\/\/tinyurl.com\/5jpdla\">http:\/\/tinyurl.com\/5jpdla<\/a><strong> <\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Exploring The Use Of The Interactive Whiteboard With A Large Group Of Level 2 Child Care Students.<\/strong><\/p>\n<p>Author: Susan Duggan, Bishop Auckland College. Date: 2006<\/p>\n<p><strong>Summary<\/strong><\/p>\n<p>Susan investigated whether the use of an Interactive Whiteboard would help with the problems of teaching a large group of Level 2 Child Care Students. She hoped that use of the Whiteboard would make it easier to maintain the focus and attention of the group.<\/p>\n<p><strong>Action<\/strong><\/p>\n<p>The teacher devised a &#8216;Who Wants to be a Millionaire&#8217; style quiz for the group, with questions displayed on the Whiteboard and the students giving their answers via a set of voting cards. She then gathered feedback from the students via a questionnaire.<\/p>\n<p><strong>Outcomes<\/strong><\/p>\n<p>The feedback from the students was very positive, suggesting that this method of learning was both enjoyable and stimulating. The students also suggested some enhancements to the format which Susan is planning to incorporate in the future.<\/p>\n<p>View the full case study: <a href=\"http:\/\/tinyurl.com\/596l7d\">http:\/\/tinyurl.com\/596l7d<\/a><strong> <\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>The Use of Interactive White Boards in the Further Education (FE) Classroom with Entry Level Students (Promethean and Smart Boards).<\/strong><\/p>\n<p>Author: Claire Jones, Bishop Auckland College. Date: 2006<\/p>\n<p><strong>Summary<\/strong><\/p>\n<p>Claire discusses the use of Interactive Whiteboards (IWBs) with Entry Level childcare students at the college. Many of the students have little or no formal qualifications and Claire feels that using the IWBs could get them more interested and involved in lessons.<\/p>\n<p><strong>Action<\/strong><\/p>\n<p>The IWBs are used for a variety of purposes in lessons, with students compiling PowerPoint presentations, writing up their ideas and using the galleries to drag and drop objects into notepad.<\/p>\n<p><strong>Outcomes<\/strong><\/p>\n<p>Claire feels that using the IWB encourages students to participate in lessons and interact with their peers. Confidence and self-esteem is built amongst the students, although Claire warns against pressurising students into making presentations when they may not be comfortable in front of the whole class.<\/p>\n<p>View the full case study: <a href=\"http:\/\/tinyurl.com\/5oxcf5\">http:\/\/tinyurl.com\/5oxcf5<\/a><strong> <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Designing an interactive whiteboard game to encourage childcare students to participate and contribute in class. Author: Sandra Hall, Childcare Tutor, Bishop Auckland College, County Durham. Date: 2005 Sandra designed a game for use with the whole class on the interactive &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=173\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":158,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/173"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=173"}],"version-history":[{"count":6,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/173\/revisions"}],"predecessor-version":[{"id":364,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/173\/revisions\/364"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/158"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=173"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}