{"id":85,"date":"2009-02-23T11:24:39","date_gmt":"2009-02-23T11:24:39","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=85"},"modified":"2009-03-16T12:12:13","modified_gmt":"2009-03-16T12:12:13","slug":"the-neurological-basis-of-intelligence","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=85","title":{"rendered":"The neurological basis of intelligence"},"content":{"rendered":"<p align=\"center\"><strong>The neurological basis of intelligence: A contrast with &#8216;brain-based&#8217; education<\/strong><\/p>\n<p align=\"center\"><strong>John Gregory Geake<\/strong><\/p>\n<p align=\"center\"><strong><em>Westminster Institute Oxford Brookes University<\/em><\/strong><em><\/em><\/p>\n<p align=\"center\"><strong>Paper presented at the British Educational Research Association Annual Conference, University of Glamorgan, 14-17 September 2005<\/strong><\/p>\n<p align=\"center\"><strong> <em>Neuroscience and Education: the emerging dialogue<\/em><\/strong><strong> symposium<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Available at: <a href=\"http:\/\/www.leeds.ac.uk\/educol\/documents\/156074.htm\">http:\/\/www.leeds.ac.uk\/educol\/documents\/156074.htm<\/a><\/strong><\/p>\n<p><strong><a href=\"http:\/\/www.brookes.ac.uk\/schools\/education\/rescon\/Geake-BERA2005.pdf\">http:\/\/www.brookes.ac.uk\/schools\/education\/rescon\/Geake-BERA2005.pdf<\/a><\/strong><\/p>\n<h3>Abstract<\/h3>\n<p>One of the greatest challenges for cognitive neuroscience is to understand how the brain is intelligent. This paper will review recent neuroscientific studies of general intelligence, as well as specific forms of reasoning, and feature neuroimaging studies which are concerned with the more creative aspects of intelligent behaviour. These results have implications for educational policy and practice, but first we need to delineate the interpretive strengths and limitations of neuroimaging procedures, and debunk some of the prevailing neuromyths that currently infect education.<\/p>\n<h3>Educational neuroscience: A curious dichotomy<\/h3>\n<p>The current interaction between laboratory-based research into understanding learning ands intelligence – cognitive neuroscience – and endeavours by education researchers and practitioners to describe and manage learning and intelligence in classroom settings has produced what could be regarded as a curious dichotomy. On the one hand, there are those aging education academics who, after a lifetime of not understanding and disparaging all science, see no need to change their ways. On the other hand, there are the ‘brain-based’ enthusiasts who hope that the current fads of left-right thinking, brain gym, etc., will address the complexities and daily challenges of the mixed-ability classroom (Geake, 2005).<\/p>\n<p>Two leading American professors of education have called for a resolution by way of PhDs in scientifically based education research.<\/p>\n<p><em>Core courses in subjects traditional for education programs, as well as relevant interdisciplinary areas such as <strong>neuroscience<\/strong><\/em><em> … should be required for all entering doctoral students. &#8230; [T]hese courses must be scholarly, rigorous, and intense enough to bear the burden of familiarizing students with the orienting concepts [of] the field, the culture of scientific enquiry, and the special demands of research in education <\/em>(Eisenhart &amp; DeHaan, 2005)<em>.<\/em><\/p>\n<p>While generally supportive, the cognitive neuroscience community, in response to the misinterpretation of earlier findings by over-enthusiastic (albeit well-intentioned) social scientists, has become more cautious.<\/p>\n<p><em>The Editor, <\/em>Nature,<\/p>\n<p><em>Sir: Your [August 2005] Editorial &#8220;Bringing neuroscience to the classroom&#8221; and News Feature &#8220;Big plans for little brains&#8221; on the emerging connections between education and cognitive neuroscience, are both hopeful and critical at once. &#8230; There is currently a strong emphasis on the need for research findings to be both immediately available, and directly applicable to the classroom. This inadvertently sets high expectations which, if not met, could lead to the quick erosion of this developing field<\/em> (Ansari, 2005).<\/p>\n<p>One important reason for such caution is the significant variance in neural structure and function between the individual children in a normal classroom, as contrasted with the narrowly selected subjects scanned in a typical neuroimaging experiment. It can be said without fear of contradiction that every human brain that ever was, and ever will be, is unique. This includes the brains of identical twins &#8211; identical twins are not identical people &#8211; and (contra political orthodoxy) the future brains of clones. This is predominantly due to the nonlinear processes involved in neural morphogenesis as much as the unique life experiences that differentially affect our brains to make us the unique personalities that we are. Despite the variance in structure, evident to any casual observer, the brains imaged in Figure 1 are all of normal, above average intelligence, adults. Can you spot the one who speaks German as her first language? Obviously not! But this poses a significant challenge if we expect brain structural imaging to be informative about the learning prospects of individual normal (non-clinical) children.<\/p>\n<p>There are also limits to the predictive value of functional imaging. Contrast the individual activations of one subject with the final group (common) activations in Figure 2. The subject’s brain functions in this experiment are quite normal, just not identical with those in common with the group of subjects. Isn’t this what we observe behaviourally in classrooms?<\/p>\n<h3>Brain functioning of intelligence<\/h3>\n<p>However, with those caveats not withstanding, cognitive neuroscience is, despite its early years, informative about how our brains enable us to be intelligent, and thus to learn, particularly in formal educational settings. For this presentation I offer the following definition:<\/p>\n<p><em>Intelligence is context-appropriate cognitive activity involving abstraction, reasoning, learning and memory.<\/em><\/p>\n<p>Interestingly, about every two decades, a major theorist decides to conceptually re-model intelligence, usually in a binary fashion.<\/p>\n<ul>\n<li>education + reproduction (Spearman during the 1920s)<\/li>\n<li>convergent + divergent (Guilford during the 1940s)<\/li>\n<li>fluid + crystallised (Cattell during the 1960s)<\/li>\n<li>analytic + creative + practical (Sternberg during the 1980s)<\/li>\n<\/ul>\n<p>Carroll’s 1990s meta-analysis revealed three strata where modest positive significant correlations between the narrow and broad levels imply a general intelligence <em>g <\/em>as shared or common variance (Carroll, 1993). Given the variety of cognitive tasks that positively correlate, this statistical notion of <em>g<\/em> raises the question of whether <em>g<\/em> has a basis in common brain activities, i.e., whether there are there discernable neural correlates of general intelligence <em>g<\/em>?<\/p>\n<p>A positron emission tomography (PET) study of high-<em>g<\/em> vs. low-<em>g<\/em> IQ test items by John Duncan’s group at the MRC Brain and Cognition Unit, Cambridge, found bilateral inferior prefrontal cortex activations for high-<em>g<\/em> over low-<em>g<\/em> items for both spatial AND verbal tasks (Duncan et al, 2000). A subsequent meta-analysis of 20 neuroimaging studies of cognition found that the centres of activation clustered within these same bilateral inferior prefrontal cortical areas, regardless of the type of task: analogical reasoning, literacy; mathematics, deduction, induction and so on (Duncan, 2001). So much for multiple intelligences! To explain this finding, Duncan speculated that:<\/p>\n<p><em>Neurons in selected frontal regions adapt their properties to code information of relevance to current behaviour, pruning away … all that is currently task-irrelevant.<\/em><\/p>\n<p>In other words, frontal neurons, of which humans have relatively more, support intelligent behaviour by processing information in a flexible task-adaptive manner, in some contrast to most other neurons in the brain whose information processing bandwidth is quite narrow and specific.<\/p>\n<p>From Duncan’s imaging results one could predict that individual differences in intelligence could be attributable to individual differences in frontal function and structure. Evidence to support this prediction comes from several sources. A post-mortem study in Soviet Russia found that gifted people exhibit superior neurophysiology in frontal areas.<\/p>\n<p><em>The density of localisation of neurons and gliocytes and the thickness of cortical layers in frontal area fields BA 8 and 47 in gifted people of different ages exceeded (more than double) those of controls <\/em>(Orzhekhovskaia, 1996).<\/p>\n<p>As every neuron synapses on to as many as 10,000 others, a doubling of density of neurons could result in a massive increase in computing power, rather like moving up from a 386 to a Pentium 4.0 processor. Of course such a study which correlated measures of IQ with features of brain morphology was only possible in a society where IQ testing was universal. Moreover, it has to be said that a postmortem study might be of limited value for the teaching of live children.<\/p>\n<p>More recently, a Californian-based group under Dick Haier used magnetic resonance imaging (MRI) to count grey matter densities in live subjects (Haier et al, 2005). Voxel-based morphometry (VBM) indicated about 6% of grey matter volumes throughout the brain correlated with subjects’ IQ scores. Consistent with earlier studies, most of these sites are in the frontal lobes. Additionally, correlations were found in the parietal lobes (more so for older subjects), and temporal lobes (more so for younger subjects), with different patterns for males and females in grey and white matter clusters.<\/p>\n<p>Moving away from IQ scores as the only correlates of intelligence, Haier’s group also found that differences in <em>g<\/em> predicted brain functioning on non-reasoning tasks. It seems that highly intelligent people think about everything differently, not just difficult IQ test questions (Haier et al, 2003). This could explain why gifted children much prefer to socialise and learn with other gifted children (Gross, 1993), and is consistent with Vigneua, Caissie and Bors (2006) who found differences in strategies on classroom tasks that correlated with levels of intelligence, viz., that high intelligence children employed more constructive matching of information to task goal and effective inhibition of task-irrelevant information, just as Duncan speculated.<\/p>\n<p>But the most rewarding aspect of teaching gifted children is their often quirky creativity. How does the brain generate insights, crack jokes, compose wonderful tunes, solve difficult problems, think up interesting research questions, write poetry, and so on? That is, what are the neural correlates of creative intelligence? The ‘father’ of modern psychology, William James, conceptualised creative intelligence as analogy-making (1890\/1950, p. 530).<\/p>\n<p><em>A native talent for perceiving analogies is … the leading fact in genius of every order.<\/em><\/p>\n<p>Of course, students aren’t the only people being intelligent in classrooms. A characteristic of good teachers and scholars is their ability to intelligently create analogies for explanation and clarification.<\/p>\n<p>Consequently, I was interested in investigating the possible neural correlates of analogy making as a way to better understand creative intelligence. Using fluid analogy letter strings (Hofstadter, 1995) as stimuli in an fMRI experiment, we found a suite of activations in frontal, parietal and temporal areas (Geake &amp; Hansen, 2005). However, when we correlated the areas of activation with verbal intelligence as assessed by the (simple) National Adult Reading Test (NART), we found a significant positive linear relationship (r = 0.73) for two frontal cortical regions, BA 9 and BA 46, similar regions to those found by Duncan, Orzhekhovskaia and Haier.<\/p>\n<p>In fact, activity in the lateral prefrontal cortex occurs in all neuroimaging studies of cognitive function (Gray &amp; Thompson, 2004). This is because the functioning of this area of the frontal cortex supports Working Memory, the ability to connect information from the task at hand, including its goals, with information from memory store, and then to make connections and evaluate putative solutions with the information to hand. That is, Working Memory is required in all cognition. Therefore, it could be a worthwhile pedagogical objective to explicitly educate to maximise Working Memory functioning. This in turn assumes some operational fractionation of Working Memory function that is susceptible to educational mediation. Some potential candidates for research into this assumption include:<\/p>\n<ul>\n<li>Short-term memory capacity;<\/li>\n<li>Evaluating relevance;<\/li>\n<li>Accessing appropriate LTM store;<\/li>\n<li>Making creative analogic connections;<\/li>\n<li>Delaying closure.<\/li>\n<\/ul>\n<p>As promising as such separate investigations might turn out, it must always be born in mind that such neural processes do not occur isolation. To the contrary, the key concept for understanding how the brain enables intelligence is functional connectivity. To this end, the main new thrust of research in cognitive neuroscience in this coming decade is the mapping of functional connectivity, that is, how functional modules transfer information, anatomically, bio-chemically, bio-electrically, rhythmically, and possibly in other ways which we have not yet even realised.<\/p>\n<h3>Popular nonsense about the brain<\/h3>\n<p>Cognitive neuroscience research into the brain basis of intelligence is an exciting, rich, and complex story that will take years (if ever) to unfold. It is a shame, therefore, that many in the education profession have been misled into believing an ever-widening plethora of neuromyths: so-called brain-based claims for educational practice. A large part of the blame for this sorry state of affairs must lie at the feet of the academic educational establishment – those professors of education in the prestigious departments whose head-in-the-sociological-sand attitude towards hard science has left them impotent to offer any informed warnings for or guidance to teachers at the chalk face (Geake, 2005).<\/p>\n<p><em>1. &#8220;We only use 10% of our brains&#8221;<\/em><\/p>\n<p>This has to be the craziest neuromyth of all, and it is quite frightening how widespread it has become. To be blunt, if you are only using 10% of your brain, then you had better hope (not that you would be capable of it) that your relatives turn the life-support machine off. All of the cells in a healthy brain are functioning all of the time. They have to be – the brain has evolved to enable us to cope with not knowing what is going to happen next. (To do this, neurons continually fire at random in order to be ready for action when needed).<\/p>\n<p>The history of this popular nonsense is an odd confluence.<\/p>\n<ul>\n<li>Italian neuro-surgery removing scoops of brains of psychiatric patients to test for neural redundancy (1880s);<\/li>\n<li>Einstein imploring us to think more (1920);<\/li>\n<li>American advertisers of home-help manuals (1930).<\/li>\n<\/ul>\n<p>The wishful thinking educationists in recent decades who subscribe to this myth would presumably be less enthusiastic if they knew of its bizarre lineage, or thought about how the human brain evolved to be as complex as it has. As Beyerstein (1999) points out, evolution does not produce excess, much less 90% excess. In fact, in the millions of neurological studies ever conducted, no one has ever found an unused portion of the brain!<\/p>\n<p><em>2. &#8220;Left and right brain thinking&#8221;<\/em><\/p>\n<p>This neuromyth is based on clinical research in the 1960s describing lateralised functioning in split-brained patients who had their corpus callosum severed in an attempt to reduce their severe epilepsy, and more recent psychophysical and neuroimaging research showing that in most people, the semantic system is left-lateralised. The resulting over-simplification says that the ‘left-brain’ thinks analytically, the ‘right-brain’ thinks holistically, and therefore these two ‘brains’ can be taught separately in the classroom. Everything in this claim is wrong. Most brain functions occur bilaterally, i.e., in both hemispheres. This is true for higher order cognition such as reviewed above, and for keeping our bodies ticking over, body states typically being represented contra-laterally (e.g., actions of the right hand determined in the left motor cortex).<\/p>\n<p>The corpus callosum is a massive band of white matter fibres which run between the tow hemispheres, whose purpose is to connect the relevant functional modules in each. Without an efficient corpus callosum, our left hand might not literally know what our right hand was doing. All normal people, including the children in our classrooms, have an intact corpus callosum. Their cerebral hemispheres do not operate in isolation. All the information available in one gets transferred to the other. We do not have two brains in one, just one brain exhibiting, like many body parts, bilateral symmetry. Now, it is certainly true that some more recently evolved higher-order cognitive abilities, especially language, are more laterally than bilaterally represented. But here it is critical to be cautious about extrapolating results from the lab into the classroom. In the vast majority of neuroimaging studies, only right-handed subjects are used. This is deliberate; to obtain a statistically significant group effect the functional modules of the subjects should be in much the same place. For language, this is true for 95% of right-handers, but only true for 60% of left-handers, and generally less true for females than males. Thierry, Giraud and Price (2003) summarise their fMRI results on language lateralisation (that language is left hemisphere function, while graphic and emotional processing is a right hemisphere function) as &#8220;A significant quantitative bias found in the brains of extremely right-handed subjects.&#8221; These researchers then offer a warning:<\/p>\n<p><em>It is dangerous to suppose that language processing only occurs in the left hemisphere of all people.<\/em><\/p>\n<p>Sex differences are important here. Females generally have thicker corpus callosa, with more robust projections and connections, perhaps supporting the observation of a positive female bias towards multi-tasking. Research by Fine et al (2005) in Texas found a correlation between the thickness of the corpus callosum and reading difficulties in children, mostly boys. The section of the corpus callosum that is critical connects language areas in the left hemisphere with their homolgues in the right. If our hemispheres were separate ‘brains’ then such connectivity presumably would not matter. But it does – we do not have two brains in one.<\/p>\n<p><em>3. &#8220;Dominant learning styles: Visual, Auditory, Kinaesthetic&#8221;<\/em><\/p>\n<p>This neuromyth says that everyone is either a V, A or K-type learner. This claim erroneously assumes that individual differences in perceptual acuity are maintained throughout higher-order information processing and ultimately with learning. It is a false assumption. Neuroimaging studies into cross-modal processing have demonstrated that input modalities in the brain are inter-linked (Calvert et al, 2000) – visual with auditory, visual with motor, motor with auditory, visual with taste, and so on. A moment’s reflection shows this must be the case. If you are out walking at night and hear a sudden sound behind you, you immediately turn and look in that direction – accurately. Without such a highly evolved inter-modal facility we never would have survived the challenges of pre-hominid life, to find dinner, or to avoid being dinner. A more common example is watching television news with a live link where the reporter’s sound is not synchronised with the picture – we can tell there is a difference even when it is a matter of only milliseconds. People born blind appropriate their visual cortices, not their tactile cortices, for representing Braille.<\/p>\n<p>And once the brain has taken in information, it is then abstracted to be processed, mostly unconsciously (Luria, 1966; Dehaene &amp; Naccache, 2001), with obvious exceptions where the modality is part of the information as in music or visual art. But here, as teachers, we want our charges to change their perceptual modalities to be the most appropriate – auditory for music, visual for art, and so on. The DfES website advice to stream children into classes of V, A or K learners is not only impossible (teachers report that their children aren&#8217;t constant in their VAKness), but creates a dilemma – should you then teach to their supposed strengths, or to their supposed weaknesses? The DfES suggests both! Better to return to the lessons in ITT 101 from 1950 and vary the lesson presentation with visual, auditory and hands-on activities.<\/p>\n<p><em>4. &#8220;Brain gym&#8221;<\/em><\/p>\n<p>The claim here is that children can stimulate specific parts of their brains by doing particular physical exercises. As it stands, this is quite untrue. But what is true is that physical exercise of almost any kind can enhance blood flow to all parts of the body including the brain. In school, that’s a good thing, and explains why so many teachers report that ‘brain gym’ seems to ’work’. Physical exercise before class was, of course, a regular practice in primary schools in days gone by. The vasculature of the brain is all pervasive – blood flow is everywhere. Tweaking one’s left ear lobe is not going to stimulate just one bit of cortex. Interestingly, the logic behind fMRI is somewhat the reverse. The cognitive stimulation of areas of brain cause increases in local blood flow (the neurons synapsing on to capillaries self-regulate their oxygen supply), but the reverse is not true in the specific sense claimed by ‘brain gym’.<\/p>\n<h3>Classroom implications<\/h3>\n<p>Ban disconnected approaches to teaching by ignoring L and R brain nonsense, expelling MI from curriculum design, and eradicating VAK from pedagogy. Rather, encourage neural connectivity by promoting novel joined-up thinking, and rewarding creative analogising. And do lots of old-fashioned gym.<\/p>\n<h3>References<\/h3>\n<p>Ansari, D. (2005). Time to use neuroscience findings in teacher training. <em>Nature,<\/em> 437, 26 (1 September).<\/p>\n<p>Beyerstein, B. L. (1999). Pseudoscience and the brain: Tuners and tonics for aspiring superhumans. In S. D. Sala (Ed.), <em>Mind myths: Exploring popular assumptions about the mind and brain<\/em> (pp. 59-82). John Wiley: Chichester.<\/p>\n<p>Calvert, G. A., Campbell, R. &amp; Brammer, M. J. (2000). Evidence from functional magnetic resonance imaging of crossmodal binding in human heteromodal cortex. <em>Current Biology,<\/em> 10(11), 649-657.<\/p>\n<p>Carroll, J. B. (1993). Human Cogntive Abilities. Cambridge University Press.<\/p>\n<p>Dehaene, S. &amp; Naccache, L. (2001). Towards a cognitive neuroscience of consciousness: Basic evidence and a workspace framework. <em>Cognition,<\/em> 79, 1-37.<\/p>\n<p>Duncan, J. 2001. An adaptive coding model of neural function in prefrontal cortex. <em>Nature Reviews Neuroscience,<\/em> 2, 820-829.<\/p>\n<p>Duncan, J., Seitz, R. J., Kolodny, J., Bor, D., Herzog, H., Ahmed, A., Newell, F. N. and Emslie, H. 2000. A neural basis for general intelligence. <em>Science,<\/em> 289, 457-460.<\/p>\n<p>Eisenhart, M. &amp; DeHaan, R. L. (2005)<em>.<\/em> Doctoral preparation of scientifically based education researchers.<em> Educational Researcher, <\/em>34(4), 3-13.<\/p>\n<p>Fine, J. G., Semrud-Clikeman, M., Keith, T. Z., Stapleton, L. M. &amp; Hynd, G. W. (2005). <em>Reading and the corpus callosum: An MRI volumetric study<\/em>. Brain, Neuroscience and Education SIG, AERA, Montreal, April.<\/p>\n<p>Geake, J. G. (2005). Educational neuroscience and neuroscientific education: In search of a mutual middle way. <em>Research Intelligence<\/em>, 92, 10-13.<\/p>\n<p>Geake, J. G. &amp; Hansen, P. (2005). Neural correlates of intelligence as revealed by fMRI of fluid analogies. <em>NeuroImage, <\/em>26(2),<em> <\/em>555-564.<\/p>\n<p>Gray, J. R. and Thompson, P. M. (2004). Neurobiology of intelligence: Science and ethics. <em>Nature Neuroscience Reviews,<\/em> 5, 471-482.<\/p>\n<p>Gross, M. U. M. (1993). <em>Exceptionally Gifted Children<\/em>. Routledge: London.<\/p>\n<p>Haier, R. J., White, N. S. &amp; Alkire, M. T. (2003). Individual differences in general intelligence correlate with brain functioning during nonreasoning tasks. <em>Intelligence<\/em>, 31(5), 429-441.<\/p>\n<p>Haier, R. J., Jung, R. E., Yeo, R. A., Head, K. &amp; Alkire, M. T. (2005). The neuroanatomy of general intelligence. <em>NeuroImage<\/em>, 25, 320-327.<\/p>\n<p>Hofstadter, D. R. (1995). <em>Fluid Concepts and Creative Analogies<\/em>. Basic Books, New York.<\/p>\n<p>James, W. (1890\/1950). <em>The Principles of Psychology<\/em>. Henry Holt: New York.<\/p>\n<p>Luria, A. R. (1966). <em>Human Brain and Psychological Processes<\/em>. Harper &amp; Row: New York.<\/p>\n<p>Orzhekhovskaia, N. S. (1996). The cytoarchitectonic characteristics of the frontal fields of the brain in gifted people. <em>Morfologiia<\/em>, 109(3), 7-9.<\/p>\n<p>Thierry, G., Giraud, AL, &amp; Price, C. (2003). Hemispheric dissociation in access to the human semantic system. <em>Neuron<\/em>, 38, 499–506.<\/p>\n<p>Vigneua, F., Caissie, A. &amp; Bors, D. (2006). Eye-movement analysis demonstrates strategic influences on intelligence. <em>Intelligence,<\/em> 34(3),<em> <\/em>261-272.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The neurological basis of intelligence: A contrast with &#8216;brain-based&#8217; education John Gregory Geake Westminster Institute Oxford Brookes University Paper presented at the British Educational Research Association Annual Conference, University of Glamorgan, 14-17 September 2005 Neuroscience and Education: the emerging dialogue &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=85\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":80,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/85"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=85"}],"version-history":[{"count":4,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/85\/revisions"}],"predecessor-version":[{"id":559,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/85\/revisions\/559"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/80"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=85"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}