{"id":122,"date":"2009-02-23T12:23:07","date_gmt":"2009-02-23T12:23:07","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=122"},"modified":"2009-02-26T10:59:33","modified_gmt":"2009-02-26T10:59:33","slug":"why-use-visuals","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=122","title":{"rendered":"Why use visuals?"},"content":{"rendered":"<p>Jay Cross, Internet Time Group<\/p>\n<p>We humans are sight-mammals. We can learn almost twice as well from images and words as from words alone. Visuals engage both hemispheres of the brain. Pictures translate across cultures, education levels, and age groups. Yet the majority of the content of corporate learning is text. Schools spend years on verbal literacy and but hours on visual literacy. It’s high time for us to open our eyes to the possibilities.<\/p>\n<p>Visual literacy accelerates learning because the richness of the whole picture can be taken in at a glance. Visual metaphors unleash new ideas and spark innovation. Having a sharper eye increases the depth of one’s perception and enjoyment of life.<\/p>\n<p>Rather than walk you through the nuances of color, tone, texture, proportion, and so forth, I want to simply share some ways visuals are contributing to my own learning.<\/p>\n<h3>Creating Your Own Visions<\/h3>\n<p>Visualization is a two-way street. I can create pictures as well as look at them. I often draw a mind map simply to brainstorm on my own and clarify my thinking. For example, here were my goals for an eLearning Forum session on Envisioning Learning.<\/p>\n<p>This mind map was created by MindJet’s Mind Manager, a program that’s as easy to learn as any I’ve ever seen. For simple diagrams, I rely on the drawing functions of Word or PowerPoint.<\/p>\n<p>I am not an artist, so when I want to express myself, select pictures from a collection of symbols I put together over the last year. For example: To convey meaning, I assemble simple pictures to convey concepts, e.g. where we focus most of our attention. (I draw these with PaintShop Pro, a $99 clone of PhotoShop.)<\/p>\n<p>When digital cameras came out, I had to have one. Now I carry a pocket camera nearly all the time. I use my photos in presentations, e.g. here’s some informal learning going on:<\/p>\n<p>Moore’s Law<\/p>\n<p>If you want to see more of what’s going on about you, I recommend that you either carry a camera or pretend that you are, and be alert for good shots.<\/p>\n<p>Framing potential shots trains you to see more clearly and focuses your attention on things you might not have otherwise noticed. The flowers here are beautiful today.<\/p>\n<h3>Bringing People Together<\/h3>\n<p>Group graphics are similar to virtual prototypes, for they are an external representation of ideas. Imagine a senior management team discussing a new strategy. A business artist is simultaneously translates their discussion into large, wall-mounted drawings. Paper murals. Periodically, the group checks the murals and the relationships it implies. Is that what we meant? Is there a better way? The group tries to make the picture right instead of trying to score political points. When they have concluded, a re-drawn map is how they communicate the substance of the meeting throughout the organization.<\/p>\n<p>(See the accompanying graphic from X-PLANE.)<\/p>\n<h3>Open Your Eyes<\/h3>\n<p>We shouldn’t rush to convert all training programs into pictograms, charts, and cartoons. The appropriate role for graphics is amplifying written presentation, not substituting for it.<\/p>\n<p>There remains an immense opportunity. First of all, visuals accelerate the learning process, and time is worth more than money. Second, visuals make meetings more productive, efficient, and memorable. Third, no large players are paying attention to this market; they just don’t get it. I suspect that understanding abstract art and interpreting financial statements are mutually exclusive skills.<\/p>\n<p>It’s time to rebel from the half-wit notion that words and numbers are somehow better than visuals. Get the picture?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Jay Cross, Internet Time Group We humans are sight-mammals. We can learn almost twice as well from images and words as from words alone. Visuals engage both hemispheres of the brain. Pictures translate across cultures, education levels, and age groups. &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=122\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":109,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/122"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=122"}],"version-history":[{"count":5,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/122\/revisions"}],"predecessor-version":[{"id":486,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/122\/revisions\/486"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/109"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=122"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}