{"id":674,"date":"2010-02-18T14:22:07","date_gmt":"2010-02-18T14:22:07","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=674"},"modified":"2010-02-18T14:22:07","modified_gmt":"2010-02-18T14:22:07","slug":"what-happens-when-you-give-a-class-of-8-year-old-children-an-ipod-touch-each","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=674","title":{"rendered":"What happens when you give a class of 8 year-old children an iPod touch each?"},"content":{"rendered":"<h2><span style=\"font-weight: normal; font-size: 13px;\">The most powerful form of learning is autonomous, when the technology enables pupils to become independent learners, to undertake and achieve things that would never have been possible without the enabling technology. This examples shows the impact on a primary school classroom when all the pupils in the class were provided with networked iPod touches. The possibilities of Type 2 applications of ICT, identified in 1991 by Maddux, are now part of the reality of these 8 year-old children.<\/span><\/h2>\n<p>One primary school decided to equip a whole class with iPod Touch devices. The class teacher, head teacher and pupils discuss the project, and how they use the iPods. One of the many things that’s inspiring is the language the children use to describe the processes they use.<\/p>\n<p>Leon Cych (<a href=\"http:\/\/www.l4l.co.uk\/\">http:\/\/www.l4l.co.uk\/<\/a>) wrote about the project when he visited in the primary school some two weeks after it started.<\/p>\n<p>“<em>The wonderful thing about my job is that I have a network of people I can visit who are involved with prototyping the use of new technologies in education. My latest outing was to a Junior School with a difference this week. Peter Barrett, an old colleague of mine, had told me about the seed of this idea some months back. Knowing Peter I guessed it would be quite ambitious. We have worked on a number of innovation projects in the past and he never fails to surprise me…<\/em><\/p>\n<p><em>As well as the school going through a massive rebuilding programme, they have also introduced a set of iPod touches into one year 4 class, for each child, to see what happens. All the touches are networked through an Apple Airport Extreme and out onto the internet through the school’s connection. It is not every day you see this sort of thing. So I offered to pop along and make a video of their progress after a couple of weeks. In the first week that the children have had them, they seemed to be quite at home using the applications and devices &#8211; but it’s early days… Here is a brief video record of reflections and practice of that use…<\/em>”<\/p>\n<p><a href=\"http:\/\/www.l4l.co.uk\/?p=835\">What do 8 year-old children do with an iPod Touch?<\/a><\/p>\n<p>The video file is embedded in the player above. You will be prompted to download a plug in if your browser is unable to display the player.<\/p>\n<p>The file will start downloading when you click on the Play button, but might take a little while before there is enough downloaded for it to play. You can click on the image to view in full screen, and click again to return to this web page.<\/p>\n<p><strong>Leon Cych<\/strong> is a web designer, coder, teacher, poet, artist, broadcaster, journalist and educationalist. He set up the nationwide poetry magazine &#8211; Poetry London Newsletter in the seventies. You can follow Leon on Twitter: @eyebeams, or his blog <a href=\"http:\/\/www.L4L.co.uk\/\">Learn4Life<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The most powerful form of learning is autonomous, when the technology enables pupils to become independent learners, to undertake and achieve things that would never have been possible without the enabling technology. This examples shows the impact on a primary &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=674\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":916,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/674"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=674"}],"version-history":[{"count":14,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/674\/revisions"}],"predecessor-version":[{"id":961,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/674\/revisions\/961"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/916"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=674"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}