{"id":103,"date":"2009-02-23T11:52:46","date_gmt":"2009-02-23T11:52:46","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=103"},"modified":"2009-02-25T16:00:59","modified_gmt":"2009-02-25T16:00:59","slug":"is-technology-rewiring-our-brains","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=103","title":{"rendered":"Is technology rewiring our brains?"},"content":{"rendered":"<h3>Researchers seek a better understanding of technology&#8217;s effects on reading, learning<\/h3>\n<p class=\"MsoNormal\">What does a teenage brain on Google look like? Do all those hours spent online rewire the circuitry? Could these kids even relate better to emoticons than to real people? These sound like concerns from worried parents. But they&#8217;re coming from certain brain scientists.<\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Violent video games have gotten a lot of public attention, but some current concerns go well beyond gaming. Some scientists think the wired world might be changing the way we read, learn, and interact with each other.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">There are no firm answers yet, but Dr. Gary Small, a psychiatrist at UCLA, argues that daily exposure to digital technologies such as the internet and smart phones can alter how the brain works.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">When the brain spends more time on technology-related tasks and less time exposed to other people, it drifts away from fundamental social skills such as reading facial expressions during conversation, Small asserts.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">So brain circuits involved in face-to-face contact can become weaker, he suggests. That might lead to social awkwardness, an inability to interpret nonverbal messages, isolation, and less interest in traditional classroom learning.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Small says the effect is strongest in so-called digital natives&#8211;people in their teens and 20s who have been &#8220;digitally hard-wired since toddlerhood.&#8221; He thinks it&#8217;s important to help the digital natives improve their social skills and older people&#8211;digital immigrants&#8211;improve their technology skills.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">At least one 19-year-old internet enthusiast gives Small&#8217;s idea a mixed review. John Rowe, who lives near Pasadena, Calif., spends six to 12 hours online a day. He flits from instant messaging his friends to games like Cyber Nations and Galaxies Ablaze to online forums for game players and disc jockeys.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Social skills? Rowe figures he and his buddies are doing just fine in that department, thank you. But he thinks Small might have a point about some other people he knows.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">&#8220;If I didn&#8217;t actively go out and try to spend time with friends, I wouldn&#8217;t have the social skills that I do,&#8221; said Rowe, who reckons he spends three or four nights a week out with his pals. &#8220;You can&#8217;t just give up on having normal friends you see on a day-to-day basis.&#8221;<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">More than 2,000 years ago, Socrates warned about a different information revolution&#8211;the rise of the written word, which he considered a more superficial way of learning than the oral tradition. More recently, the arrival of television sparked concerns that it would make children more violent or passive and interfere with their education.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Small, who describes his modern-day concerns in a new book called iBrain: Surviving the Technological Alteration of the Modern Mind, acknowledges he doesn&#8217;t have an open-and-shut case that digital technology is changing brain circuitry. Still, his argument is &#8220;pretty interesting and certainly provocative,&#8221; although difficult to prove, says brain scientist Tracey Shors of Rutgers University.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Others are skeptical. Robert Kurzban, a University of Pennsylvania psychologist, said scientists still have a lot to learn about how a person&#8217;s experiences affect the way the brain is wired to deal with social interaction.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Life in the age of Google might even change how we read.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Normally, as a child learns to read, the brain builds pathways that gradually allow for more sophisticated analysis and comprehension, says Maryanne Wolf of Tufts University, author of Proust and the Squid: The Story and Science of the Reading Brain.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">She calls that analysis and comprehension &#8220;deep reading.&#8221; But that takes time, even if it&#8217;s just a fraction of a second, and today&#8217;s wired world is all about speed, gathering a lot of superficial information fast.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Wolf asks what will happen as young children increasingly do their early reading online. Will their brains respond by short-circuiting parts of the normal reading pathways that lead to deeper reading, but which also take more time? And will that harm their ability to reflect on what they&#8217;ve read?<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Those questions deserve to be studied, Wolf says. She thinks kids will need instruction tailored to gaining reading comprehension in the digital world.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Some research suggests the brain actually benefits from internet use.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">A large study led by Mizuko Ito of the University of California, Irvine, recently concluded that by hanging out online with friends&#8211;sending instant messages, for example&#8211;teens learn valuable skills they&#8217;ll need to use at work and socially in the digital age. (See <\/span><span lang=\"EN-US\">“Teenagers’ internet socializing not a bad thing.”<\/span><span lang=\"EN-US\">) That includes lessons about issues such as online privacy and what&#8217;s appropriate to post and communicate on the internet, Ito said.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Rowe, the 19-year-old, said he and his buddies often debate whether technology might actually be bad for you. That includes kicking around the argument that computer use makes people socially inept.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Of course, he added, &#8220;we spend a lot of time on the computer and still have totally normal and perfect social lives.&#8221;<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\"><strong>eSchoolNews<\/strong><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">7920 Norfolk Ave, Suite 900, Bethesda Maryland, 20814<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Tel. (866) 394-0115, Fax. (301) 913-0119<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Web: http:\/\/www.eschoolnews.com, Email: &#x57;&#101;b&#x41;&#100;m&#x69;&#110;&#64;&#x65;&#x73;&#99;&#x68;&#x6f;&#111;l&#x6e;&#101;w&#x73;&#46;c&#x6f;&#x6d;<\/span><\/p>\n<p><!--EndFragment--><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Researchers seek a better understanding of technology&#8217;s effects on reading, learning What does a teenage brain on Google look like? Do all those hours spent online rewire the circuitry? Could these kids even relate better to emoticons than to real &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=103\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":100,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/103"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=103"}],"version-history":[{"count":4,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/103\/revisions"}],"predecessor-version":[{"id":380,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/103\/revisions\/380"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/100"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=103"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}