{"id":294,"date":"2009-02-24T11:09:30","date_gmt":"2009-02-24T11:09:30","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=294"},"modified":"2010-02-22T08:00:47","modified_gmt":"2010-02-22T08:00:47","slug":"summaries-and-abstracts","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=294","title":{"rendered":"Summaries and abstracts"},"content":{"rendered":"<p><strong>Presentation and Pedagogy: The Effective Use of Interactive Whiteboards in Mathematics Lessons.<\/strong><\/p>\n<p>There has been a considerable investment in the use of interactive whiteboards in mathematics teaching in England. A research team from Keele University has worked with 12 partner school mathematics departments to evaluate the use and effectiveness of teaching when the technology is used to advantage. Evidence suggests that the presentational advantages of interactive whiteboard use are considerable and that the consequent motivational gain is to be welcomed. However, it is also clear that neither of these add to teaching effectiveness unless they are supported by teachers who understand the nature of interactivity as a teaching and learning process and who integrate the technology to ensure lessons that are both cohesive and conceptually stimulating.<\/p>\n<p>Averis, D., Glover, D., Miller, D. (2005) Presentation and Pedagogy: The Effective Use of Interactive Whiteboards in Mathematics Lessons. <a href=\"http:\/\/www.bsrlm.org.uk\/IPs\/ip25-1\/BSRLM-IP-25-1-14.pdf\">http:\/\/www.bsrlm.org.uk\/IPs\/ip25-1\/BSRLM-IP-25-1-14.pdf<\/a> (Accessed 21.10.08)<\/p>\n<p><strong>Can technology transform teaching and learning? The impact of interactive whiteboards.<\/strong><\/p>\n<p>During the past two years Interactive Whiteboards have been installed in an increasing number of classrooms in the United Kingdom. Most teachers have embraced the technology: they see it as something that supports and extends their teaching capability (Smith, 1999; Levy, 2002). The affordances of interactive whiteboard technology, however, do more than reinforce traditional classroom praxis: they provide ways to make learning an interactive process; they create possibilities for teachers to transform their role (Glover &amp; Miller, 2001). As yet, however, research evidence on the impact of IWBs on pedagogy is limited.<\/p>\n<p>Changes that have taken place in teaching and learning have previously been assessed (Cuthell, 2002). This paper describes seven action research projects across England, sponsored by MirandaNet and Promethean, that assessed the effect of Promethean ACTIVboards on student learning, the impact on pedagogical skills, and relates the evidence to a year-long national survey of school implementation of IWB technology and teacher attitudes.<\/p>\n<p>Data was collected during 2003 from teacher surveys, case studies and observation of classroom practice.<\/p>\n<p>Cuthell, J. P. (2004). Can technology transform teaching and learning? The impact of interactive whiteboards. (pp. 1133-1138) In Price, J., Willis, D., Davis, N., &amp; Willis, J. (Eds.), Proceedings of SITE 2004 Norfolk, VA: Association for the Advancement of Computing in Education <a href=\"http:\/\/www.mirandanet.org.uk\/cgi-bin\/journals\/search_ej.pl?runtype=casedisplay;cid=102;ejtype=all;origin=mnet\">http:\/\/www.mirandanet.org.uk\/cgi-bin\/journals\/search_ej.pl?runtype=casedisplay;cid=102;ejtype=all;origin=mnet<\/a> (Accessed 21.10.08)<\/p>\n<p><strong>Technology in Schools: What the Research Says.<\/strong><\/p>\n<p>Three decades after the first computer was introduced into school classrooms, educational technology remains surprisingly controversial. This paper provides a forum for informed use of technology in the context of emergent research from the learning sciences.<\/p>\n<p>Today’s schools cite a myriad of purposes for technology in schools, including improved teaching, leadership, and decision making, as well as the following student-focused purposes: Improving learning (e.g., higher standardized test scores); Increasing student engagement in learning; Improving the economic viability of students (e.g., increasing students’ abilities to succeed in a 21st century work environment; through teaming, technology fluency, and high productivity); Increasing relevance and real-world application of academics; Closing the digital divide by increasing technology literacy in all students; Building 21st Century skills (e.g., critical thinking and sound reasoning, global awareness, communication skills, information and visual literacy, scientific reasoning, productivity, and creativity).<\/p>\n<p>Fadel, C., Lemke, C. (2006) Technology in Schools: What the Research Says. Cisco Systems &amp; Metiri Group. Downloaded from: <a href=\"http:\/\/www.cisco.com\/web\/strategy\/docs\/education\/TechnologyinSchoolsReport.pdf\">http:\/\/www.cisco.com\/web\/strategy\/docs\/education\/TechnologyinSchoolsReport.pdf<\/a> (Accessed 8.05.07)<\/p>\n<p><strong>The interactive whiteboard: a literature survey.<\/strong><strong><\/strong><\/p>\n<p>Evidence from research into the use of interactive whiteboards (IAWs – here meaning an IAW connected to a computer and data projector) highlights the need for a pedagogic change from a didactic to an interactive approach to learning and teaching, and from the use of the IAW as a visual support for lessons to the integration of the technology into lesson planning. Greiffenhagen (2000) has shown that the use of the technology as an adjunct rather than as an integrated element in teaching minimises interaction and matching of teaching to learning needs. McCormick and Scrimshaw (2001) have developed this in their analysis of the contribution of ICT to pedagogic change in teaching mathematics and their contention that teaching can only be enhanced if interactivity is understood. The reality of interactivity as supported by information and communications technology in general has been explored by John and Sutherland (2005) who point to the need for teacher understanding of the relationship between subject area, the learning domain and the technology if there is to be pedagogic change, and demonstrated by Armstrong et al (2005) in their investigation of the changes inherent in teacher and learner use of IAWs as a new affordance within the classroom. Miller et al (2004) have followed similar lines of investigation to establish the developmental phases as teachers recognise the necessary pedagogic changes for effective technology use as the basis of enhanced learning.<\/p>\n<p>Glover, D., Miller, D., Averis, D. and Door, V. (2005) The interactive whiteboard: a literature survey. <em>Technology, Pedagogy and Education <\/em>(14) 2: 155-170. <a href=\"http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/docs\/Bera06Enhanced%20secondary%20maths%20and%20gesture.pdf\">http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/docs\/Bera06Enhanced%20secondary%20maths%20and%20gesture.pdf<\/a> (Accessed 21.10.08)<\/p>\n<h2>Primary school students&#8217; perceptions of interactive whiteboards<\/h2>\n<p>Students involved in the interactive whiteboard (IWB) evaluation, sponsored by the Centre for British Teachers (CfBT), were interviewed in regard to their perceptions about IWBs. Twelve group interviews (72 students) were conducted between January and Easter 2004 with Year 6 students (between 10 and 11 years of age) in six Local Education Authority (LEA) areas located in the North and South of England. Students were very enthusiastic about particular aspects of IWBs, such as their versatility in the classroom, multimedia capabilities and the fun and enjoyment they brought to learning. Students also highlighted, however, technical problems, teacher and students&#8217; information and communication technology skills and students&#8217; lack of access to the technology as negative aspects.<\/p>\n<p>Hall, I. Higgins, S. (2005) Primary school students&#8217; perceptions of interactive whiteboards. Journal of Computer Assisted Learning 21 (2), 102–117. Blackwell<\/p>\n<h2>Embedding ICT in the Literacy and Numeracy Strategies<\/h2>\n<p>The purpose of this document is to present the findings from the evaluation of the ‘Embedding ICT in the Literacy and Numeracy Strategies’ pilot project.  In this project interactive whiteboards (IWBs) were installed in Year 5 and Year 6 classes in 12-15 schools in each of six Local Education Authorities (LEAs): Cumbria, Bracknell Forest, Lewisham, Oxfordshire, Redcar and Cleveland, and Wakefield. In each of these LEAs a local co-ordinator was appointed as an IWB Consultant to manage the project locally and to provide training and support to the teachers involved. The pilot project ran from Autumn 2002 to Summer 2004.<\/p>\n<p>The evaluation, undertaken by a team based in the Centre for Learning and Teaching in the School of Education Communication and Language Sciences at Newcastle University investigated aspects of classroom interaction through a series of structured observations, the views of teachers and pupils through interviews, teachers’ weekly records of IWB use and the impact on pupils’ attainment through their performance in national Key Stage 2 tests. In addition a literature review was undertaken to support both the pilot project and the evaluation.<\/p>\n<p>Higgins, S., Clark. J., Falzon. C., Hall, I., Hardman, F., Miller, J., Moseley, D., Smith, F. and Wall, K. (2005) Embedding ICT in the Literacy and Numeracy Strategies: Final Report April 2005 Newcastle Upon Tyne: Newcastle University. <a href=\"http:\/\/partners.becta.org.uk\/page_documents\/research\/univ_newcastle_evaluation_whiteboards.pdf\">http:\/\/partners.becta.org.uk\/page_documents\/research\/univ_newcastle_evaluation_whiteboards.pdf<\/a> (Accessed 21.10.08)<\/p>\n<h2>Technology, literacy and learning: a multimodal approach<\/h2>\n<p>With the recent explosion of technology into the world of education across the globe, this book sets out a framework for rethinking the three key areas of schooling that are most affected by technology&#8217;s impact on education today: knowledge as curriculum; learning and pedagogy; and literacy across the curriculum.<\/p>\n<p>The book takes the reader through an analysis of teaching and learning with materials such as CD-ROMs, websites, the Internet, computer programming applications and computer games, relating each in turn to the main curriculum topics. Through this detailed scrutiny the following questions emerge:<\/p>\n<ol>\n<li>How do the new technologies reshape knowledge as curriculum?<\/li>\n<li>How does the use of new technologies in the classroom reshape learning pedagogy?<\/li>\n<li>As writing moves from page to screen, what is the impact on students&#8217; situated literacy practices and learning? Through these questions, this book demonstrates that modes of representation, technology and curriculum knowledge are fundamentally connected, and describes how teacher and students roles in the classroom could be altered in the face of new technologies.<\/li>\n<\/ol>\n<p>Jewitt, C (2006) Technology, literacy and learning: a multimodal approach, London: RoutledgeFalmer. <a href=\"http:\/\/ioewebserver.ioe.ac.uk\/ioe\/cms\/get.asp?cid=16841&amp;16841_0=16846\">http:\/\/ioewebserver.ioe.ac.uk\/ioe\/cms\/get.asp?cid=16841&amp;16841_0=16846<\/a><\/p>\n<p>A Review Of The Research Literature On Barriers To The Uptake Of ICT By Teachers.<\/p>\n<p>This report brings together evidence from a range of sources on the actual and perceived barriers to the uptake of ICT by teachers, as identified in a review of some of the available literature associated with teachers’ use of ICT, and also by education practitioners who took part in a small scale survey, carried out by Becta. It is published in conjunction with a companion report looking at the factors which enable teachers to make successful use of ICT (Scrimshaw, 2004).<\/p>\n<p>Jones, A. (2004) <em>A Review Of The Research Literature On Barriers To The Uptake Of ICT By Teachers<\/em>. Coventry: Becta<\/p>\n<p>Researching the influence of interactive presentation tools on teacher pedagogy.<\/p>\n<p>It is unusual to focus educational research on a particular piece of equipment, but the interactive whiteboard (IWB) seems to have a pedagogical and cultural status which makes it different from other new pieces of ICT equipment.  It particular, it has been enthusiastically adopted by nearly all the teachers who have one installed in their classrooms, and is sought after by most of the teachers who do not currently have access to one.  A group of researchers has formed within BERA New Technologies SIG, covering several projects in the UK which have been funded to investigate, directly or indirectly, the impact of the IWB on teaching and learning.<\/p>\n<p>On behalf of the BERA group, this paper reviews recent research concerning the use<\/p>\n<p>of IWBs and:<\/p>\n<ul>\n<li>analyses the nature of the medium<\/li>\n<li>characterises the associated pedagogies<\/li>\n<li>synthesises some roles for the IWB<\/li>\n<li>discusses what we have found concerning the potential of the technology for supporting ‘engaging pedagogies’;<\/li>\n<\/ul>\n<p>It also considers the effects of national policy contexts on our work in the UK, raises issues for other countries and helps to generate questions concerning what we do not yet know.<\/p>\n<p>Kennewell, S. (2004) Researching the influence of interactive presentation tools on teacher pedagogy. Paper presented at BERA 2004 <a href=\"http:\/\/www.aare.edu.au\/06pap\/ken06138.pdf\">http:\/\/www.aare.edu.au\/06pap\/ken06138.pdf<\/a> (Accessed 21.10.08)<\/p>\n<p style=\"text-align: right;\">John Cuthell<\/p>\n<p style=\"text-align: right;\">MirandaNet<\/p>\n<p style=\"text-align: right;\"><a href=\"http:\/\/www.virtuallearning.org.uk\/\">Virtual Learning<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Presentation and Pedagogy: The Effective Use of Interactive Whiteboards in Mathematics Lessons. There has been a considerable investment in the use of interactive whiteboards in mathematics teaching in England. A research team from Keele University has worked with 12 partner &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=294\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":17,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/294"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=294"}],"version-history":[{"count":6,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/294\/revisions"}],"predecessor-version":[{"id":1033,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/294\/revisions\/1033"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/17"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=294"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}