{"id":299,"date":"2009-02-24T11:15:41","date_gmt":"2009-02-24T11:15:41","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=299"},"modified":"2009-07-09T13:42:13","modified_gmt":"2009-07-09T12:42:13","slug":"bibliographies-and-references","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=299","title":{"rendered":"Bibliographies and references"},"content":{"rendered":"<p><strong>Interactive Whiteboard Bibliography<\/strong><\/p>\n<p>Armstrong, A., Barnes, S., Sutherland, R., Curran, S., Mills, S., Thompson, I. (2005) Collaborative research methodology for investigating teaching and learning: the use of interactive whiteboard technology. Educational Review, Volume 57, Issue 4 November 2005 , pages 457 &#8211; 469<\/p>\n<p>Averis, D., Glover, D., Miller, D. (2005) Presentation and Pedagogy: The Effective Use of Interactive Whiteboards in Mathematics Lessons.<br \/>\n<a href=\"http:\/\/www.bsrlm.org.uk\/IPs\/ip25-1\/BSRLM-IP-25-1-14.pdf\">http:\/\/www.bsrlm.org.uk\/IPs\/ip25-1\/BSRLM-IP-25-1-14.pdf<\/a><\/p>\n<p>Ball, B. (2003) Teaching and learning mathematics with an interactive whiteboard. <em>Micromath, 19 (1) 4-7<\/em><\/p>\n<p><em> <\/em><\/p>\n<p>Beauchamp, G., Parkinson, J. (2005) Beyond the ‘wow’ factor: developing interactivity with the interactive whiteboard. School Science Review, March 2005, 86(316)<\/p>\n<p>Becta (2003a) Primary Schools &#8211; ICT and Standards: An analysis of national data from Ofsted and QCA. Coventry: Becta<\/p>\n<p>Becta (2003b) Secondary Schools &#8211; ICT and Standards: An analysis of national data from Ofsted and QCA. Coventry: Becta<\/p>\n<p>Becta (2003c) What the research says about interactive whiteboards<br \/>\n<a href=\"http:\/\/www.becta.org.uk\/page_documents\/research\/wtrs_whiteboards.pdf\">http:\/\/www.becta.org.uk\/page_documents\/research\/wtrs_whiteboards.pdf<\/a><\/p>\n<p>Becta (2004a) Getting the most from your interactive whiteboard: A guide for secondary schools. Coventry: Becta<\/p>\n<p>Becta (2004b) Planning to purchase an interactive whiteboard <a href=\"http:\/\/www.becta.org.uk\/leas\/leas.cfm?section=6_2&amp;id=3160\">http:\/\/www.becta.org.uk\/leas\/leas.cfm?section=6_2&amp;id=3160<\/a><\/p>\n<p>Beeland, W. D. (2002) &#8220;Student Engagement, Visual Learning and Technology: Can Interactive Whiteboards Help?&#8221; Action Research Exchange, 1(1).<br \/>\n<a href=\"http:\/\/chiron.valdosta.edu\/are\/Artmanscrpt\/vol1no1\/beeland_am.pdf\">http:\/\/chiron.valdosta.edu\/are\/Artmanscrpt\/vol1no1\/beeland_am.pdf<\/a><\/p>\n<p>Bell, MA (2002) Why use an interactive whiteboard? A baker’s dozen reasons! <em>Teachers.Net Gazette <\/em>3 (1)<br \/>\n<a href=\"http:\/\/teachers.net\/gazette\/JAN02\/mabel.html\">http:\/\/teachers.net\/gazette\/JAN02\/mabel.html<\/a><\/p>\n<p>Bonnett, M. (2001) Is ICT changing the nature of knowledge &#8211; and does it matter? <em>Information Technology in Teacher Education<\/em>, 39.<\/p>\n<p>Brown, D., Steinbacher, C., Turpin, T., Butler, R. and Bales, C. (2004) <em>History of EloTouchSystems <\/em><br \/>\n<a href=\"http:\/\/www.elotouch.com\/company\/history.asp\">http:\/\/www.elotouch.com\/company\/history.asp<\/a><\/p>\n<p>Brown, S. (2004) Interactive Whiteboards in Education. TechLearn<\/p>\n<p>Burden, K. (2002) Learning from the bottom up – the contribution of school based practice and research in the effective use of interactive whiteboards for the FE\/HE sector. Paper presented at Making an Impact Regionally Conference (The Earth Centre, Doncaster, Friday 21st June 2002)<\/p>\n<p>Clarke, C (2004) Speech to BETT. Downloaded from:<br \/>\n<a href=\"http:\/\/www.teachernet.gov.uk\/community\/webcasts\/bett2004\/transcripts\/clarke7jan04\/\">http:\/\/www.teachernet.gov.uk\/community\/webcasts\/bett2004\/transcripts\/clarke7jan04\/<\/a><\/p>\n<p>Cogill, J (2002) How is the interactive whiteboard being used in the primary school and how does this affect teachers and teaching?<\/p>\n<p>Cuthell, J. P. (2003) Interactive Whiteboards: new tools, new pedagogies, new learning? Reflections from teachers. Downloaded from:<br \/>\n<a href=\"http:\/\/www.virtuallearning.org.uk\/iwb\/index.html\">http:\/\/www.virtuallearning.org.uk\/iwb\/index.html<\/a><\/p>\n<p>Cuthell, J. P. (2004). Can technology transform teaching and learning? The impact of interactive whiteboards. (pp. 1133-1138) In Price, J., Willis, D., Davis, N., &amp; Willis, J. (Eds.), Proceedings of SITE 2004 Norfolk, VA: Association for the Advancement of Computing in Education<\/p>\n<p>Cuthell, J. P. (2005a) The Impact of Interactive Whiteboards on Teaching, Learning and Attainment. In Price, J., Willis, D., Davis, N., &amp; Willis, J. (Eds.), Proceedings of SITE 2005 (pp. 1353 – 1355) Norfolk, VA: Association for the Advancement of Computing in Education<\/p>\n<p>Cuthell, J. P. (2005b) Seeing the meaning. The impact of interactive whiteboards on teaching and learning. In: Proceedings of WCCE 05, Stellenbosch, South Africa<\/p>\n<p>Cuthell, J. P. (2006) Tools for Transformation: The Impact of Interactive Whiteboards in a range of contexts. In Crawford, C. M., Carlsen, R., McFerrin, K., Price, J. Weber, R., Willis, D. A.  (Eds.), Proceedings of SITE 2006 (pp. 1491 – 1497) Norfolk, VA: Association for the Advancement of Computing in Education<\/p>\n<p>Cuthell, J. P. (2007) Ambassadors for ACTIVlearning. In Carlsen, R., McFerrin, K., Price, J. Weber, R., Willis, D. A.  (Eds.), Proceedings of SITE 2007 (pp. 1443 – 1499) Norfolk, VA: Association for the Advancement of Computing in Education<\/p>\n<p>Cuthell, J. P., Preston, C. (2005) Teaching in ICT-rich environments – using e-learning to create a knowledge base for 21st century teachers. In: Leask, M. &amp; Paschler, N. Learning to teach using ICT in the Secondary School, 2nd Edition. London Routledge<\/p>\n<p>DfEE (1998) Initial Teacher Training National Curriculum for the use of information and communications technology in subject teaching, Circular 4\/98 Annex B. London: Department for Education and Employment.<\/p>\n<p>DfES (2001) NGfL Pathfinders: Preliminary report on the roll out of the NGfL programme in ten Pathfinder LEAs. NGfL Research and Evaluation Series Number 2<\/p>\n<p>DfES. (2003a) Survey of Information and Communications Technology in Schools.<br \/>\n<a href=\"http:\/\/www.dfes.gov.uk\/ictinschools\">http:\/\/www.dfes.gov.uk\/ictinschools<\/a> (27 July 2004)<\/p>\n<p>DfES. (2003b) Fulfilling the potential, policy statement on ICT signed by Charles Clarke<\/p>\n<p>DfES.(2004) Interactive whiteboards &#8211; frequently asked questions.<br \/>\n<a href=\"http:\/\/www.dfes.gov.uk\/ictinschools\/ict_active\/factfile.cfm?articleid=511\">http:\/\/www.dfes.gov.uk\/ictinschools\/ict_active\/factfile.cfm?articleid=511<\/a> (11 Nov 2004)<\/p>\n<p>Earl, N., Watson, L., Katz, S. (2003) <em>Large-scale Education Reform: Life-cycles and implications for sustainability. <\/em>Reading: CfBT<\/p>\n<p>Ertmer, P., Addison, P., Lane, M., Ross, E. &amp; Woods, D. (1999) Examining Teachers’ Beliefs about the Role of Technology in the Elementary Classroom., <em>Journal of Research on Computing in Educatio<\/em>n, <strong>32 <\/strong>(1), pp. 54-72. 98<\/p>\n<p>Fadel, C., Lemke, C. (2006) Technology in Schools: What the Research Says. Cisco Systems &amp; Metiri Group. Downloaded from:<br \/>\n<a href=\"http:\/\/www.cisco.com\/web\/strategy\/docs\/education\/TechnologyinSchoolsReport.pdf\">http:\/\/www.cisco.com\/web\/strategy\/docs\/education\/TechnologyinSchoolsReport.pdf<\/a><\/p>\n<p>Gerard, F. et al., (1999) Using SMART Board in foreign language classrooms. Proceedings of SITE 99: Norfolk, VA: Association for the Advancement of Computing in Education.<\/p>\n<p>Glover, D and Miller, D, Averis, D and Door, V. (2005) The interactive whiteboard: a literature survey.î <em>Technology, Pedagogy and Education <\/em>(14) 2: 155-170.<\/p>\n<p>Glover, D. &amp; Miller, D. (2001) &#8220;Running with Technology: the pedagogic impact of the large-scale introduction of interactive whiteboards in one secondary school&#8221;, <em>Journal of Information Technology for Teacher Education<\/em>, 10 (3), 257-277.<\/p>\n<p>Glover, D., Miller, D. (2004) New Technologies and Educational Leadership. Missioners, Tentatives and Luddites: leadership challenges for school and classroom posed by the introduction of interactive whiteboards into schools in the United Kingdom. Department of Education, University of Keele, Staffordshire, U.K<\/p>\n<p>Glover, D., Miller, D., Averis, D. and Door, V. (2005) The interactive whiteboard: a literature survey. <em>Technology, Pedagogy and Education <\/em>(14) 2: 155-170.<\/p>\n<p>Glover, D., Miller, D. (2001) Running with technology: the pedagogic impact of the large-scale introduction of interactive whiteboards in one secondary school. Technology, Pedagogy and Education, Volume 10, Number 3, Number 3 October 2001, pp. 257-278(22)<\/p>\n<p>Goodison, T.A.M., 2002. Learning with ICT at primary level: pupils’ perceptions. Journal of Computer Assisted Learning, 18, pp. 282-295.<\/p>\n<p>Graham, K. (2003) Switching On Switched-Off children: Does the Promethean ACTIVboard promote lesson participation among switched-off children?<br \/>\n<a href=\"http:\/\/www.virtuallearning.org.uk\/2003research\/Switching_Switched_Off.doc\">http:\/\/www.virtuallearning.org.uk\/2003research\/Switching_Switched_Off.doc<\/a><\/p>\n<p>Greiffenhagen, C., 2000. From traditional blackboards to interactive whiteboards: A pilot study to inform system design. 24th Conference of the International Group for the Psychology of Mathematics Education (PME), Vol. 2. Hiroshima, Japan.<\/p>\n<p>Hall, I. Higgins, S. (2005) Primary school students&#8217; perceptions of interactive whiteboards. Journal of Computer Assisted Learning 21 (2), 102–117. Blackwell<\/p>\n<p>Harrison, C. Comber C., Fisher, T., Haw, K., Lewin, C., Lunzer, E., McFarlane, A., Mavers, D., Scrimshaw, P., Somekh, B., Watling, R. (2002) ImpaCT2: The impact of information and communication technologies on pupil learning and attainment. A report to the DfES. ICT in Schools Research and Evaluation Series No 7. Coventry: Becta<\/p>\n<p>Hayward, B., Alty C., Pearson, S and Martin, C. (2003) Young people and ICT 2002: A report to the DfES. ICT in Schools Research and Evaluation Series No12. Coventry: Becta<\/p>\n<p>Higgins, S., Clark. J., Falzon. C., Hall, I., Hardman, F., Miller, J., Moseley, D., Smith, F. and Wall, K. (2005) Embedding ICT in the Literacy and Numeracy Strategies: Final Report April 2005 Newcastle Upon Tyne: Newcastle University.<\/p>\n<p>Hooper, S and Rieber, L P (1995) Teaching with technology. In A.C. Ornstein (Ed) <em>Teaching: Theory into practice<\/em>, (pp154-170) Needham Heights, MA: Allyn and Bacon.<\/p>\n<p>Interactive Whiteboards and Learning: A Review of Classroom Case Studies and Research Literature<br \/>\n<a href=\"http:\/\/dewey.uab.es\/pmarques\/pdigital\/es\/docs\/Research%20White%20Paper.pdf\">http:\/\/dewey.uab.es\/pmarques\/pdigital\/es\/docs\/Research%20White%20Paper.pdf<\/a><\/p>\n<p>Jewitt, C (2006) Technology, literacy and learning: a multimodal approach, London: RoutledgeFalmer.<\/p>\n<p>Jewitt, C. (2002) <strong>‘<\/strong>The move from page to screen: the multimodal reshaping of school English’, Journal of Visual Communication 1(2): 171-196.<\/p>\n<p>Jones, A. (2004) <em>A Review Of The Research Literature On Barriers To The Uptake Of ICT By Teachers<\/em>. Coventry: Becta<\/p>\n<p>Kemeny, H. (2004) Review of some literature and classroom research into IWB use in primary schools. Unpublished paper produced for the IWB pedagogy and pupil performance project.<\/p>\n<p>Kennewell, S. (2001) Interactive whiteboards &#8211; Yet another solution looking for a problem. <em>Information Technology in Teacher Education<\/em>, 39.3-6. (Retrieved 11\/2004)<\/p>\n<p>Kennewell, S. (2004) Researching the influence of interactive presentation tools on teacher pedagogy. Paper presented at BERA 2004<\/p>\n<p>Kennewell, S. (2006) Reflections on the interactive whiteboard phenomenon: a synthesis of research from the UK Swansea School of Education. The Australian Association for Research in Education<\/p>\n<p>Knight, P., Pennant J. &amp; Piggott J. (2004) &#8220;What does it mean to &#8220;Use the interactive whiteboard&#8221; in the daily mathematics lesson?&#8221;, <em>MicroMath, <\/em>20(2), 14-16.<\/p>\n<p>Latham, P. (2002) Teaching and learning primary mathematics: the impact of interactive whiteboards <em>BEAM research papers <\/em><br \/>\n<a href=\"http:\/\/www.beam.co.uk\/pdfs\/RES03.pdf\">http:\/\/www.beam.co.uk\/pdfs\/RES03.pdf<\/a> North Islington Education Action Zone. (23 Sept, 2004).<\/p>\n<p>Leva, R. (2000) Linking resource allocation to learning outcomes in M. Coleman and L. Anderson (eds) <em>Managing Finance and Resources in Education<\/em>, London, Pitman.<\/p>\n<p>Levy, P. (2002) &#8220;Interactive Whiteboards in learning and teaching in two Sheffield schools: a developmental study&#8221;, Department of Information Studies, University of Sheffield, 2002.<br \/>\n<a href=\"http:\/\/dis.shef.ac.uk\/eirg\/projects\/wboards.htm\">http:\/\/dis.shef.ac.uk\/eirg\/projects\/wboards.htm<\/a><\/p>\n<p>Lowe, K. (2003) Raising achievement: The impact of Promethean ACTIVboards in underachieving boys and their learning <a href=\"http:\/\/www.virtuallearning.org.uk\/2003research\/Raising_achievement.doc\">http:\/\/www.virtuallearning.org.uk\/2003research\/Raising_achievement.doc<\/a>.<\/p>\n<p>Miller, D. (2003) Developing interactive whiteboard activity <em>MicroMath, <\/em>19, 33-5<\/p>\n<p>Miller, D. (2006) Secondary mathematics teaching and the interactive whiteboard. A revolution in the making or years of wasted opportunities. Keele University, Keele, UK<\/p>\n<p>Miller, D., Glover, D. (2004) Enhancing mathematics teaching through new technology: the use of the interactive whiteboard, Summary of a report made to the Nuffield Foundation on completion of a funded two year project (April 2002 -March 2004). Downloaded from:<br \/>\n<a href=\"http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/docs\/NuffieldReport.pdf\">http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/docs\/NuffieldReport.pdf<\/a><\/p>\n<p>Miller, D., Glover, D. (2006) Enhanced secondary mathematics teaching: gesture and the interactive whiteboard. Keele University BERA: Warwick 2006 – a report of work in progress<\/p>\n<p>Miller, D., Glover, D. (2006) Evolution for a revolution: professional development for mathematics teachers using interactive whiteboard technology. Keele University, Keele, UK<\/p>\n<p>Miller, D., Glover, D. (2006) Keele University Enhanced secondary mathematics teaching: gesture and the interactive whiteboard. BERA: Warwick 2006 – a report of work in progress<\/p>\n<p>Miller, D., Glover, D. and Averis, D. (2004a) Matching technology and pedagogy in teaching mathematics: understanding fractions using a ’virtual manipulative’ fraction wall. Paper 99 presented at BERA 2004.<br \/>\n<a href=\"http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/docs\/BERA%20Paper%20Sep%202004.pdf\">http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/docs\/BERA%20Paper%20Sep%202004.pdf<\/a><\/p>\n<p>Miller, D., Glover, D. and Averis, D. (2004b) Panacea Or Prop: the Role of the Interactive Whiteboard in Improving Teaching Effectiveness. <em>The Tenth International Congress of Mathematics Education,Copenhagen <\/em><br \/>\n<a href=\"http:\/\/www.icme-organisers.dk\/tsg15\/Glover_et_al.pdf\">http:\/\/www.icme-organisers.dk\/tsg15\/Glover_et_al.pdf<\/a><\/p>\n<p>Miller, D., Glover, D., Averis, D. (2003) Exposure – The Introduction Of Interactive Whiteboard Technology To Secondary School Mathematics Teachers In Training. Department of Education, Keele University, U.K. European Research in Mathematics Education<\/p>\n<p>Miller, D., Glover, D., Averis, D. (2003) The impact of interactive whiteboards on classroom practice: examples drawn from the teaching of mathematics in secondary schools in England. Keele University, UK<\/p>\n<p>Miller, D., Glover, D., Averis, D. (2004) A worthwhile investment? The interactive whiteboard and the teaching of mathematics. Keele University, Keele, UK<\/p>\n<p>Miller, D., Glover, D., Averis, D., Door, V. (2004) From Technology To Professional Development. How Can The Use Of An Interactive Whiteboard In Initial Teacher Education Change The Nature Of Teaching And Learning In Secondary Mathematics And Modern Languages? Keele University Downloaded from:<br \/>\n<a href=\"http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/\">http:\/\/www.keele.ac.uk\/depts\/ed\/iaw\/<\/a><\/p>\n<p>Moss, G. (2003) Analysing literacy events: mapping gendered configurations of readers, texts and contexts. In S. Goodman, T. Lillis, J. Maybin and N.Mercer (Eds) <em>Language, Literacy and Education: A reader. <\/em>London: Trentham Books. Pp123-137<\/p>\n<p>Moss, G., Jewitt, C., Levacic, R., Armstrong, V., Cardini, A. &amp; Castle, F. (2007) The Interactive Whiteboards, Pedagogy and Pupil Performance Evaluation:  An Evaluation of the Schools Whiteboard  Expansion (SWE) Project: London Challenge   Institute of Education DfES Research Report No 816<\/p>\n<p>Newman, J. (2001) <em>Modernising Governance: New Labour, Policy and Society. <\/em>London: Sage<\/p>\n<p>Noss, R and Pachler, N. (1999) The challenge of new technologies: Doing old things in a new way or doing new things? In Mortimore, P (Ed) <em>Understanding Pedagogy and its impact on learning<\/em>. London: Paul Chapman<\/p>\n<p>Ofsted, 2004. <em>ICT in schools: The impact of government initiatives five years on. <\/em>Ofsted.<\/p>\n<p>Passey, D., Rogers C., Machell, J., McHugh, G., Allaway, D. (2003) The Motivational Effect of ICT on Pupils: Emerging findings. London: DfES<\/p>\n<p>Pittard, V., Bannister, P. and Dunn, J. (2003) <em>The big pICTure: The impact of ICT on Attainment, Motivation and Learning. <\/em>DfES<\/p>\n<p>Plus-america (2001) <em>Press Room Press Releases: Revolutionary Plus® Whiteboard Integrates Computers, Internet, Written And Spoken Word Presentations Into One Real-Time Communications Tool! <\/em><br \/>\n<a href=\"http:\/\/www.plus-america.com\/infocomm01pointechpress.html\">http:\/\/www.plus-america.com\/infocomm01pointechpress.html<\/a><\/p>\n<p>Richardson, A. (2002) &#8220;Effective Questioning in Teaching Mathematics Using an Interactive Whiteboard&#8221;, <em>Micromath<\/em>, 18(2), 8-12.<\/p>\n<p>Rudd, T. (2007) Futurelab Report on Interactive Whiteboards in the Classroom. Bristol: futurelab<\/p>\n<p>Scrimshaw, P. (2004) <em>Enabling teachers to make successful use of ICT. <\/em>Coventry: Becta 78<\/p>\n<p>SMART Technologies Inc. (April 2004) Interactive Whiteboards and Learning: A Review of Classroom Case Studies and Research Literature. White Paper.<\/p>\n<p>Smart. (2004) <em>The History of SMART Technologies Inc. <\/em><a href=\"http:\/\/www.smarttech.com\/company\/aboutus\/history.asp\">http:\/\/www.smarttech.com\/company\/aboutus\/history.asp<\/a><\/p>\n<p>Smith, A. (1999) Interactive Whiteboard Evaluation,<br \/>\n<a href=\"http:\/\/www.mirandanet.org.uk\/pubs\/smartboard.htm\">http:\/\/www.mirandanet.org.uk\/pubs\/smartboard.htm<\/a><\/p>\n<p>Smith, F., Hardman, F., Higgins, S. The impact of interactive whiteboards on teacher-pupil interaction in the National Literacy and Numeracy Strategies 2006. British Educational Research Journal Volume: 32 Number: 3 pp. 437-451 ISBN\/ISSN: 0141-1926<\/p>\n<p>Smith, H (2001) Smartboard evaluation final report, Kent NgfL http:\/\/www.kented.org.uk\/ngfl\/whiteboards\/report.html<\/p>\n<p>Smith, H.J., Higgins, S., Wall, K., and Miller, J. (2005) Interactive whiteboards: boon or bandwagon? A critical review of the literature, <em>Journal of Computer Assisted Learning<\/em>, 21(2), pp.91- 101.<\/p>\n<p>Snijders, T and Bosker, R, (1999), <em>Multilevel Analysis<\/em>, Sage, London.<\/p>\n<p>Somekh, B et al (2005) Interim Report to the Department for Education and Skills. Unpublished report from the SWEEP project<\/p>\n<p>Somekh, B. &amp; Haldane, M. (2005) A typology of interactive whiteboard pedagogies. Paper presented at BERA Conference, University of Glamorgan, Wales, September 2005<\/p>\n<p>Somekh, B., Lewin, C., Mavers, D., Fisher T., Harrison, C., Haw K., Lunzer, E (2002) <em>ImpaCT2: Pupils and Teachers’ Perceptions of ICT in the Home, School and Community. A report to the DfES. <\/em>ICT in Schools Research and Evaluation Series No 11. Coventry: Becta<\/p>\n<p>Somekh, B., Pearson, M. (2006) Developing Pedagogies for E-learning Resources (PELRS) Downloaded from:<br \/>\n<a href=\"http:\/\/www.pelrs.org.uk\/\">http:\/\/www.pelrs.org.uk\/<\/a><\/p>\n<p>South Texas Community College (STCC), 2002. Student perceptions of the use and educational value of technology at the STCC Starr County Campus. Donwloaded from: <a href=\"http:\/\/tinyurl.com\/5ktf5y\">http:\/\/tinyurl.com\/5ktf5y<\/a><\/p>\n<p>Stein, G. (2005) Pedagogy, Practice &amp; ICT. Client, Canterbury Christ Church University.<\/p>\n<p>The Good Guide to Interactive Whiteboards (2004) A publication from The Review Project, University of Hull. Downloaded from:<br \/>\n<a href=\"http:\/\/www.rsc-london.ac.uk\/fileadmin\/docs\/curriculum\/staff_dev\/learning_journey\/documents\/ag_smartboards.pdf\">http:\/\/www.rsc-london.ac.uk\/fileadmin\/docs\/curriculum\/staff_dev\/learning_journey\/documents\/ag_smartboards.pdf<\/a><\/p>\n<p>Twining et al (2005) &#8220;Tablet PCs in schools: Case study report&#8221;<br \/>\n<a href=\"http:\/\/www.becta.org.uk\/corporate\/publications\/documents\/tabletpc_report.pdf\">http:\/\/www.becta.org.uk\/corporate\/publications\/documents\/tabletpc_report.pdf<\/a><\/p>\n<p>Wall, K.; Higgins, S.; Smith, H. (2005) ‘The visual helps me understand the complicated things’: pupil views of teaching and learning with interactive whiteboards. British Journal of Educational Technology, Volume 36, Number 5, September 2005, pp. 851-867(17) Blackwell Publishing<\/p>\n<p>Warren, C. (2003) &#8220;Interactive whiteboards: an Approach for an Effective methodology&#8221;, Computer and Education, 103, 11-12.<\/p>\n<p>Wood, C. (2001) &#8220;Interactive Whiteboards: A Luxury Too Far?&#8221;, Teaching ICT 1(2), 52-62.<\/p>\n<p><strong> <\/strong><strong>Visual Learning Bibliography<\/strong><\/p>\n<p><!--StartFragment--><\/p>\n<p>Bazeli, M. (1997) Visual Productions and Student Learning. In: VisionQuest: Journeys toward Visual Literacy. Selected Readings from the Annual Conference of the International Visual Literacy Association (28th, Cheyenne, Wyoming, October, 1996)<\/p>\n<p>Campbell, L.; Campbell, B.; Dickinson, D. (1999) Teaching &amp; learning through multiple intelligences, 2nd ed Boston : Allyn and Bacon<\/p>\n<p>Chiodo, J. J(1997) Improving the Cognitive Development of Students&#8217; Mental Maps of the World. Journal of Geography; v96 n3 p153 63 May Jun 1997<\/p>\n<p>Dyc, G.; Milligan, V. (2000) Native American Visual Vocabulary: Ways of Thinking and Living. In: National Association of African American Studies &amp; National Association of Hispanic and Latino Studies: 2000 Literature Monograph Series. Proceedings (National Association of Native American Studies Section) (Houston, TX, February 21 26, 2000).<\/p>\n<p>El Tigi, M. A.; and others (1997) Perception of Elementary Students of Visuals on the Web. In: VisionQuest: Journeys toward Visual Literacy. Selected Readings from the Annual Conference of the International Visual Literacy Association (28th, Cheyenne, Wyoming, October, 1996<\/p>\n<p>Get in Shape for Learning. (2000 ) Texas Child Care; v23 n4 p24 31 Spr 2000<\/p>\n<p>Gurney, P. J. (1998) On the Association between Modes of Mental Representation and Mathematics Experience in Teacher Education. McGill Journal of Education; v33 n1 p7 30 Win 1998<\/p>\n<p>Harper, R. E.; Rogers, L. E. (1999) Using Feature Films To Teach Human Development Concepts.  Journal of Humanistic Counseling, Education and Development; v38 n2 p89 97 Dec 1999 Special Issue: &#8220;The Role of the Media in Mental Health.&#8221;<\/p>\n<p>Lemire,D. (2001) An Introduction to Learning Styles for College Teachers. Journal of College Reading and Learning; v32 n1 p86 92 Fall 2001<\/p>\n<p>Leutner, D.; Plass, J. L. (1998) Measuring Learning Styles with Questionnaires versus Direct Observation of Preferential Choice Behavior in Authentic Learning Situations: The Visualizer\/Verbalizer Behavior Observation Scale (VV BOS). Computers in Human Behavior; v14 n4 p543 57 Dec 1998<\/p>\n<p>Lin, H. S et al. (1996) The Effectiveness of Teaching Science with Pictorial Analogies. Research in Science Education; v26 n4 p495 511 1996<\/p>\n<p>Luckner, J.; Bowen, S.; Carter, K. (2001) Visual Teaching Strategies for Students Who Are Deaf or Hard of Hearing. Teaching Exceptional Children; v33 n3 p38 44 Jan Feb 2001<\/p>\n<p>Mann, R. L. (2001) Eye to Eye: Connecting with Gifted Visual Spatial Learners. Gifted Child Today Magazine; v24 n4 p54 57 Fall 2001<\/p>\n<p>Pattridge, G. C. (2000) Software Updates: How Can Computer Software Address the Strengths of Visual Spatial Learners? Understanding Our Gifted; v12 n4 p27 29 Sum<\/p>\n<p>Quill, K. A. (1997) Instructional Considerations for Young Children with Autism: The Rationale for Visually Cued Instruction. Journal of Autism and Developmental Disorders; v27 n6 p697 714 Dec<\/p>\n<p>Sarasin, L. C. (1999) Learning style perspectives : impact in the classroom. Madison, WI : Atwood Pub<\/p>\n<p>Silverman, L. K. (1995) Effective Techniques for Teaching Highly Gifted Visual Spatial Learners.<\/p>\n<p>Smith, S. M.; Woody, P. C. (2000) Interactive Effect of Multimedia Instruction and Learning Styles. Teaching of Psychology; v27 n3 p220 23 Sum 2000<\/p>\n<p>Stix, A. The Need for Pictorial Journal Writing. Paper presented at the Westchester Teachers&#8217; Center Conference, &#8220;Math Enrichment for All&#8221; (Hartsdale, NY, December 14, 1996).<\/p>\n<p>Vincent, J. (2001) The Role of Visually Rich Technology in Facilitating Children&#8217;s Writing. Journal of Computer Assisted Learning; v17 n3 p242 50 Sep 2001 linguistic complexity in their writing skills.<\/p>\n<p>Whitin, P. E. (1996) Exploring Visual Response to Literature. Research in the Teaching of English; v30 n1 p114 40 Feb 1996<\/p>\n<p>Wilcox, D. J. (1996) A Visual Strategy for Teaching Written Expression: Meeting the Challenge Presented by Students of Native American Heritage. Paper presented at the Annual Conference of the Northern Rocky Mountain Education Research Association (14th, Detroit Lakes, MN, October 2 6, 1996).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Interactive Whiteboard Bibliography Armstrong, A., Barnes, S., Sutherland, R., Curran, S., Mills, S., Thompson, I. (2005) Collaborative research methodology for investigating teaching and learning: the use of interactive whiteboard technology. Educational Review, Volume 57, Issue 4 November 2005 , pages &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=299\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":17,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/299"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=299"}],"version-history":[{"count":6,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/299\/revisions"}],"predecessor-version":[{"id":591,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/299\/revisions\/591"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/17"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=299"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}