{"id":82,"date":"2009-02-23T11:21:32","date_gmt":"2009-02-23T11:21:32","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=82"},"modified":"2009-02-25T16:39:36","modified_gmt":"2009-02-25T16:39:36","slug":"neuromythologies-in-education","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=82","title":{"rendered":"Neuromythologies in education"},"content":{"rendered":"<p><strong>Neuromythologies in education<\/strong><\/p>\n<p>Geake, John (2008)<\/p>\n<p>Educational Research, 50(2): pp. 123-133<\/p>\n<p><em>Abstract<\/em><\/p>\n<p>This article is part of a Special Issue derived from the seminar series ‘Collaborative Frameworks in Neuroscience and Education’ and its associated commentary, both of which were funded by the Teaching and Learning Research Programme (TLRP).<\/p>\n<p>This paper examines the arguments underlying many popular educational programmes that claim to be &#8216;brain-based&#8217;, despite pleas from the neuroscience community that these neuromyths do not have a basis in scientific evidence about the brain. The main aim of this paper is to examine several of the most popular neuromyths in the light of the relevant neuroscientific and educational evidence. Examples of neuromyths include: 10% brain usage, left- and right-brained thinking, VAK learning styles and multiple intelligences. The main elements of the argument are as follows. We use most of our brains most of the time, not some restricted 10% brain usage. This is because our brains are densely interconnected, and we exploit this interconnectivity to enable our primitively evolved primate brains to live in our complex modern human world. Although brain imaging delineates areas of higher (and lower) activation in response to particular tasks, thinking involves coordinated interconnectivity from both sides of the brain, not separate left- and right-brained thinking. High intelligence requires higher levels of inter-hemispheric and other connected activity. The brain&#8217;s interconnectivity includes the senses, especially vision and hearing. We do not learn by one sense alone, hence VAK learning styles do not reflect how our brains actually learn, nor the individual differences we observe in classrooms. Neuroimaging studies do not support multiple intelligences; in fact, the opposite is true. Through the activity of its frontal cortices, among other areas, the human brain seems to operate with general intelligence, applied to multiple areas of endeavour. <\/p>\n<p>Studies of educational effectiveness of applying any of these ideas in the classroom have failed to find any educational benefits. The main conclusions arising from the argument are that teachers should seek independent scientific validation before adopting brain-based products in their classrooms. A more sceptical approach to educational panaceas could contribute to an enhanced professionalism of the field.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Neuromythologies in education Geake, John (2008) Educational Research, 50(2): pp. 123-133 Abstract This article is part of a Special Issue derived from the seminar series ‘Collaborative Frameworks in Neuroscience and Education’ and its associated commentary, both of which were funded &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=82\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":80,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/82"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=82"}],"version-history":[{"count":3,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/82\/revisions"}],"predecessor-version":[{"id":84,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/82\/revisions\/84"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/80"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=82"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}