{"id":204,"date":"2009-02-23T17:17:32","date_gmt":"2009-02-23T17:17:32","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=204"},"modified":"2009-03-14T15:41:35","modified_gmt":"2009-03-14T15:41:35","slug":"using-the-active-web","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=204","title":{"rendered":"Using the Active Web"},"content":{"rendered":"<div id=\"attachment_546\" style=\"width: 207px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/active-web.jpg\"><img aria-describedby=\"caption-attachment-546\" loading=\"lazy\" class=\"size-medium wp-image-546\" title=\"The Active Web\" src=\"http:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/active-web-197x300.jpg\" alt=\"This tag cloud was generated by http:\/\/www.wordle.net\" width=\"197\" height=\"300\" srcset=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/active-web-197x300.jpg 197w, https:\/\/www.mirandanet.org.uk\/vl_blog\/wp-content\/uploads\/2009\/02\/active-web.jpg 550w\" sizes=\"(max-width: 197px) 100vw, 197px\" \/><\/a><p id=\"caption-attachment-546\" class=\"wp-caption-text\">This tag cloud was generated by http:\/\/www.wordle.net<\/p><\/div>\n<p><strong>Concept and Introduction<\/strong><\/p>\n<h3>Theo Kuechel<\/h3>\n<p>I am using the term Active Web to be interchangeable with Web 2.0, also known as the Read Write web. Before the Active Web, (Web 2.0) using the Web was a one way process, you accessed and\/or downloaded information, there was no interaction with the information, or indeed other users.<\/p>\n<p>Visual information forms a very important part of the Active Web. With its brightly coloured and simple icons, drop shadows, and usually excellent use of white space Web 2.0 is a very visually welcoming place. Web 2.0 by its very nature integrates many aspects of ICT, with wider pedagogies of digital and visual literacy. The examples provided in the links in the resources and scoping section offer, many opportunities for learning and teaching.<\/p>\n<p>Web based applications and services are very powerful in gluing together knowledge and experience. The interactive nature of Web 2.0 allows visual elements including images and other visual data to be accessed manipulated and shared amongst the widespread communities of users. This offers new opportunities for practice and study. For example; many of these resources are ideally suited for both individual and collaborative study, whether accessed on individual computers, touch screens, tablet PCs or interactive whiteboards. Many are also designed to be accessible on mobile devices such as PDAs or mobile phones and even more importantly shared between devices. Data can be uploaded, downloaded and exchanged with personal web spaces and also online portfolios and VLEs and also public spaces such as websites and wikis and bogs.Because pupils and teachers have access to computers outside of formal school times, applications and work that resides on the Web, work and practice can be interconnected linked and time-shifted.<\/p>\n<p>It is probably safe to say that the great majority of common ICT tasks, processes and functions, that used to require desktop software can now be carried out using online tools. It is in this context that we should undertake this module.<\/p>\n<p><strong>Getting Started<\/strong><\/p>\n<p><strong>Why should I know this?<\/strong><\/p>\n<p>It is likely that students will be using (and expecting to use) social networking and interactive Web applications. The technologies work on many different levels. The visual nature of Web 2.0 can motivate and inspire both teachers and pupils and help personalise learning and teaching, whilst at the same time offering the opportunity to share and promote achievements.<\/p>\n<p><strong>What do I need to get started?<\/strong><\/p>\n<p>Broadband access to the Internet. One important issue to be aware of, is that some Web 2.0 services may be blocked or filtered at school, local or regional level. This may necessitate consultation and dialogue with the appropriate bodies to resolve. One of the best ways to do this is to show examples of good practice and planning. Any members feedback on this area would be extremely welcome.<\/p>\n<p><strong>How can I use it in my classroom?<\/strong><\/p>\n<p>The number of applications is growing, there is no limit on how they can be used, in fact some of the most innovative and creative uses of the technology are being developed by individuals including teachers and students. One piece of advice is; choose a broad area or application that is appropriate for the age \/ subject you are involved with and focus on that. Most of the links provided in this document could lead to transformational use of ICT for learning and teaching.<\/p>\n<p><strong>Can I get help and support?<\/strong><\/p>\n<p>Most Web 2.0 applications (by their very nature) encourage, and have user communities. They communicate through blogs, help forums and wikis,often with video examples and tutorials. Most are more than willing to share tips, ideas and resources.<\/p>\n<p><strong>How could this be used?<\/strong><\/p>\n<p>There is a clear workflow that allows stakeholders (educators, teachers, teaching assistants, pupils, technical staff, parents and school leaders) to seamlessly:<\/p>\n<p>a. Access images they can use (legally)<\/p>\n<p>b. Interpret images and visual data from both professional, amateur sources and their peers<\/p>\n<p>c. Edit images and visual data online, include to other online applications such as maps, web pages or save them to the desktop for local use. As the images and data are saved online<\/p>\n<p>d. Create images and visual data and media including diagrams, charts, maps artwork photographs, presentations<\/p>\n<p>e. Share images and visual data and media by uploading for others to access and use for learning.<\/p>\n<p><strong>Some examples<\/strong><\/p>\n<p><em>Teachers and teaching assistants can:<\/em> a) Incorporate and repurpose media assets that are licensed for educational use in their teaching b) Offer a rich and visual experience for their pupils c) develop visual materials accessible for any school or classroom d) Create online presentations or teaching materials their students e) share good practice, moderate work with peers<\/p>\n<p><em>Pupils can:<\/em> a) source images for project and course work and be able to accurately cite the sources of these images. b) use tags to categorise their work and research c) work on their projects at home and at school d) develop a media for their personal portfolio e) share their work with peers an teachers in online spaces and personal portfolios<\/p>\n<p><strong>Using the services <\/strong><\/p>\n<p>Most if not all Web 2.0 tools require you to <strong><em>register and sign up for an account<\/em><\/strong><strong> <\/strong>in order to use them. At Foundation stage and Keystages 1 &amp; 2, it is almost certain, and preferable, <strong>that (class) accounts should be set u<\/strong>p and managed by the teacher.<\/p>\n<p>In order to subscribe to a Web 2.0 service the user is usually asked to provide an email address; a <a href=\"http:\/\/mail.google.com\/\">Gmail<\/a> account can be very useful for this as will always be accessible to you, wherever you are, (providing there is an Internet connection).<\/p>\n<p><strong>Access<\/strong><\/p>\n<p>Most schools and Local Authorities and RBCs, will have filtering strategies and Acceptable Use Policies (AUP) policies which may, rightly or wrongly, block access to various sites or pages. The social networking sites and YouTube are prime examples.<\/p>\n<p>There are currently many debates taking place around these issues. At the time of writing it is difficult to locate any concrete guidance on these issues at a national level. When using and accessing online services Internet Safety <strong>must<\/strong> be an overriding concern. This applies to teachers and children equally.<\/p>\n<p><strong>Why would I use (Active) Web 2.0 tools?<\/strong><\/p>\n<p>Having read this, you may feel is it really worth the trouble? Those who do use these tools to help children learn are unanimous in saying that these tools have greatly enhanced the learning taking place. It is of course important to remember that it is always best to start small, and gradually perhaps with one <strong>easy to use and manage tool<\/strong> or toolset and build from there.<\/p>\n<p>Becta are currently <a href=\"http:\/\/news.becta.org.uk\/display.cfm?resID=31584\">scoping<\/a> and undertaking <a href=\"http:\/\/partners.becta.org.uk\/index.php?section=rh&amp;catcode=_re_mr_02&amp;rid=14543\">research<\/a> projects in this area of learning and are likley to provide further information and guidance in the near future.<\/p>\n<p><strong>Help &amp; Support<\/strong><\/p>\n<p>One of the great thing about Web 2.0 is that it allows you a<strong>ccess the expertise<\/strong> of others. Although the number of schools using these tools is currently, (at the time of writing relatively small) Those who do use these tools with children are always <strong>keen to share their experiences and showcase examples<\/strong> of children&#8217;s work. It is important to identify these pathfinders, learn from them and help distribute and promote this knowledge.<\/p>\n<p><strong>The Creative Use of Images<\/strong><\/p>\n<p>Click here:<\/p>\n<p><a href=\"http:\/\/worldecitizens.net\/moodle\/mod\/resource\/view.php?id=27\">http:\/\/worldecitizens.net\/moodle\/mod\/resource\/view.php?id=27<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Concept and Introduction Theo Kuechel I am using the term Active Web to be interchangeable with Web 2.0, also known as the Read Write web. Before the Active Web, (Web 2.0) using the Web was a one way process, you &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=204\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":164,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/204"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=204"}],"version-history":[{"count":4,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/204\/revisions"}],"predecessor-version":[{"id":463,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/204\/revisions\/463"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/164"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=204"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}