{"id":214,"date":"2009-02-23T17:42:35","date_gmt":"2009-02-23T17:42:35","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=214"},"modified":"2009-02-26T10:14:50","modified_gmt":"2009-02-26T10:14:50","slug":"the-use-of-digital-video-in-visual-learning","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=214","title":{"rendered":"The use of Digital Video in Visual Learning"},"content":{"rendered":"<h2>How the rise of digital video is transforming education<\/h2>\n<h3><span lang=\"EN-US\">By Robert L. Jacobson, Senior Editor, eSchool News<\/span><\/h3>\n<p>These are special times for visual learning. Spurred by dramatic advances in digital technology, the use of video as an instructional tool is finally coming into its own as a mainstream feature of American education.<\/p>\n<p>Today&#8217;s expanding access to top-drawer visual material has the ability to reinvigorate much of what goes on in our schools, advocates of video in the classroom say&#8211;prompting teachers to take a fresh look at what they teach, how they teach, and how their students learn.<\/p>\n<p>And as high-tech video begins to transform and enrich instruction from coast to coast, it also is opening a promising new chapter in the professional development of teachers and fostering closer working relationships between state education agencies and public television networks.<\/p>\n<p>Leaders in education and technology can barely contain their enthusiasm over such developments. The excitement reflects what Niki Davis, director of the Center for Technology in Learning &amp; Teaching at Iowa State University, calls a &#8220;new energy&#8221; in education these days, as administrators and teachers increasingly come to recognize that technological breakthroughs have made longstanding goals for visual learning much more attainable than was previously possible.<\/p>\n<p>Davis stresses that educators should look beyond the tech side of things, as fascinating as that can be, because what matters most is what they are able to do because of the technology. Down the road, she says, teachers and administrators might well look back at the current period and conclude: That was when education truly changed.<\/p>\n<p>The growing use of video in schools, along with the spread of online learning in general, is not simply prompting teachers to &#8220;pick up the technology,&#8221; Davis explains; it&#8217;s actually beginning to change how teachers teach. &#8220;Once you use technology, the pedagogy changes,&#8221; she says. &#8220;It&#8217;s saying to teachers, ‘Think about the technology and, while you&#8217;re doing that, think again about what it is you&#8217;re trying to teach&#8211;the content&#8211;and how you&#8217;re trying to teach it.'&#8221;<\/p>\n<p>Michael Simonson, a professor in instructional technology and distance education at Nova Southeastern University, agrees. The main point to remember about visual learning, Simonson maintains, is that it can affect the substance of education.<\/p>\n<p>&#8220;The curriculum is the key&#8211;not the media,&#8221; he says. &#8220;We&#8217;ve fallen into this trap of considering that the use of technology is going to be an automatic silver bullet that&#8217;s going to make kids learn more, be more motivated. But we forget that it&#8217;s not the technology, not the media. It&#8217;s the content, and it&#8217;s the way those media are used. In other words, it&#8217;s the pedagogy, it&#8217;s the message, it&#8217;s the design&#8211;it&#8217;s the approach&#8211;that is the critical element.&#8221;<\/p>\n<p>To be sure, the conventional wisdom of 10, 20, or even 50 years ago about visual learning still holds: Most of us&#8211;students included&#8211;tend to learn and remember much more effectively when we can see and hear well-crafted videos on a given topic than when we can&#8217;t.<\/p>\n<p>In a report about video&#8217;s impact on learning a few years back, the Corporation for Public Broadcasting put it this way: &#8220;Humans intuitively grasp the power of images to convey meaning. &#8230; Viewing is an active process, perhaps best thought of as an interactive experience between viewer and medium. In addition to responding to what they observe from the screen, viewers bring their own experiences and expectations to their viewing.&#8221;<\/p>\n<p>It has become increasingly difficult to view instructional video as an &#8220;isolated&#8221; medium, the report noted, &#8220;because video elements are so pervasively intertwined and interconnected with other communications media, from the latest computer technologies to print. These days, what was once a somewhat rigid, one-to-many broadcast technology has increasingly technologies to print. These days, what was once a somewhat rigid, one-to-many broadcast technology has increasingly become a flexible, user-controlled, and interactive medium. Such malleability obviously enhances video&#8217;s instructional value.&#8221;<\/p>\n<p>Recently, a national survey by Advertising.com found that watching videos over the internet was &#8220;becoming a habit at all levels.&#8221; And analysts for the media research company eMarketer have projected that by 2011, while the number of TV viewers will show a five-year gain of about 5.3 percent, the number of online video viewers will rise about 60 percent.<\/p>\n<p>In other words: Online video is fast becoming a national phenomenon, and education is a big part of that picture.<\/p>\n<p>But while many teachers have long appreciated the capacity of video to enhance learning and have tried valiantly to take advantage of it, in the past they often have been severely constrained and discouraged by technological limits.<\/p>\n<p>Filmstrips and hour-long videos in a darkened classroom might have had their place&#8211;but how many teachers had the resources or the time to find, review, select, and effectively incorporate such &#8220;teaching aids&#8221; in their lessons on a day-to-day basis? Not many.<\/p>\n<p>In the last few years, however, that has begun to change&#8211;and in ways that signal a profound new direction for teaching and learning:<\/p>\n<ul>\n<li>Huge repositories of high-quality, well-organized video material have become available for teachers to tap into quickly and smartly whenever they think their lessons will benefit from it.<\/li>\n<li>Millions of students&#8211;having been weaned on the internet, camera phones, podcasts, and the likes of YouTube—are literally primed for a video diet in the classroom. In fact, they crave it and expect it.<\/li>\n<li>High bandwidth for schools has increasingly become the norm, and super-slow downloads have thus receded as an impediment to accessing and adapting videos for instructional purposes, virtually on demand.<\/li>\n<li>Ed-tech leaders and curriculum specialists are embracing the enormous value of digital video&#8211;and its successful application&#8211;as an essential &#8220;field&#8221; to be included in teachers&#8217; pre-service education and professional development during their careers.<\/li>\n<li>Inspired by the power of video, public television networks and state departments of education have developed stronger partnerships, pooling their resources and expertise to create vast digital libraries for local school districts, and enabling teachers to access videos easily and routinely for their classrooms. (See the accompanying story, &#8220;Online media: Public television catches a wave.&#8221;)<\/li>\n<\/ul>\n<p>All that has been occurring at a time when both consumer and educational technology are evolving and improving at a breathtaking pace. Things are happening so quickly that it&#8217;s difficult even for the experts and crystal-ball gazers to know just where we&#8217;re headed. But in one sense, it almost doesn&#8217;t matter, because the technology is getting better all the time.<\/p>\n<p>Even major producers of cutting-edge technologies&#8211;for everything from high-speed internet, telephony, and television to digital cameras, recorders, and wireless devices&#8211;are being forced to go back to the drawing board and refigure their business plans, often on a continuing basis. Will your computer become your TV set? Will your TV offer the web? Will everything become wireless and fit in your pocket? Yes, yes, and yes. To a great extent, we&#8217;re already there, as &#8220;convergence&#8221; continues to be one of the most enabling realities of our digital world.<\/p>\n<p>So with all the remarkable e-stuff that&#8217;s out there now, or coming soon to a classroom near you, educators and creators of educational video have come to a new understanding about visual learning: Teachers no longer need to feel constrained by the old technological limits. Those barriers are disappearing. And now the focus can be on building better video libraries, tagging video content to make it readily searchable and &#8220;chunkable&#8221; (in brief clips, for example), linking videos to formal educational goals and standards, and helping teachers learn how best to work visual material into the curriculum.<\/p>\n<h3>Digital video options<\/h3>\n<p>A prominent leader in this realm is Discovery Education (DE), with its award-winning video-on-demand package, Discovery Education streaming. Still widely referred to by its original name, unitedstreaming, the product is said to reach more than a million users in &#8220;more than half of all U.S. schools.&#8221;<\/p>\n<p>DE, a division of Discovery Communications (the company behind The Discovery Channel, Discovery Health, The Science Channel, Animal Planet, etc.), says the package includes &#8220;4,000 full-length videos and 40,000 video clips, images, audio files, lesson plans, a quiz builder, an assignment builder, writing prompts, and online self-paced professional development.&#8221;<\/p>\n<p>For annual fees ranging from $1,495 to $2,995 per building, depending on the grade levels served, school districts can subscribe to a service that allows teachers to access and download Discovery&#8217;s streaming videos directly from the internet. An alternative product, launched this past fall, provides &#8220;plug-and-play&#8221; servers holding nearly 8,000 videos from Discovery&#8217;s collection that users can obtain locally, without having to worry about internet speed.<\/p>\n<p>DE streaming contains videos and clips in major subject areas, including science, math, social studies, and language arts. Because of an elaborate tagging system in which full-length videos have also been divided into segments on specific topics, teachers can search according to terms that correspond with their lesson plans and quickly locate short to medium-length clips, along with articles, images, guides, and related items.<\/p>\n<p>For example, searching on the phrase &#8220;global warming&#8221; brings descriptions and links for 37 full-length videos&#8211;such as an hour-long 2005 PBS program, &#8220;Global Warming: The Signs and the Science,&#8221; for high-school students, and a 15-minute 2001 film called &#8220;Weather Smart: Climate&#8221; that is aimed at grades three to five. The PBS video has been divided into 14 segments, which last for as little as two minutes, 40 seconds, and up to more than 17 minutes. The &#8220;Weather Smart&#8221; film for the younger set has a dozen segments, nearly all of which are less than two minutes long.<\/p>\n<p>&#8220;It&#8217;s terrific,&#8221; says Iowa State&#8217;s Davis about DE streaming, underscoring the ease with which teachers can find what they&#8217;re looking for. &#8220;The teacher can actually say [to students]: ‘I don&#8217;t want you to go and look at that whole video over there; I want you to look at this particular clip and think about this&#8217;&#8211;and maybe get them to make some hypotheses, and then go back and view it again. The way it&#8217;s organized is tremendous.&#8221;<\/p>\n<p>Meanwhile, teachers in search of good videos to show their students have a growing array of other resources to explore&#8211;largely through the internet, often free, and dealing with a broad range of topics in many subjects, particularly in the sciences and social studies.<\/p>\n<p>One such resource is Teachers&#8217; Domain, a &#8220;curriculum-based digital media service&#8221; offered over the web by WGBH, the Boston area&#8217;s public-broadcasting entity. Its library of videos, images, and other material can be downloaded, shared with others, and remixed without charge. In a partnership with PBS TeacherLine, WGBH also offers online professional development courses for science teachers in elementary and secondary schools.<\/p>\n<p>Broad searches of the internet also will yield many potential films, clips, animations, and images&#8211;which, with an investment of extra time and creativity, teachers might find useful, if only occasionally. A recent search on &#8220;global warming&#8221; within Google Video, for example, turned up more than 22,000 entries, many of them decidedly not for classroom use. But expanding the search term to include the word &#8220;science&#8221; reduced the number of hits to fewer than 1,200, and at least some of the entries seemed relevant.<\/p>\n<p>Performing similar searches on the web sites of news organizations or on other, specialized sites can be more fruitful. For instance, asking the New York Times&#8217;s search engine to find material on &#8220;global warming&#8221; will take you to &#8220;Times Topics: Global Warming,&#8221; and from there it&#8217;s a quick hop to an interactive graphic on &#8220;Sea Ice in Retreat&#8221; and an automated photo gallery, with audio narration, titled &#8220;Global Warming: A Legacy Issue.&#8221;<\/p>\n<p>An exploration of National Geographic&#8217;s web site, meanwhile, eventually will bring you to some fine photos and a brief video&#8211;&#8220;courtesy of NASA&#8221;&#8211;about &#8220;the rapid retreat of north polar ice and its repercussions for the planet.&#8221; Huge challenges remain.<\/p>\n<p>There&#8217;s another dimension to this story, however. For all the gains that new technology has brought to instructional video, some experts see big challenges remaining before schools can claim to be taking full advantage of the opportunities.<\/p>\n<p>The heart of their concern, which education leaders in a number of states are working hard to address, is that many classroom teachers still are not up to speed&#8211;technically, or even pedagogically&#8211;on how to make the most of resources for visual learning. Video&#8217;s extensive presence on the internet, along with many students&#8217; substantial exposure to digital media, points more than ever to the need for top-flight teacher education and &#8220;in-service training,&#8221; experts say.<\/p>\n<p>To Donna Scribner, chief learning officer for The Virtual High School, a nonprofit organization that provides online courses for credit to high school students in the United States and abroad, the issue is more educational than technological, and it confronts both teachers and school administrators.<\/p>\n<p>&#8220;We know our students are already connected to [the digital] environment,&#8221; says Scribner. &#8220;It&#8217;s the adults in the world who are not as well connected.&#8221; And how can schools make up for that? &#8220;How much time do we have?&#8221; Scribner asks.<\/p>\n<p>While there are a growing number of internet sites with good instructional media, &#8220;it takes time to search them out.&#8221;<\/p>\n<p>A related concern is that, apart from the solid content and organization that teachers are likely to find in a service such as DE streaming, no one has yet to get a handle on structuring, analyzing, and vetting all the visual materials on the as DE streaming, no one has yet to get a handle on structuring, analyzing, and vetting all the visual materials on the web that could well be used in the classroom.<\/p>\n<p>Because of such issues, Scribner notes, the importance of visual learning in teachers&#8217; professional development has come to the forefront in education circles.<\/p>\n<p>&#8220;As teachers, we used to have to get professional development in order to maintain our licenses, and it really didn&#8217;t matter at times what we got those credits in, as long as we got them and it fit our yearly plans,&#8221; Scribner says. &#8220;Now, I&#8217;m seeing more and more teachers, educators, and administrators saying, you know, this is like the ‘brave new world&#8217; for the adults, and you all need to know what your students know. You need to be part of the revolution by actually experiencing it through professional development opportunities.&#8221;<\/p>\n<p>Scribner advises school districts to facilitate professional development by &#8220;paying for the substitutes up front&#8221; and giving teachers time off from their classroom responsibilities, so they can both attend &#8220;immersion&#8221; workshops in educational technology and follow up later on.<\/p>\n<p>&#8220;And you can&#8217;t just go to a workshop,&#8221; Scribner remarks. &#8220;You&#8217;ve got to get experiences where you actually participate in [teaching with video in a school setting]. Because teachers are human, and when they come to teaching something that is unfamiliar to them, if it reaches a point of anxiety or stress, they will go back to teaching the way they were taught.&#8221;<\/p>\n<p>Bandwidth, too, can still be an issue&#8211;especially for students who use the internet at home in connection with their schoolwork, says Nova Southeastern&#8217;s Simonson. &#8220;Even today, there are many who still use dial-up to access the internet, hard as that is to believe. And many of today&#8217;s DSL connections are still not really very fast. So if we design a streaming video, for example, if it&#8217;s extremely graphical, a lot of people have a difficult time accessing that.&#8221;<\/p>\n<p>As a result, says Simonson, who is an expert in instructional systems, people may &#8220;revert to the least common denominator when it comes to the technologies that we use. We see that happening.&#8221;<\/p>\n<p>And even when schools have sufficient network capacity to download videos, they might not have &#8220;some of the basic technologies&#8221; to make proper use of them.<\/p>\n<p>In many schools that Simonson has visited, people have &#8220;pulled the speakers out of the computer labs and the classrooms&#8221; because they consider the sound to be disruptive, he says. But if speakers are removed, video streaming ends up being &#8220;no good. You can see the visuals, but you can&#8217;t hear the sound. So teachers migrate away from the use of video streaming, because they can&#8217;t hear what the narrator is saying.&#8221;<\/p>\n<p>Simonson urges schools to instill a &#8220;systematic approach&#8221; to using video technology, including both hardware and software. Having a technology plan that administrators and teachers buy into is essential, he says. And schools need a &#8220;step-by-step process by which you can incorporate visual teaching to promote visual learning.&#8221;<\/p>\n<h3>Media specialists are key<\/h3>\n<p>For school districts to capitalize fully on the promise of visual learning, many experts suggest, they also need more media specialists. At a time when rich visual media are becoming plentiful, they say, many districts lack an adequate staff of librarians and media experts to support their teachers.<\/p>\n<p>When enrolments drop and budgets get tight, media specialists often are among the first to go, Simonson observes: &#8220;A lot of folks say, ‘We don&#8217;t need a librarian.&#8217; We have an athletic director for a school of 600 kids, but we don&#8217;t have a media specialist.&#8221;<\/p>\n<p>Librarians and media specialists should take part in planning for video streaming and other digital services in the schools, says Justin Wadland, chair-elect of the American Library Association&#8217;s Video Round Table. If a school is going to host a video server, he says, &#8220;then IT people would be needed to support that.&#8221; But for teachers &#8220;who are actually going to be using it,&#8221; it&#8217;s also &#8220;important to have those librarians.&#8221;<\/p>\n<p>Wadland&#8217;s point might seem to be self-evident, but he says the reality is that librarians &#8220;sometimes get left out.&#8221; Some people mistakenly think, &#8220;Well, we&#8217;ll just make the service available, and teachers will use it,&#8221; says Wadland, who oversees video and media resources at the University of Washington&#8217;s Tacoma campus. &#8220;But the training part is just very important. It&#8217;s a lot to ask teachers to change the way they teach without giving them training in how to use the technology.&#8221;<\/p>\n<p>Wadland adds: &#8220;That&#8217;s a good role for a librarian or media specialist. I do this quite a bit in my job. I will go to a database and learn the quirks, and then I&#8217;ll share that information with my colleagues and students who ask me questions.&#8221;<\/p>\n<p>Wadland says one of his concerns about reliance on visual resources in education is that students might not always question where various material has come from. Just because they are proficient in using digital media &#8220;doesn&#8217;t necessarily mean they can think critically about the media,&#8221; he says.<\/p>\n<p>Students must learn how to assess the sources of videos, Wadland asserts, and they must ask, &#8220;What are the values that are put into this thing?&#8221;<\/p>\n<p>In Visual Literacy: Learn to See, See to Learn, a book published by the Association for Supervision and Curriculum Development, Lynell Burmark, a consultant on education video, writes: &#8220;The primary literacy of the 21st century will be visual: pictures, graphics, images of every kind &#8230; it&#8217;s no longer enough to be able to read and write. Our students must learn to process both words and pictures. They must be able to move gracefully and fluently between text and images, between literal and figurative worlds.&#8221;<\/p>\n<p>According to Niki Davis, many students&#8211;including college undergraduates, let alone K-12 students&#8211;need &#8220;a fair amount of scaffolding&#8221; beneath them when they go online. Otherwise, she says, &#8220;they can get lost on the web and treat as authentic things that are not.&#8221;<\/p>\n<p>The internet&#8217;s wide-open nature is one reason for the appeal of video collections like those distributed through Discovery Education. The company has stressed that notion in its promotional literature, saying it offers &#8220;the very best in high-quality educational programming from some of the industry&#8217;s most trusted content providers.&#8221;<\/p>\n<p>Instructional video, both proprietary and open source, will &#8220;continue to leverage innovation&#8221; in the classroom, says Robert Daino, president of WCNY, a multimedia public broadcasting group in central New York state. But he says the number of educators who currently embrace visual content over the internet is still &#8220;fairly low.&#8221;<\/p>\n<p>Even today, some teachers might not be aware of the opportunities, Daino suggests, while others might simply be reluctant to change their methods. But he argues that, in the final analysis, the resisters will have to change—because their students will demand it.<\/p>\n<p>eSchoolNews<\/p>\n<p>7920 Norfolk Ave, Suite 900, Bethesda Maryland, 20814<\/p>\n<p>Tel. (866) 394-0115, Fax. (301) 913-0119<\/p>\n<p>Web: <a href=\"http:\/\/www.eschoolnews.com\">http:\/\/www.eschoolnews.com<\/a>, Email: <a href=\"mailto:W&#101;&#98;&#65;&#100;&#109;&#105;&#110;&#64;&#101;&#115;&#x63;&#x68;&#x6f;&#x6f;&#x6c;&#x6e;&#x65;&#x77;&#x73;&#x2e;&#x63;&#x6f;&#x6d;\">WebAdmin&#64;eschoolnews&#46;com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>How the rise of digital video is transforming education By Robert L. Jacobson, Senior Editor, eSchool News These are special times for visual learning. Spurred by dramatic advances in digital technology, the use of video as an instructional tool is &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=214\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":164,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/214"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=214"}],"version-history":[{"count":4,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/214\/revisions"}],"predecessor-version":[{"id":461,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/214\/revisions\/461"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/164"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=214"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}