{"id":59,"date":"2009-02-23T10:46:13","date_gmt":"2009-02-23T10:46:13","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=59"},"modified":"2009-02-25T16:35:16","modified_gmt":"2009-02-25T16:35:16","slug":"towards-a-framework-for-visual-literacy-learning","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=59","title":{"rendered":"Towards a Framework for Visual Literacy Learning"},"content":{"rendered":"<p><strong>The Strength of Weak Ties<\/strong><\/p>\n<p>David Jakes<\/p>\n<p>Posted by: DSJ in Mixed Media Visual Literacy<\/p>\n<p>I originally published this January 24, 2007. I’ve updated it considerably…<\/p>\n<p><strong> There is a biological basis for visual communication.<\/strong><\/p>\n<p>The auditory nerve transmits sound to the brain and is composed of about 30,000 fibers. Contrast that with the optic nerve which sends visual signals to the brain through 1 million fibers (Burmark 2002). Basically, you’ve got a dial-up connection from the ear to the brain and broadband from the eye to the brain. Teach kids to take advantage of the connectivity, and the raw capacity of the brain to process visually, <em>and then teach them that…<\/em><\/p>\n<p><em><strong>Emotion, depicted through visual means, sells the message.<\/strong><\/em><\/p>\n<p>Students must learn how to convey meaning emotionally. That’s why digital storytelling, when done right, can be such a powerful learning experience. Anyone that has seen 4 Generations: The Water Buffalo Movie can attest to that. View that movie…how many of you would pony up $250 after viewing that? And take the video obituary (called the Final Word) of Art Buchwald at the New York Times where he says “Hi, I’m Art Buchwald and I just died” and they go on to tell his life story. Bizarre, yet powerful because of the intersection of emotion and medium. <em>And then teach them that…<\/em><\/p>\n<p><em><strong>The most powerful producer of visual imagery is the individual, it’s you.<\/strong><\/em><\/p>\n<p>Digital cameras, cell phone cameras, 100 dollar Flip Video cameras, citizen journalism, photos of the London subway bombings, of Saddam Hussein’s execution, and 2,474,956,178 billion photos at Flickr attest to the capability and absolute unmitigated power of the individual to produce visual material and bring the world home. <em>But simply producing this is not enough, because…’<\/em><\/p>\n<p><em><strong>You have to share it. <\/strong>Understand Creative Commons. Post content online that others can use, that enable you to connect to other users, collaborate with others, create with others and <strong><em>contribute to everyone<\/em><\/strong>. So, teach kids to be able to do that, <em>and in the process emphasize that…<\/em><\/em><\/p>\n<p><em><strong>Individuals must be capable of working in multiple mediums to create visual messages, in accordance with the principals of visual literacy.<\/strong><\/em><\/p>\n<p>They have to do something with that visual imagery and it has to be done the right way. <em>Create. Remix. Mashup. <\/em>Post to YouTube, TeacherTube, SchoolTube, DNATube or create your own “Tube” with StartYourTube.com . Use Google Earth to combine imagery with place. Use the content of Google Streetview in a Web page or wiki; blend this with other media and primary source content to create a mixed-media platform of resources that can be the raw material of learning.<\/p>\n<p>Additionally, use online content creation systems like JumpCut and MogoPop to create messages for the distribution of content on the networks of the Web, and to make content <strong><em>transportable<\/em><\/strong>. <em>Why is this necessary? Because…<\/em><\/p>\n<p><em><strong>Visuals, when combined with other multimedia, provide individuals with a competitive voice. <\/strong>One that can be heard. One that can be measured. One that says “here I am, and here’s what I think, here is what I have to contribute. Now what do you think?” Kids have meaningful things to say, so challenge them to produce visual content with purpose and with pride. Help kids understand that the world is more connected then ever, and that producing visual content like this becomes <em>even more powerful in 2008 because…<\/em><\/em><\/p>\n<p><em><strong>Networks for sharing and collaboration extend that voice; that voice can contribute to a conversation as a contributing member of a community. <\/strong>150,000 videos are uploaded to YouTube per day (Wesch 2008)<strong>. <\/strong>Between 1 and 2 million photos are uploaded to Flickr each day (Flickr main page). Both platforms enable commenting, and YouTube encourages videos to be produced in response to others. Complete conversations around a single photograph occur in Flickr, an idea that is explored by Clay Shirkey in <em>Here Comes Everybody: The Power of Organizing With Organizations<\/em>.<\/em><\/p>\n<p>The potential for rich dialog can occur (as well as hateful dialog), so kids need to learn how to be a part of that, and in a positive way…<\/p>\n<p><em>And then emphasize that in 2008<\/em>:<\/p>\n<p><strong>Everyone can learn from each other, independent of time, space and place. <\/strong>(Ryan Bretag).<\/p>\n<p><strong>Citations:<\/strong><\/p>\n<p>Burmark, Lynell. Visual Literacy: Learn to See. See to Learn. Alexandria, VA: Association for Supervision and Curriculum Development, 2002.<\/p>\n<p>Bretag, Ryan. Personal Communication. 2008.<\/p>\n<p>Shirkey, Clay. Here Comes Everybody: The Power of Organizing Without Organizations. New York, New York. The Penguin Group,<\/p>\n<p>Wesch, Michael. “YouTube Statistics.” Digital Ethonography. 18 May 2008. Kansas State University. 7 May 2008 <a href=\"http:\/\/mediatedcultures.net\/ksudigg\/?p=163\">http:\/\/mediatedcultures.net\/ksudigg\/?p=163<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Strength of Weak Ties David Jakes Posted by: DSJ in Mixed Media Visual Literacy I originally published this January 24, 2007. I’ve updated it considerably… There is a biological basis for visual communication. The auditory nerve transmits sound to &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=59\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":73,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/59"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=59"}],"version-history":[{"count":7,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/59\/revisions"}],"predecessor-version":[{"id":376,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/59\/revisions\/376"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/73"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=59"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}