{"id":111,"date":"2009-02-23T12:01:36","date_gmt":"2009-02-23T12:01:36","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=111"},"modified":"2009-02-23T12:01:36","modified_gmt":"2009-02-23T12:01:36","slug":"techniques-for-visual-communication","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=111","title":{"rendered":"Techniques for Visual Communication"},"content":{"rendered":"<p><!--StartFragment--><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\"><strong>See What I Mean: The Power of Visual Learning<\/strong><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Marcia Conner<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">If you remember the Magic Eye fad then you probably recall the rush you felt when a 3D picture first popped into view. When you saw the image with your own eyes, suddenly you overcame any disbelief you’d held up until then. Learning can be like that, too. Visuals improve the learning process and quicken your ability to make connections. As Yogi Berra once said, “You can observe a lot by just watching.??<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Likewise, you have the opportunity to be a better educator and more refined communicator when you use the strength of graphics. We each possess separate cognitive systems for processing visual and verbal material. Our capacity for meaningful learning increases when we tap into the power of both.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Even if you have no artistic flair, you can use sketches, illustrations, photographs, symbols, graphs, and diagrams. Good images don’t just decorate; they add meaning to your message. They can make a point, connect the dots, and help people learn. And when you convey your meaning quickly, you win.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">There are several approaches I use with clients that improve their time to meaning and their strength to inform.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\"><strong>Informal Conversations<\/strong><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">You’ve probably chatted over lunch with a colleague when one of you pulls out a pen and begins drawing on a napkin. Then the other person says, “Yes, that’s it, and if we add…?? Together you begin conversing around the sketch, modifying as you talk. The shared visual fundamentally transforms the interaction as well as your exchange.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Whenever you want to turn an informal conversation into an ad hoc learning collaboration, seek out a napkin or pad of paper and start drawing. Create a simple diagram to represent what you want to convey. Then hand the pen over and ask your colleagues to draw all over your draft. Collectively capture what’s on your mind.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Can’t even draw a rubber band? One of our associates keeps a folder in his desk filled with cutout symbols and illustrations that help him more clearly envision an idea. During casual meetings in his office he pulls out the folder and tapes the imagery onto his whiteboard, adding arrows and labels, additional pictures and charts. By collecting and using good examples of maps, diagrams, and icons, you can streamline your conversations and also find inspiration for other graphics to include in future projects. You may also want to consider buying a book on visual language or easy-to-draw pictograms and ideograms. My favorites come from David Sibbet at The Grove [1], Robert (Bob) Horn, and Milly Sonneman.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\"><strong>Public Materials<\/strong><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">With so much information competing for your time and attention, everything that comes across your desk or monitor first needs to pass an unsaid barrier: “Am I going to read this? Am I going to learn anything useful? Is it going to be more valuable than the other umpteen ways I could spend my time??<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">?<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Think about your own documents, Websites, blogs, whatever. Ask yourself if they easily convey your intended meaning and if an image might help express your message quicker. If you work for a company with a professional graphics department, seek their help. Sometimes corporate designers long for opportunities to tell a rich story with an illustration. If the field of infographics is new to them, suggest they check out the work of Xplane [2], Idiagram [3], or Clement Mok [4]. If you can’t find graphics help, consider investing in a good iconographics package such Task Force Image Gallery or those produced by Ultimate Symbols.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">An alternative approach is to follow in the path of “The Big Picture,?? a little piece of software that appears beside many CNET News.com articles. It graphically shows how the story you’re reading relates to other tidbits in the news and which of those reports are huge news or mere hot flashes.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Through a series of bubbles, each representing a related article, topic or company, your mind’s eye makes important connections.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">You can create your own visual representation of how your information relates to other information on your site with mind mapping software like TheBrain [5] or FreeMind [6].<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\"><strong>Formal Workshops<\/strong><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">For more learner-friendly presentations, consider dropping 90% of the written words from your overheads. To borrow a line from Seth Godin, “Why would you use words on the screen when they do just fine in your mouth??? This isn’t a cheep gimmick or a way around figuring out what you’ll say.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">You can narrate a picture slide with a title or no text at all. If there are statistics and details you need to deliver, create a handout.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Think of everything you display on the screen as a roadside billboard, a message that must transfer instantly at 65 miles per hour. Engaging photographs can connect emotionally with your audience and convey your meaning through metaphors (picture this: “Building a career is like building a house.??)<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">Cognitive research shows that people learn twice as well when words are narrated rather than when extraneous words are presented onscreen.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">High-quality pictures are now easily available online through stock houses and free services like Stock.xchng and MorgueFile.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">I worked at Microsoft when PowerPoint became the “it?? application with the consulting set because it could convey complex ideas on easy-to-understand screens. I’ve seen thousands of presentations and the only ones I remember, let alone learned from, used visual metaphors instead of words.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\"><strong>Mixed Messages<\/strong><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">I also have a confession: I came late to the visual-learning party because I sometimes find pictures more attention-getting than meaningful, providing unnecessary visual noise and distracting me from what I try to read. Think of Websites with flashing banners, presentations with wild swooping fly-ins, or images with so many labels they take a week to digest. I encourage you to avoid all of those, instead using graphics to direct attention and guide people through what might seem overly complex if explained in text.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">And one more caution: Diagrams that oversimplify a process can be just as harmful to the learning process as going without. Like optical illusions, images can play on expectations, and trick people into believing they completely understand nuance and implications because they grasp the nut in view.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">While we all will benefit from seeing with our brains, let’s use that gray matter for good.<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\"><strong>Links:<\/strong><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">[1] <a href=\"http:\/\/www.grove.com\/\">http:\/\/www.grove.com<\/a> <\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">[2] <a href=\"http:\/\/www.xplane.com\/\">http:\/\/www.xplane.com<\/a> <\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">[3] <a href=\"http:\/\/www.idiagram.com\/\">http:\/\/www.idiagram.com\/<\/a> <\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">[4] <a href=\"http:\/\/www.clementmok.com\/\">http:\/\/www.clementmok.com<\/a> <\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">[5] <a href=\"http:\/\/www.thebrain.com\/\">http:\/\/www.thebrain.com<\/a> <\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">[6] <a href=\"http:\/\/freemind.sourceforge.net\/\">http:\/\/freemind.sourceforge.net<\/a><\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">location:<\/span><span lang=\"EN-US\">http:\/\/www.fastcompany.com\/resources\/learning\/conner\/013006.html<\/span><\/p>\n<p class=\"MsoNormal\"><span lang=\"EN-US\">July 8, 2008<\/span><\/p>\n<p><!--EndFragment--><\/p>\n","protected":false},"excerpt":{"rendered":"<p>See What I Mean: The Power of Visual Learning Marcia Conner If you remember the Magic Eye fad then you probably recall the rush you felt when a 3D picture first popped into view. When you saw the image with &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=111\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":109,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/111"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=111"}],"version-history":[{"count":1,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/111\/revisions"}],"predecessor-version":[{"id":112,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/111\/revisions\/112"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/109"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=111"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}