{"id":54,"date":"2009-02-23T10:39:15","date_gmt":"2009-02-23T10:39:15","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=54"},"modified":"2009-02-24T08:29:33","modified_gmt":"2009-02-24T08:29:33","slug":"how-multimedia-can-improve-learning","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=54","title":{"rendered":"How multimedia can improve learning"},"content":{"rendered":"<h2>Analysis: How multimedia can improve learning<\/h2>\n<p>New research sheds light on students&#8217; ability to process multiple modes of learning<\/p>\n<p>By Meris Stansbury, Assistant Editor, eSchool News<\/p>\n<p>An analysis of existing research supports a notion that already has begun to transform instruction in schools from coast to coast: that multimodal learning&#8211;using many modes and strategies that cater to individual learners&#8217; needs and capacities&#8211;is more effective than traditional, unimodal learning, which uses a single mode or strategy.<\/p>\n<p>According to a new report commissioned by Cisco Systems, adding visuals to verbal (textual and\/or auditory) instruction can result in significant gains in basic or higher-order learning, if applied appropriately. Students using a well-designed combination of visuals and text learn more than students who use only text, the report says.<\/p>\n<p>It also provides insights into when interactivity strengthens the multimodal learning of moderate to complex topics, and when it&#8217;s advantageous for students to work individually when learning.<\/p>\n<p>&#8220;There is a lot of misinformation circulating about the effectiveness of multimodal learning,&#8221; said Charles Fadel, Cisco&#8217;s global education leader. &#8220;As curriculum designers embrace multimedia and technology wholeheartedly, we considered it important to set the record straight, in the interest of the most effective teaching and learning.&#8221;<\/p>\n<p>The report, titled <strong><em>Multimodal Learning through Media: What the Research Says<\/em><\/strong>, was conducted by the Metiri Group, which serves the education community through a broad range of consulting services. It is the third in a series of metastudies that address &#8220;what the research says&#8221; about various topics in education; prior reports tackled <span>technology in schools and education and economic growth.<\/span><\/p>\n<p>Information was gathered for the report using meta-analysis, or combining the results of several studies that address a set of related research hypotheses. Only studies published after 1997 and addressing the use of multimedia in education were considered.<\/p>\n<p>&#8220;The real challenge before educators today is to establish learning environments, teaching practices, curricula, and resources that leverage what we know about the limitations of human physiology and the capacity explained by the cognitive sciences to augment deep learning in students,&#8221; says the study.<\/p>\n<h3>How students learn<\/h3>\n<p>New information about how we acquire knowledge is now available through functional magnetic resonance imaging (fMRI) of the human brain at work and rapid sampling techniques that reveal the pattern of brain activity over time as people read, listen, talk, observe, think, multitask, and perform other mental tasks.<\/p>\n<p>In its introduction, the Metiri Group report indicates that the brain has three types of memory: sensory memory, working memory, and long-term memory.<\/p>\n<p>Working memory is where thinking gets done and is dual-coded with a buffer for storage of verbal or text elements, and a second buffer for visual or spatial elements. Short-term memory is thought to be limited to approximately four objects that can be simultaneously stored in visual or spatial memory and about seven objects that can be simultaneously stored in verbal memory.<\/p>\n<p>Within working memory, verbal\/text memory and visual\/spatial memory work together, without interference, to strengthen understanding. However, overfilling either buffer can result in cognitive overload and weaken learning.<\/p>\n<p>Recent studies also suggest that convergence, or sensory input combined with new information at the same time, has positive effects on memory retrieval. It creates linked memories, so that the triggering of any aspect of the experience positive effects on memory retrieval. It creates linked memories, so that the triggering of any aspect of the experience will bring to consciousness the entire memory.<\/p>\n<p>Sensory memory is caused by experiencing anything through the five senses (sight, sound, taste, smell, and touch) and is involuntarily stored in long-term memory as episodic knowledge. However, these sensory memories degrade very quickly, and it&#8217;s only when the person pays attention to elements of sensory memory that these experiences get introduced into working memory. Once an experience is in a student&#8217;s working memory, the learner then can consciously hold that experience in his or her memory and can think about it in context.<\/p>\n<p>Long-term memory is nearly unlimited, and it&#8217;s estimated that a person can store up to 10 to the 20th power bits of information over a lifetime&#8211;equivalent to 50,000 times the text in the U.S. Library of Congress (30 million cataloged books; 58 million manuscripts).<\/p>\n<p>The brain has two types of long-term memory: episodic and semantic. Episodic comes from sensory input and is involuntary. Semantic memory stores memory traces from working memory, including ideas, thoughts, schema (chunks of multiple individual units of memory that are linked into a system of understanding), and processes that result from the thinking accomplished in working memory.<\/p>\n<p>To show how a student might use all types of memory when learning, the report cites a female student in a science lab, working as part of a team on the development of an architectural design. All sensory activity is involuntarily encoded in her memory through dual sensory channels: The student&#8217;s verbal\/text memory might include side conversations, noise from other teams, and so on, while the visual\/spatial memory might include the current architectural drawings on the screen or paper, facial expressions, and physical movements by others.<\/p>\n<p>Only if she consciously considers each sensory input, or contemplates further about a particular side conversation (such as about the traffic patterns associated with various building designs), will the memory move from short to long term. As the student considers this side conversation about traffic patterns, she will be able to cue up memories from her personal experiences stored in long-term memory that have enriched her thinking. It&#8217;s important to understand that while this learning is occurring, the student could become distracted by something (such as an office announcement) and might experience &#8220;attention blink,&#8221; thereby losing sight of everything else around her owing to cognitive overload.<\/p>\n<p>This cognitive overload won&#8217;t prevent the student from continuing to register input involuntarily, but these experiences will be stored only in short-term memory and so won&#8217;t last long. Furthermore, as the student consciously considers each sensory input, her cognitive control function limits attention to serial consideration of ideas and concepts&#8211;meaning that her cognitive ability is slowed down and multitasking isinefficient. Thinking, decision-making, and cueing of long-term memories require the central cognitive processor, which only works serially. Therefore, the more sensory input there is, the greater the risk of overload&#8211;and the greater the risk of leaving information out of long-term memory.<\/p>\n<p>The report concludes its overview of cognitive science by citing the principles listed by the National Academy of Sciences from its 2001 publication, <em>How People Learn<\/em>: * Student preconceptions of curriculum must be engaged in the learning process. Only when the student has the opportunity to correct misconceptions, build on prior knowledge, and create schemas of understanding a topic will learning be optimized.<\/p>\n<ul>\n<li>Expertise is developed through deep understanding. Students learn more when the concepts are personally meaningful to them. This translates into a need for authentic learning in classrooms&#8211;deep learning, relevant to those outside the classroom, and involving students&#8217; use of the key ideas in a production.<\/li>\n<li>Learning is optimized when students develop &#8220;metacognitive&#8221; strategies. To be metacognitive is to be constantly &#8220;thinking about one&#8217;s own thinking.&#8221; Students who are metacognitive are students who approach problems by automatically trying to predict outcomes, explaining ideas to themselves, noting and learning from failures, and activating prior knowledge.<\/li>\n<\/ul>\n<h3>Multimedia and learning<\/h3>\n<p>So, what does the science of learning tell us about the use of multimedia during instruction? As the report suggests, multimedia is one modality of learning that can help students learn more efficiently when applied properly, because convergence&#8211;or sensory input simultaneously combined with new information&#8211;has positive effects on memory retrieval.<\/p>\n<p>But too much sensory input can lead to cognitive overload, the report cautions, so educators must be careful to use multimedia appropriately.<\/p>\n<p>Based on the work of Richard Mayer, Roxanne Moreno, and other researchers, the Metiri Group report synthesized a list of learning principles for multimedia:<\/p>\n<ul>\n<li>Multimedia Principle: Retention is improved through words and pictures rather than through words alone.<\/li>\n<li>Spatial Contiguity Principle: Students learn better when corresponding words and pictures are presented near each other, rather than far from each other on the page or screen.<\/li>\n<li>Temporal Contiguity Principle: Students learn better when corresponding words and pictures are presented simultaneously rather than successively.<\/li>\n<li>Coherence Principle: Students learn better when extraneous words, pictures, and sounds are excluded rather than included.<\/li>\n<li>Modality Principle: Students learn better from animation and narration than from animation and on-screen text.<\/li>\n<li>Individual Differences Principle: Design effects are higher for low-knowledge learners than for high-knowledge learners. Also, design effects are higher for high-spatial learners than for low-spatial learners.<\/li>\n<li>Direct Manipulation Principle: As the complexity of the materials increases, the impact of direct manipulation (animation, pacing) of the learning materials on the transfer of knowledge also increases.<\/li>\n<\/ul>\n<p>Therefore, students engaged in learning that incorporates multimodal designs, on average, outperform students who learn using traditional approaches with single modes, the report says.<\/p>\n<p>For example, based on meta-analysis, the average student&#8217;s scores on basic skills assessments increase by 21 percentiles when engaged in non-interactive, multimodal learning (which includes using text with visual input, text with audio input, and watching and listening to animations or lectures that effectively use visuals) in comparison with traditional, single-mode learning.<\/p>\n<p>When students shift from non-interactive multimodal to interactive multimodal learning (such as engagement in simulations, modeling, and real-world experiences&#8211;most often in collaborative teams or groups), results are not quite as high, with average gains at 9 percentiles.<\/p>\n<p>However, when the average student is engaged in higher-order thinking using multimedia in interactive situations, on average, that student&#8217;s percentage ranking on higher-order or transfer skills increases by 32 percentile points over what the student would have accomplished with traditional learning.<\/p>\n<p>When the context shifts from interactive to non-interactive multimodal learning, the result is 20 percentile points over traditional means.<\/p>\n<p>Based on these principles and statistics, the report lists a few tips for educators on how to teach students using multimedia:<\/p>\n<ol>\n<li>Know the importance of the attention and motivation of the learner. The &#8220;scaffolding&#8221; of learning&#8211;the act of providing learners with assistance or support to perform a task beyond their own reach&#8211;by reducing extraneous diversions and focusing the learner&#8217;s attention on appropriate elements aligned to the topic has proven effective.<\/li>\n<li>Know the importance of separating the media from the instructional approach. A recent meta-analysis in which more than 650 empirical studies compared media-enabled distance learning to conventional learning found pedagogy to be more strongly correlated to achievement than media. The media and pedagogy must be defined separately.<\/li>\n<\/ol>\n<h3>Where to go from here<\/h3>\n<p>While the report&#8217;s analysis provides a clear rationale for using multimedia in learning, the research in this field is evolving, its authors say. Recent articles suggest that efficacy, motivation, and volition of learners, as well as the type of learning task and the level of instructional scaffolding, can weigh heavily on learning outcomes from the use of multimedia.<\/p>\n<p>Future research will focus on the social affordances that multimedia representations provide, the scaffolding required to prepare students to effectively use multimedia representations, and the learning designs necessary to minimize cognitive overload, the report suggests.<\/p>\n<p>The report concludes by noting: &#8220;The convergence of the cognitive sciences and neurosciences provides insights into the field of multimodal learning through Web 2.0 tools. The combination will yield important guideposts in the research and development of eLearning using emergent, high-tech environments.&#8221;<\/p>\n<h3>Links:<\/h3>\n<p><em>Multimodal Learning through Media: What the Research Says<\/em><\/p>\n<p>Cisco Systems<\/p>\n<p>The Metiri Group<\/p>\n<p><strong>eSchoolNews<\/strong><\/p>\n<p>7920 Norfolk Ave, Suite 900, Bethesda Maryland, 20814<\/p>\n<p>Tel. (866) 394-0115, Fax. (301) 913-0119<\/p>\n<p>Web: <a href=\"http:\/\/www.eschoolnews.com\">http:\/\/www.eschoolnews.com<\/a>, Email: <a href=\"&#109;&#x61;&#x69;l&#116;&#x6f;:&#87;&#x65;&#x62;&#65;&#x64;&#x6d;i&#110;&#x40;e&#115;&#x63;&#x68;&#111;&#x6f;&#x6c;n&#101;&#x77;s&#46;&#x63;&#x6f;&#109;\">WebAdmin&#64;eschoolnews&#46;com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Analysis: How multimedia can improve learning New research sheds light on students&#8217; ability to process multiple modes of learning By Meris Stansbury, Assistant Editor, eSchool News An analysis of existing research supports a notion that already has begun to transform &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=54\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":73,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/54"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=54"}],"version-history":[{"count":9,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/54\/revisions"}],"predecessor-version":[{"id":58,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/54\/revisions\/58"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/73"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=54"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}