{"id":257,"date":"2009-02-24T10:10:42","date_gmt":"2009-02-24T10:10:42","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=257"},"modified":"2015-02-03T12:31:22","modified_gmt":"2015-02-03T12:31:22","slug":"implementing-the-hardware-in-the-classroom","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=257","title":{"rendered":"Implementing the Hardware in the Classroom"},"content":{"rendered":"<p><strong>The impact of formal and informal professional development opportunities on primary teachers’ adoption of interactive whiteboards<\/strong><\/p>\n<p><strong>Abstract<\/strong><\/p>\n<p>This paper reports on the approaches undertaken to support the development of teachers’ uses of interactive whiteboards in the Primary Schools Whiteboard Expansion project. Mixed methods were used to identify practices and staff perceptions about the extent and impact of professional development through surveys (initially from 528 schools), together with 10 case studies to provide in-depth insights and observational data. The training events offered to the 21 participating Local Authorities (LAs) were also observed. Data were analysed through a socio-cultural framework. The findings are presented at three levels: national (the central team driving the project), regional (the LAs), and local (the schools). The paper concludes that whilst LA support varied and the central team was not well-prepared for the unprecedented level of uptake, the formal training offered through a cascade model was effective. Furthermore, the pool of expertise shifted from the LAs to the schools, as teachers’ urgent need to acquire skills to use the IWB on a daily basis led to the development of informal learning communities in the schools.<\/p>\n<h2>Introduction<\/h2>\n<p>This article draws on research carried out as part of the UK Government sponsored evaluation of the Primary Schools Whiteboard Expansion (PSWE) project. This initiative was of particular interest because the installation of IWBs in classrooms was accompanied by an extensive centrally-led training programme for Local Authority (LA) consultants who were tasked with ‘cascading’ the training to teachers in schools. The emphasis of the training was on ways teachers could use the IWB to change their pedagogical practices in addition to acquiring skills in use of the board. The evaluation took place in 2004-2006 and involved 21 Local Authorities (LAs) that received funding to install interactive whiteboards (IWBs) in primary schools in 2003\/04. In its final report (Authors et al, 2007) the evaluation identified (from multi-level modelling data) statistically significant gains in children’s attainment in national test scores at age 11 when they had been taught with an IWB for more than two years. The key factor was the length of time children had been taught with an IWB, and by implication the length of time their teacher had been using one in her teaching. This finding differed markedly from the findings of a previous study that showed that initial gains in children’s attainment were not maintained beyond the first year (Higgins et al, 2005). It is possible that these positive gains were partly the result of effective teacher professional development, a finding that would be of considerable importance given the generally disappointing outcomes of other professional development initiatives for ICT (Cox and Rhodes, in press). This article sets out to explore the evaluation data from teacher questionnaires and interviews to see if there is evidence to support this.<\/p>\n<p>The uptake of interactive whiteboards (IWBs) in primary schools at this time was rapid and widespread, underpinned by substantial Government funding and policy directives. Whilst much has been written about the potential of IWB technologies there is little empirical evidence to date suggesting pedagogical change (e.g. Smith et al, 2006) although it is recognised that teachers are using such tools effectively to support existing practices (Gillen et al, 2007; Hennessy et al, 2007). Similarly, in the PSW<span class=\"ParaChar\"><span lang=\"EN-US\">E programme, the evaluation found that initially teachers used IWBs largely to reproduce existing practices rather than to develop a wider range of pedagogical strategies. However, case studies carried out in PSWE schools after two years, in the second phase of the evaluation, found evidence of changes in pedagogic practice. This article also sets out to explore the extent to which these changes may have resulted from the formal and informal professional development opportunities provided by PSWE.<\/span><\/span><\/p>\n<h2>Background<\/h2>\n<p>An interactive whiteboard (IWB) is a “large, touch sensitive board which is connected to a digital projector and a computer” (Becta, 2002, p. 1). It acts as an additional input and output device, the advantages being that everything is displayed on a large screen which is visible to a whole class and that all activities can be controlled through the board rather than using a mouse and\/or keyboard, although these devices can still be used as required. Thus it is suggested that the IWB readily supports whole class <span class=\"MsoPageNumber\">interactive teaching, a pedagogical strategy embedded in the Primary Strategy for <span class=\"MsoPageNumber\">numeracy and literacy (Becta, 2004). Initially, although teachers were often enthusiastic IWBs were little used for a variety of reasons (Kennewell &amp; Morgan, 2003). By 2004 the UK Government had begun to promote this form of technology, with the former Secretary of State for Education &amp; Skills, Charles Clarke, stating “every school of the future will have an interactive whiteboard in every classroom, technology has already revolutionised learning” (Arnott, 2004). The government invested £50 million in school whiteboards between 2003 and 2005. whilst the ICT in schools survey of that year, conducted in the spring of 2004, suggested that 63% of primary schools already had at least one IWB (Prior &amp; Hall, 2004). More recent surveys show this trend continuing. By 2006 94% of primary schools had purchased at least one IWB (Becta, 2006) and there were an average of six per school by June 2006 (BESA, 2006). By 2007, 100% of primary schools had at least one IWB (Kitchen, Finch &amp; Sinclair, 2007).<\/span><\/span><\/p>\n<p>The challenge of providing professional development in the use of IWBs to such a large number of teachers in such a short period of time was considerable. The need was actually much greater than at first appears, because a large number of LAs and headteachers found additional funding to install IWBs in all classrooms, rather than only those funded by PSWE. Additionally, the national training programme for LA consultants was offered to all LAs rather than just the twenty-one PSWE LAs, and many of these non-PSWE LAs also invested heavily in IWBs. Mumtaz (2000) in a research review provides evidence of the problematic nature of teachers’ professional development in the use of ICT; and Preston (2004) shows that a previous ambitious programme of ICT training for teaches was far from successful. It is known that pedagogical practices with technology can vary from ‘small enhancements of practices using what are essentially traditional methods, to more fundamental changes in their approach to teaching’ (Cox et al, 2004, p. 3). This had been found to be the case in relation to IWBs, prior to the PSWE initiative, with a greater emphasis on small enhancements rather than fundamental change. However, elsewhere one of the authors of this article (Author, 2008, in press) suggests that cultural and contextual factors, including policy priorities, are crucially important in teachers’ successful professional development with ICT. In this article we consider whether such factors played a role in improving the effectiveness of the PSWE professional development programme.<\/p>\n<h2>Method<\/h2>\n<p>The evaluation employed mixed methods providing contrasting and complementary data. The evaluators carried out initial visits to each of the twenty-one LAs involved in PSWE and followed these up with telephone interviews at six-monthly intervals. Each of the 21 PSWE LAs adopted different strategies for distributing the funding according to local needs. For example, some provided funding to equip all classrooms in a designated year group whilst others requested that schools bid for funds. The evaluators undertook two surveys. The first, of Headteachers and\/or ICT\/IWB coordinators, was conducted in October 2004 with 528 responses from 1000 randomly selected schools. This was repeated in June 2005 when 293 of the 528 Headteachers responded. The second, of two teachers with IWBs installed in their classrooms in each of the 528 schools that responded to the first survey, was carried out in November 2004 (550 responses) and repeated in June 2005 (403 responses).<\/p>\n<p><strong> <span style=\"font-weight: normal;\">The surveys were used to identify:<\/span><\/strong><\/p>\n<ul type=\"disc\">\n<li>what mechanisms were in place to share good practice and foster professional communities,<\/li>\n<li>staff perceptions of the value of electronic resources,<\/li>\n<li>staff perceptions of the extent and effectiveness of training provision.<\/li>\n<\/ul>\n<p>Qualitative data included case studies of 10 schools, observations of national training events and, interviews with participating LA consultants and trainers from the national primary strategy staff involved in delivering the training. A stratified sample of ten schools was selected as case studies. (representing a mix of ethnic and socio-economic groupings; and including all nursery, infant and junior phases). Data were collected during the period February 2005 to March 2006 in 23 two-day visits. Eight schools were visited twice and four received extra visits midway through the year to track changes over time more closely. During each visit observations, supported by digital video-recording, were carried out in four classrooms, with follow-up interviews with the teachers and groups of six children. Researchers interviewed the headteacher and teachers with responsibility for coordinating the use of the IWBs and the teaching of numeracy and literacy. Triangulation of data enabled the perceptions of teachers and students to be cross-checked with the video-recordings. A socio-cultural framework was adopted to analyse these data, drawing on a post-Vygotskian analysis of human activity mediated by tools (Wertsch, 1998). By viewing and re-viewing selected five-minute episodes from the video-recordings, the researchers were able to observe and analyse the minutiae of children’s behaviours. In the analysis of these data from phase 1 visits the researchers focused on identifying the mediational effect of the IWB on teacher-pupils interactions. Interactivity was not a feature of the IWB <em>per se<\/em>, but a normal part of the pedagogic process that was mediated by the IWB.<\/p>\n<p><strong>Evidence of pedagogic change in Phase 2 visits <\/strong><\/p>\n<p>Sensitised through undertaking this analysis to the process of mediation of pedagogy with IWBs, during the phase 2 visits, after teachers had been using the IWBs every day for more than two years, the researchers were able to elicit accounts of pedagogic change from some teachers and cross-relate them to the evidence from the digital video-recordings. For example, teachers routinely used the IWB as a shared work space and constructed themselves as co-learners with their students, standing back from the IWB and discussing the task with their students, including the student who took the (traditionally teacher’s) position at the IWB. Here the IWB facilitated the construction of a shared identity (“we”) that teachers had previously aspired to but now found easier to realise.<\/p>\n<p>In another case, a teacher explained how the IWB acted as an aide memoir so that she need not hold her lesson plan in her mind, thereby freeing her to focus wholly on what children were saying to one another. After she asked a question she routinely said to the children “Talk to your partner. Tell your partner what you think” and, because of the considerable reduction in “cognitive load” (Sweller, 1988), was able to listen to what they were saying to one another in order to tailor her teaching more closely to their needs. Here too, it would be possible to achieve a similar effect with other media (flip charts, a data projector), but this would not have given her the ease and flexibility of preparing lessons as a series of IWB ‘screens’ and, as children often told us, they preferred the IWB “because we can see.”<\/p>\n<p>In this way, over and above displaying confidence and competence in using the boards, many teachers had fully integrated the IWB into their pedagogy, although <em>the extent to which their pedagogy had changed as a result<\/em> varied &#8211; both within the practice of individual teachers and between different teachers &#8211; depending on the topic addressed by their teaching and how they used the IWB. One focus of this article is an exploration of teachers’ perceptions of their professional development experiences with the IWBs in order to identify the possible explanations for this apparent success.<\/p>\n<p>The task of implementing this initiative at national level had been given to CfBT, a non-profit private company which was already running the National Primary Strategy for the then DfES. The National Primary Strategy had at the time been recently restructured to incorporate the national strategies for both Literacy and Numeracy: its purpose was to improve the effectiveness of teaching by providing systematic pedagogic strategies to be used by all teachers. The PSWE central team comprised four directors, responsible to a senior director of the National Primary Strategy. In addition the central team worked closely with three regional directors of the Primary Strategy, who were responsible for the areas in which the project would be operating.<\/p>\n<p>The four tasks assigned to the central team as part of this project were to:<\/p>\n<ul>\n<li>Improve the quality of learning and teaching and raise standards through the use of ICT<\/li>\n<li>Provide training materials and examples of good practice for LAs to use with their Primary schools<\/li>\n<li>Provide professional development for key LA representatives on making use of IWBs.<\/li>\n<li>Build a professional community to develop, collate, share, improve and disseminate best practice more widely<\/li>\n<\/ul>\n<p>In relation to the first of these tasks we have already indicated that the PSWE initiative appears to have had a measurable impact on raising standards of evidence relating to the other three tasks, on the grounds that there is likely to have been some relationship between this provision of professional development and resources and the positive outcomes for learners.<\/p>\n<h3>Outcomes from the national training programme for training and support<\/h3>\n<p>By the end of the first year of PSWE:<\/p>\n<ul>\n<li>Training materials had been provided through the website and CD-ROMs distributed at training events. These were positively received by LA consultants although gaps in provision were identified.<\/li>\n<li>Professional development for LA consultants had been provided through five two-day training events (provided at regional locations) with a focus on both skills and pedagogy for using the IWB in numeracy and literacy and to a more limited extent science and modern foreign languages. This training was well received by LA staff.<\/li>\n<li>There had been some progress in establishing links between groups of LAs through setting up Development Groups (DGs) to generate IWB resources. However, owing to the consultants’ lack of time to make an active contribution to the DGs the development of a professional community was curtailed.<\/li>\n<li>It became clear that the central team was too small for the very considerable workload that developed as a result of the scale of take-up of the IWBs (both the number of LAs involved and the numbers of staff each wished to send had escalated).<\/li>\n<\/ul>\n<h2>Regional training and support<a name=\"_Toc165612836\"><\/a><\/h2>\n<p>The 21 LAs in the core group (i.e. those with PSWE funding) varied in size, social makeup, and location. Most of them (and some of their participating schools) had already had involvement in a related project. In this initiative the LAs’ initial role was to:<\/p>\n<ul>\n<li>Select the schools to receive IWBs and help them install the equipment<\/li>\n<li>Support and train the heads and teachers in the management and use of the IWBs<\/li>\n<\/ul>\n<p>In addition some LAs also chose to:<\/p>\n<ul>\n<li>Organise cooperation between schools through the use of school clusters and lead schools.<\/li>\n<li>Structure and\/or provide access to resources<\/li>\n<\/ul>\n<p>Most LAs staffed the initiative with two to four consultants who worked with, and were often partly drawn from, the Primary Strategy Team rather than solely from the ICT Team. This produced in some cases a team of between 10 and 20, focused on training teachers to use the IWBs to teach mathematics and literacy more effectively. No funding was provided for the LAs to cover their own costs, so they relied upon the transfer of staff and resources from other areas. This caused problems for ICT units within the LAs which generally operated as self-funding units, resourced from the fees paid by schools buying in their services. At the same time, consultants already employed through the National Primary Strategy grant to the LA were required to take on the additional responsibility of supporting IWB use in schools, without any additional funding.<\/p>\n<h2>Outcomes from the Regional training and support<\/h2>\n<p>By end of the first year of PSWE:<\/p>\n<ul>\n<li>Overall internal management of the project at LA level was flexible, innovative and practical.<\/li>\n<li>The project had provided a context and motivation for greater cooperation between staff working on ICT-related curriculum\/pedagogy development and those working on generic curriculum\/pedagogy development.<\/li>\n<li>LAs had used a variety of face to face approaches to support schools including day visits, modelling IWB use in classrooms, evening training sessions and cross-school meetings.<\/li>\n<li>Some LAs had expanded their own websites to give teachers easy access to the national whiteboard network website, other national sites, resources generated in local schools and IWB materials generated externally.<\/li>\n<li>There were some gaps in training provision, for example of headteachers to fully inform them of the potential of IWBs.<\/li>\n<li>Some LAs had found that setting up school clusters around a ‘lead school’ proved to be a valuable support strategy.<\/li>\n<li>Teacher technical and pedagogic competence and confidence in using IWBs had improved rapidly as the initiative developed.<\/li>\n<li>The great majority of teachers had become increasingly enthusiastic users of IWBs in their own classrooms.<\/li>\n<\/ul>\n<h2>Local training and support<a name=\"_Toc165612837\"><\/a><\/h2>\n<p>The teachers and heads\/ICT coordinators questionnaires and the case study school interviews provide complementary sources for the views of schools on:<\/p>\n<ul>\n<li>Supporting the development of IWB use in schools<\/li>\n<li>Resources<\/li>\n<li>Training provision<\/li>\n<\/ul>\n<p>Heads\/ICT coordinators were asked what mechanisms were in place to share good practice and who took responsibility for this. A variety of approaches were adopted. Of the 293 headteachers who responded at post-test, 36.5% said that their ICT co-ordinator helped to manage the arrangements and 37 noted that the arrangements were largely informal, in many cases pointing out that the school was small. The headteachers commented that lists of websites, resources and good practice were shared in a variety of ways. Internally this was done via hard copy lists in the staff room or ICT room, or electronically via shared areas on the school network or links on the school website. The information was shared with staff through formal meetings, often regular staff meetings or twilight support sessions run on a regular basis. Joint planning had proved a useful mechanism for sharing practice and resources. 16 headteachers indicated that teachers shared good practice with each other through demonstration, coaching or observation. Beyond the school, networking with other IWB ‘project’ schools and attending LA meetings and training events were also seen as useful means of sharing practice in 16% of schools.<\/p>\n<h3>and other sources<\/h3>\n<p>Uptake of the National Whiteboard Network website was disappointing with only <span class=\"MsoPageNumber\">152 of the 293 (52%) headteachers saying at post-test that they had accessed it. The reason for slow take-up of the NWN website seems to have been the easy availability of IWB advice and resources from a number of sources. In questionnaire returns headteachers mentioned the NWN as just one among many places they could turn to for help. For example, commercial providers (in practice the IWB manufacturers) were mentioned by 44%; the NWN by 20%; and contact with other primary and secondary schools by 12%. Becta resources, Advanced Skills Teachers, the Strategic Leadership for ICT programme (from the National College and Becta) and the awards offered by the National Association of Advisers for Computers in Education were also mentioned by 5% or fewer.<\/span><\/p>\n<p>This diversity in sources for materials was confirmed in the visits to the case study schools, where the majority of case study teachers were making only occasional use of the NWN website. They were eclectic in their use of resources, and more than willing to share their knowledge within their own school, but they already had their favourite sites; users of two of the commonest IWBs for instance tended to make use of the company websites to find material that they then adapted for their own use.<\/p>\n<p>It was clear that what teachers wanted was resources that suited them and their pupils very specifically. In the case study schools teachers stressed the need for resources to be easily modified.<\/p>\n<p>The teachers’ and heads\/ICT coordinators’ questionnaire responses indicate <span class=\"MsoPageNumber\">(Table 1) the major role that LAs played in training provision. In particular the LA’s provision increased considerably from pre to post-test, indicating that this form of provision developed during this first year (although not for all participants).<\/span><\/p>\n<h4>Table 1: Amount of training after installation of IWBs at pre and post-test<\/h4>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td width=\"176\" valign=\"top\">Provider of training<\/td>\n<td colspan=\"2\" width=\"126\" valign=\"top\">Local: ICT co-ordinator<\/td>\n<td colspan=\"2\" width=\"124\" valign=\"top\">Regional: LA<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\"><\/td>\n<td width=\"63\" valign=\"top\">Pre-test<\/p>\n<p>N = 550<\/td>\n<td width=\"63\" valign=\"top\">Post-test<\/p>\n<p>N = 403<\/td>\n<td width=\"63\" valign=\"top\">Pre-test<\/p>\n<p>N = 550<\/td>\n<td width=\"61\" valign=\"top\">Post-test<\/p>\n<p>N = 403<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\">½ day or less<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">15.6%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">16.4%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">20.5%<\/p>\n<\/td>\n<td width=\"61\" valign=\"top\">\n<p align=\"right\">15.6%<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\">More than ½ day, less than 1 day<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">2.2%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">1.7%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">4.5%<\/p>\n<\/td>\n<td width=\"61\" valign=\"top\">\n<p align=\"right\">2.2%<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\">1 day<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">1.6%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">0.7%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">27.5%<\/p>\n<\/td>\n<td width=\"61\" valign=\"top\">\n<p align=\"right\">8.4%<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\">More than 1 day, less than 3 days<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">2.0%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">3.2%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">13.6%<\/p>\n<\/td>\n<td width=\"61\" valign=\"top\">\n<p align=\"right\">33.8%<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\">Over 3 days<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">0.2%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">1.5%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">3.5%<\/p>\n<\/td>\n<td width=\"61\" valign=\"top\">\n<p align=\"right\">11.7%<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\">Ongoing<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">2.5%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">6.0%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">0.2%<\/p>\n<\/td>\n<td width=\"61\" valign=\"top\">\n<p align=\"right\">1.0%<\/p>\n<\/td>\n<\/tr>\n<tr>\n<td width=\"176\" valign=\"top\">None reported<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">76.0%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">70.5%<\/p>\n<\/td>\n<td width=\"63\" valign=\"top\">\n<p align=\"right\">30.2%<\/p>\n<\/td>\n<td width=\"61\" valign=\"top\">\n<p align=\"right\">27.3%<\/p>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>It seems the amount of training reported to be provided by ICT co-ordinators had increased slightly at the end of the first year of the project, with 6% of respondents noting that the training was ongoing by the end of this period. It became clear during the case study visits that the provision of informal support was an important factor in teachers’ professional development. This is not reflected in the questionnaire returns and it may be that teachers completing questionnaires did not ‘count’ it as training.<\/p>\n<p>Of the 259 headteachers who responded at post-test, 18.9% felt that training was primarily operational, 12.4% thought it was primarily pedagogical whilst 67.6% believed it covered both equally. This supports the evidence from LA staff themselves that pedagogic rather than purely technical issues should be central, and the view of most of the case study teachers that the training was best when it was linked to subject teaching rather than to developing ICT skills. This reflects the aims of the NWN training programme and indicates successful diffusion of that aim from training, through LA consultants, into schools and classrooms. It undoubtedly helped to establish use of IWBs by teachers that they were seen as being about teaching and learning rather than the acquisition of technical skills.<\/p>\n<p>When asked specifically what kinds of support the LA provided in relation to the development of IWB skills and knowledge, headteachers noted a wide range of facilities. Many LAs provided opportunities for training either within the school or for all schools participating in the PSWE project. In some cases schools were asked to purchase this provision (this being the standard way of funding ICT training provison in some LAs), and at least one headteacher had elected not to do so. Some headteachers noted that the LAs had provided subject specific support. In addition cluster meetings were held for participating schools. Other services included school visits, hands-on support, consultancy, web sites with resources, telephone support, newsletters, drop-in sessions, CD-ROMs with resources, conferences and mailings.<\/p>\n<p>403 teacher questionnaires were matched from pre to post-test and analysed to see if teachers changed their opinion over the course of the academic year about whether or not their IWB skills were self-taught. There was a statistically significant change in opinion from pre to post-test with more teachers believing that their skills were self-taught (Wilcoxon, Z = -4.900; p &lt; 0.001). This suggested that teachers had become more confident during the school year and had begun to go beyond the initial training mostly provided by the LAs and reached a point at which they were discovering more about the functionality of the IWBs for themselves.<\/p>\n<p>This change seems to have occurred because IWBs were permanently installed in classrooms and many teachers were using IWBs for a considerable number of lessons each week. One interesting result of this was that it was hard for LA training providers to keep ahead of teachers in development of IWB expertise. Developments at the local level of the school through informal development opportunities were progressing more rapidly than knowledge and expertise at regional level. During the first year of PSWE, the main body of expertise shifted from the manufacturers to the LA consultants and then to the teachers using IWBs daily.<\/p>\n<p>It was also reported that teachers were sharing their IWB resources and sources of information more than before they used the IWB. On several occasions, teachers said they felt this was because they were all in a learning role together. This illustrates the importance of developing a local professional community.<\/p>\n<p>As with the selection of resources, what emerged was that teachers were viewing training in IWB use eclectically, creating their own mix of advice and inspiration from colleagues in their own school, LA consultants, attendance at training courses and linking with fellow teachers in nearby schools.<\/p>\n<h2>Outcomes of local training and support at the school level<\/h2>\n<p>By the end of the first year of PSWE:<\/p>\n<ul>\n<li>Teachers were confident in how best to manage the use of IWBs.<\/li>\n<li>A range of training models were in use, ranging from the formal to the informal.<\/li>\n<li>The LAs had provided more formal training than the schools’ ICT coordinators. A quarter of headteachers reported that their staff had received no training from the LA. Case study data suggested that LAs’ focused their training resources on those schools they perceived as having the greatest need.<\/li>\n<li>In around a third of schools the ICT coordinator had played an important role in providing informal training.<\/li>\n<li>The primary strategy website, which provided some IWB resources, was well used and highly regarded by teachers but use of the NWN website was limited.<\/li>\n<li>Around four fifths of the heads considered that operational training had been adequate and two thirds belft it had focused equally on pedagogical and operational factors.<strong> <\/strong><\/li>\n<\/ul>\n<h2>Conclusion<\/h2>\n<p>Despite variations of experience across LAs, schools and teachers, the evidence from the evaluation supports the conclusion that teacher professional development in the use of IWBs was very successful in the schools that received funding from the PSWE initiative. Is it possible from this evidence to suggest possible reasons why PSWE was more successful in providing CPD for ICT than previous initiatives?<\/p>\n<p>First, and most obvious, is the fact that the whiteboards were permanently installed in classrooms and constantly available for class teachers and their students to use whenever needed. Second, in many schools they were installed in all classrooms at the same time (often covering traditional whiteboards so that they could no longer be used). Third, there was an expectation that teachers would use the whiteboard routinely in teaching the primary strategy lessons which took place every morning in two sessions, before and after ‘playtime’. The IWB was the first piece of ICT equipment introduced into English primary classrooms that was seen as an important resource for raising standards of students’ attainment in mathematics and literacy. All of these factors placed the IWB at the heart of teachers’ classroom practice and ensured that its use quickly became routine.<\/p>\n<p>Previously ICT equipment has always been introduced to schools in England as an add-on. ICT has remained a separate subject in the curriculum; its use has been mentioned only in passing in the national curriculum documents for other subjects; and training and support for ICT in the LAs has come from a separate ICT Centre, often run as an independent self-funded unit rather than an integral part of LA provision. A large part of the success of CPD in the PSWE initiative may have come about because of the strong lead from national policy. This emphasised that use of the IWB for teaching was important and teachers were expected to make its use an integral part of their pedagogy. Moreover, the IWB had immediately obvious advantages in delivering the ‘whole class teaching’ which is an integral – and very challenging &#8211; feature of the strategy’s required pedagogy. Hence, the IWB was a very good ‘fit’ with teachers’ perceived and real needs, helping them to keep their students engaged because it generated high levels of enthusiasm.<\/p>\n<p>The national training programme provided by the PSWE central team adopted the ‘cascade’ model which had been notoriously unsuccessful twenty years previously in the training for the Micros in Schools scheme (MacDonald et al., 1988). The level of demand for IWB training was high and there were insufficient resources back in the LAs to fully support its cascade to all schools. Yet, the pressure to use the IWBs already installed in primary classrooms, and the mutual support provided by colleagues who were sharing a common challenge helped to overcome the shortfalls in provision. Much depended, of course, on strong supportive leadership, not least in ensuring that IWBs were provided for all classrooms and a culture of experimentation was valued. Other features of the culture of primary schools helped teachers to make the most of the training and resources available and, importantly, this differs strongly from secondary school culture and appears to be the main reason why the parallel initiative introducing IWBs into secondary schools had very different outcomes (Moss, Jewett et al., 2007). In primary schools there seems to have been a kind of ‘loaves and fishes’ effect whereby everyone found they were able to make a contribution. The small size of primary schools and the common curriculum shared across each year group encouraged the collaborative production of IWB resources (building upon and adapting resources available through PSWE, manufacturers and the internet); and the day-long availability of the IWB enabled new skills to be put to immediate and frequent use. The IWB provided constant easy access to the internet in a form that could be shared by the whole class, as it did with all the other software and resources available on a computer. Teachers in PSWE did not only become quickly competent in the use of the IWB; they massively improved their general ICT skills through frequent use of a computer with a touch-screen interface (i.e. an IWB). The powerful incentives to use an IWB and the obvious advantages it offered (in terms of the internet and students’ enthusiasm) easily overcame any inadequacies in the training and support that LAs were able to offer. The result was that over the two year period 2004-2006 the pool of expertise in the use of IWBs shifted from the LA consultants to the schools. The evaluation showed that expertise in using the whole range of facilities offered by an IWB requires continuing higher level training, such as that provided by the IWB manufacturers. However, the case studies of primary classrooms where teachers had achieved higher than expected national test results showed use of all the ‘bells and whistles’ was not essential. Good use of the basic facilities of the IWB is capable of changing the nature of teacher’s pedagogy in ways that allow them to tailor their teaching more closely to students’ individual learning needs.<\/p>\n<p>The success of the CPD in IWB use that is observable in relation to PSWE can be understood in terms of Communities of Practice theory. In primary schools the introduction of the IWB seems to have created (or at least greatly strengthened the existing) professional communities of practice. ICT Coordinators in the participating primary schools provided important informal training, and in most schools this was diffused by sharing between teachers, either informally – e.g. through exchanging information about URLs – or more formally through discussions at the end of staff meetings. In this way novices were able to acquire skills through the process of ‘legitimate peripheral participation’ described by Lave and Wenger (1991) in their study of South American weavers. Teachers’ learning of IWB use was ‘situated’ in real contexts of use that supported it – i.e. the classroom and the preparation of resources for their own use or that of their year group – rather than taking place away from the classroom (Brown, Collins &amp; Duguid, 1989). Teachers learnt technical and pedagogic skills in IWB use through dialogue and interaction with other teachers, perhaps the most crucial factors in enabling learning according to post-Vygotskian learning theory (Prawat, 1991). Discovering new ways of teaching with an IWB within a professional community revitalised teaching for many teachers, for example one described the process to the evaluators as “exciting”. These professional learning communities around IWB use were observable in most case study schools, and sometimes extended to a cluster of linked schools. The IWB did not, of course, create these communities where they had not previously existed in some form. However, the process of pedagogical innovation – whether it was transformative or largely a case of embedding the IWB in traditional practices – created the ‘shared enterprise’ and ‘mutual endeavour’ that Wenger cites as key features of a community of practice (Wenger, 1998). What Wenger calls a ‘shared repertoire’ was also present in the stories teaches told the evaluators of their shared experiences. In fact, teachers described their membership of several overlapping communities of practice, in many cases the community they shared with the children in their own classroom being at the heart of their learning.<\/p>\n<p>Lewin, C., Scrimshaw, P., Somekh, B. &amp; Haldane, M. (accepted, in press) The impact of formal and informal professional development opportunities on primary teachers’ adoption of interactive whiteboards, <em>Technology, Pedagogy and Education<\/em><\/p>\n<h2>References<\/h2>\n<p class=\"Reference\">Authors (2007, 8 Oct). Evaluation of the Primary Schools Whiteboard Expansion Project. Report to the Department for Children, Schools and Families. Retrieved 9 March, 2008, from Becta website: <a href=\"http:\/\/partners.becta.org.uk\/index.php?section=rh&amp;catcode=_re_rp_02&amp;rid=14422\">http:\/\/partners.becta.org.uk\/index.php?section=rh&amp;catcode=_re_rp_02&amp;rid=14422<\/a><\/p>\n<p class=\"Reference\">Author (2008, in press). Factors affecting teachers&#8217; pedagogical adopting of ICT. In J. Voogt and G. Knezek (Eds.), The International Handbook of IT in Primary and Secondary Education. New York: Springer.<\/p>\n<p class=\"Reference\">Arnott, S. (2004, 9 Aug). Computers to replace school blackboards. Retrieved 9 March, 2008, from Computing website: <a href=\"http:\/\/www.computingcareers.co.uk\/computing\/news\/2070841\/computers-replace-school-blackboards\">http:\/\/www.computingcareers.co.uk\/computing\/news\/2070841\/computers-replace-school-blackboards<\/a><\/p>\n<p class=\"Reference\">Becta (2002, 13 Feb). The benefits of an interactive whiteboard. Retrieved 9 March, 2008, from Becta website: <a href=\"http:\/\/schools.becta.org.uk\/index.php?section=tl&amp;catcode=ss_tl_use_02&amp;rid=86\">http:\/\/schools.becta.org.uk\/index.php?section=tl&amp;catcode=ss_tl_use_02&amp;rid=86<\/a><\/p>\n<p class=\"Reference\">Becta (2004). Getting the most from your interactive whiteboard: A guide for primary schools. Coventry, UK: Becta.<\/p>\n<p class=\"Reference\">Becta (2006). Survey of LAN infrastructure and ICT in schools: November 2005 to January 2006. Coventry, UK: Becta.<\/p>\n<p class=\"Reference\">BESA (2006). ICT in UK State Schools 2006 – Summary Report. London: BESA.<\/p>\n<p class=\"Reference\">Brown, J. S., Collins, A. &amp; Duguid, P. (1989). Situated Cognition and the Culture of Learning. Educational Researcher, 32 (Jan-Feb), 32-42.<\/p>\n<p class=\"Reference\">Cox, M., Webb, M., Abbott, C., Blakeley, B., Beauchamp, T. &amp; Rhodes, V. (2004). ICT and pedagogy: A review of the research literature. Annesley, UK: Department for Education and Skills. Available online at:<a href=\"http:\/\/publications.becta.org.uk\/display.cfm?resID=25813\"> http:\/\/publications.becta.org.uk\/display.cfm?resID=25813<\/a><\/p>\n<p class=\"Reference\">Cox, M. &amp; Rhodes, V. (in press) The effectiveness of training teachers to use ICT: lessons from the past.<\/p>\n<p class=\"Reference\">Gillen, J., Kleine Staarman, J., Littleton, K., Mercer, N. and Twiner, A. (2007). A ‘learning revolution’? Investigating pedagogic practice around interactive whiteboards in British primary classrooms. Learning, Media and Technology, 32 (3), 243-256.<\/p>\n<p class=\"Reference\">Hennessy, S., Deaney, R., Ruthven, K. and Winterbottom, M. (2007). Pedagogical strategies for using the interactive whiteboard to foster learner participation in school science. Learning, Media and Technology, 32 (3), 283-302.<\/p>\n<p class=\"Reference\">Higgins, S., Falzon, C., Hall, I., Moseley, D., Smith, F., Smith, H. &amp; Wall, K. (2005). Embedding ICT in the Literacy &amp; Numeracy Strategies: Final Report. Newcastle, UK: University of Newcastle School of Education, Centre for Learning &amp; Teaching. Retrieved 9 March, 2008, from Becta website : <a href=\"http:\/\/www.becta.org.uk\/page_documents\/research\/univ_newcastle_evaluation_whiteboards.pdf\">http:\/\/www.becta.org.uk\/page_documents\/research\/univ_newcastle_evaluation_whiteboards.pdf<\/a><\/p>\n<p class=\"Reference\">Kennewell, S. and Morgan, A. (2003) Student teachers&#8217; experience and attitudes towards using interactive whiteboards in the teaching &amp; learning of young children. In J., Wright, A. McDougall, J. Murnane &amp; J.Lowe (Eds.), Young children &amp; learning technologies (pp. 71-76). Sydney: Australian Computer Society.<\/p>\n<p class=\"Reference\">Kitchen, S., Finch, S. &amp; Sinclair, R. (2007, 10 July). Harnessing Technology Schools Survey 2007. Retrieved 9 March, 2008, from Becta website: <a href=\"http:\/\/partners.becta.org.uk\/index.php?section=rh&amp;catcode=_re_rp_02&amp;rid=14110\">http:\/\/partners.becta.org.uk\/index.php?section=rh&amp;catcode=_re_rp_02&amp;rid=14110<\/a><\/p>\n<p class=\"Reference\">Lave, J. &amp; Wenger, E. (1991). Situated Learning: Legitimate peripheral participation. Cambridge, New York and Melbourne: Cambridge University Press.<\/p>\n<p class=\"Reference\">MacDonald, B., Beattie, C., Schostak, J. &amp; Somekh, B. (1988). Department of Trade and Industry Micros in Schools Support 1981-84, an Independent Evaluation. Norwich, UK: CARE, University of East Anglia.<\/p>\n<p class=\"Reference\">Moss, G., Jewitt, C., Levacic, R., Armstrong, V., Cardini, A. &amp; Castle, F. (2007). The Interactive Whiteboards, Pedagogy and Pupil Performance Evaluation: An Evaluation of the Schools Whiteboard Expansion (SWE) Project: London Challenge (Research Report RR816). Annesley, UK: Department for Education and Skills. Available online at: <a href=\"http:\/\/www.dfes.gov.uk\/research\/data\/uploadfiles\/RR816.pdf\">http:\/\/www.dfes.gov.uk\/research\/data\/uploadfiles\/RR816.pdf<\/a><\/p>\n<p class=\"Reference\">Mumtaz, S. (2000). Factors Affecting Teachers&#8217; Use of Information and Communications Technology: a review of the literature. Journal of Information Technology for Teacher Education, 9(3), 319-341.<\/p>\n<p class=\"Reference\">Prawat, R.S. (1991). The Value of Ideas: The Immersion Approach to the Development of Thinking. Educational Researcher, 20(2), 3-10.<\/p>\n<p class=\"Reference\">Preston, C. (2004). Learning to use ICT in classrooms, teachers’ and trainees’ perspectives: The full evaluation of the English NOF training programme 1999–2003. London: TTA\/MirandaNet. Retrieved March 9, 2008, from the MirandaNet website: <a href=\"http:\/\/www.mirandanet.org.uk\/tta\">http:\/\/www.mirandanet.org.uk\/tta<\/a><\/p>\n<p class=\"Reference\">Prior, G., &amp; Hall, L. (2004). ICT in schools survey 2004: findings from a survey conducted in Spring 2004. Research and Evaluation Series No. 22. Coventry\/London: Becta\/Department for Education and Skills.<\/p>\n<p class=\"Reference\">Smith, F., Hardman, F. &amp; Higgins, S. (2006). The impact of interactive whiteboards on teacher-pupil interaction in the National Literacy and Numeracy Strategies. British Educational Research Journal, 32 (3), 443-457.<\/p>\n<p class=\"Reference\">Sweller, J., Cognitive load during problem solving: Effects on learning. Cognitive Science, 12, 257-285 (1988).<\/p>\n<p class=\"Reference\">Wenger, E. (1998). Communities of Practice: learning, meaning and identity. Cambridge UK, New York and Melbourne: Cambridge University Press.<\/p>\n<p class=\"Reference\">Wertsch, J.V. (1998) Mind as Action. New York and Oxford: Oxford University Press.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The impact of formal and informal professional development opportunities on primary teachers’ adoption of interactive whiteboards Abstract This paper reports on the approaches undertaken to support the development of teachers’ uses of interactive whiteboards in the Primary Schools Whiteboard Expansion &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=257\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":249,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/257"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=257"}],"version-history":[{"count":9,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/257\/revisions"}],"predecessor-version":[{"id":266,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/257\/revisions\/266"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/249"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=257"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}