{"id":48,"date":"2009-02-23T10:19:41","date_gmt":"2009-02-23T10:19:41","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=48"},"modified":"2015-02-03T12:32:08","modified_gmt":"2015-02-03T12:32:08","slug":"graphic-organizers","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=48","title":{"rendered":"Graphic Organizers"},"content":{"rendered":"<p><strong>Graphic Organizers: A Review of Scientifically Based Research <\/strong><strong>July 2003 <\/strong><\/p>\n<p><strong>Prepared for Inspiration Software<\/strong><strong>®<\/strong><strong>, Inc. by <\/strong><\/p>\n<p><strong>The Institute for the Advancement of Research in Education (IARE) <\/strong><\/p>\n<p><strong>at AEL <\/strong>P.O. Box 1348 Charleston, WV 25325-1348 Phone: 304-347-0400 Fax: 304-347-0487 www.ael.org 7412 SW Beaverton Hillsdale Hwy, Ste 102 Portland, OR 97225-2167 USA Phone: 503-297-3004 Fax: 503-297-4676 www.inspiration.com ©2003 Inspiration Software, Inc. All rights reserved. Inspiration®, Inspiration Software®, and 2 Kidspiration® are registered trademarks. All other brands are the property of their respective owners. <strong><\/strong><\/p>\n<p><strong>EXECUTIVE SUMMARY <\/strong><\/p>\n<p>Kidspiration! and Inspiration! are used widely in schools across the country to accomplish curriculum goals using visual learning as implemented by the use of graphic organizers such as concept maps, idea maps, and webs. <\/p>\n<p><strong>Prepared by Institute for the Advancement of Research in Education. <\/strong>To provide educators with evidence of the instructional effectiveness of the use of graphic organizers, Inspiration Software!, Inc. contracted with the Institute for the Advancement of Research in Education (IARE) at AEL to conduct a study of existing educational research. IARE is an independent research body that provides research and evaluation services to clients in the education arena. IARE draws on the expertise and credibility of its 36-year-old parent company, AEL, to deliver unbiased, customized services grounded in accepted research and evaluation standards. <\/p>\n<p><strong>Identification of 29 scientifically based research studies<\/strong>. IARE staff conducted an extensive search of academic databases to locate research on the instructional effectiveness of the use of graphic organizers. Using the definitions set forth by Section 9101 of the <em>No Child Left Behind Act (NCLB) <\/em>of 2001, IARE selected 29 scientifically based research studies that applied rigorous, systematic, and objective procedures to obtain reliable and valid knowledge relevant to education activities and programs. <\/p>\n<p><strong>Visual learning strategies improve student performance<\/strong>. Scientifically based research cited in the literature review demonstrates that a research base exists to support the use of graphic organizers for improving student learning and performance across grade levels, with diverse students, and in a broad range of content areas. IARE conclusions from this review include: <\/p>\n<p>• <strong>Reading comprehension. <\/strong>Use of graphic organizers is effective in improving students’ reading comprehension. <\/p>\n<p>• <strong>Student achievement. <\/strong>Students using graphic organizers show achievement benefits across content areas and grade levels. Achievement benefits are also seen with students with learning disabilities. <\/p>\n<p>• <strong>Thinking and learning skills. <\/strong>The process of developing and using a graphic organizer enhances skills such as developing and organizing ideas, seeing relationships, and categorizing concepts. <\/p>\n<p>• <strong>Retention. <\/strong>Use of graphic organizers aids students in retention and recall of information. <\/p>\n<p><strong>• Cognitive learning theory. <\/strong>The use of graphic organizers supports implementation of cognitive learning theories: dual coding theory, schema theory, and cognitive load theory. <\/p>\n<p><strong>SUMMARY <\/strong><\/p>\n<p><strong>I<\/strong>nspiration Software, Inc. contracted with the Institute for the Advancement of Research in Education (IARE) at AEL to review the theoretical and\/or research bases of visual learning and the use of graphic organizers for instruction. Inspiration Software, Inc. offers premier software tools (Inspiration and Kidspiration) for use in K-12 schools. Inspiration, designed for students in grade six to adult, can be used across the curriculum for brainstorming, webbing, diagramming, planning, concept mapping, organizing, and outlining. Kidspiration, for students in kindergarten through grade five, helps students brainstorm ideas with pictures and words, organize and categorize information visually, and create stories and descriptions. Both offer an integrated graphic organizer tool and outline tool that work together to help students comprehend concepts and information (http:\/\/www.inspiration.com\/productinfo). <\/p>\n<p>IARE reviewed the theoretical and\/or research bases of graphic organizers and visual learning to inform Inspiration Software, Inc. of what scientifically based research (SBR) indicates about the effects of these visual tools on student achievement, critical thinking, reading comprehension, and writing. Inspiration Software, Inc. identified these areas as being key to its assessment of its products’ potential effectiveness. <\/p>\n<p>To meet this purpose, four major areas of literature were reviewed: <\/p>\n<ol type=\"1\">\n<li>Learning theories that support the use of graphic      organizers. These learning theories include the dual coding theory, schema      theory, and cognitive load theory. <\/li>\n<li>The benefits of graphic organizers on student      achievement in terms of literacy development. Inspiration Software, Inc.      further defined literacy development as vocabulary development, early      reading comprehension (kindergarten through second grade), reading in      other grades (3-12), and writing skills. <\/li>\n<li>The use of graphic organizers for thinking and      learning skills. Inspiration Software, Inc. defined thinking and learning      skills to include critical thinking, retention, problem solving, and note      taking or outlining. <\/li>\n<li>The use of graphic organizers in other classroom      work. In particular, curriculum, grade, and student-population-specific      uses were examined. <\/li>\n<\/ol>\n<p><strong>Methodology <\/strong>Research in each of the four major areas of the paper (learning theories, graphic organizers for literacy development, graphic organizers for thinking and learning skills, and graphic organizers in other classroom work) was identified. Using academic databases such as ERIC, IARE conducted key word searches to locate research on graphic organizers and the theories supporting their use. Studies and research referenced in reports such as the National Reading Panel’s 2000 report titled <em>Teaching Children to Read: An Evidence-Based Assessment of the Scientific Research Literature on Reading and Its Implications for Reading Instruction <\/em>and the National Center on Accessing the General Curriculum’s report providing evidence on the effectiveness of concept maps were obtained (http:\/\/www.cast.org\/ncac\/ConceptMaps1669.cfm). <\/p>\n<p>Research referenced from other research-based sources, such as <em>Classroom Instruction that Works: Research- Based Strategies for Increasing Student Achievement <\/em>(Marzano et al., 2001), were also retrieved. A final source was a bibliography provided by Inspiration Software, Inc. Prior to contracting with IARE to complete this review, Inspiration Software, Inc. looked at some of the research and theories that lend support to the use of graphic organizers. The company’s white paper provided an overview of the theoretical background and studies supporting the use of graphic organizers in K-12 classrooms. <\/p>\n<p>Research studies selected for inclusion in this review were limited to those meeting criteria for SBR as defined by Section 9101 of the <em>No Child Left Behind Act (NCLB) <\/em>of 2001. Briefly, such research involves the application of rigorous, systematic, and objective procedures to obtain reliable and valid knowledge relevant to education activities and programs. IARE staff reviewed the research and, using the criteria from NCLB and the National Research Council’s volume <em>Scientific Research in Education <\/em>(Committee on Scientific Principles for Education Research, 2002), selected only studies that aligned with these criteria to include in this review. NCLB’s definition of SBR draws particular attention to experimental and quasi-experimental designs. Both experimental and quasi-experimental designs employ experimental and comparison groups. An experimental group is a group, in a research study, that receives the treatment or intervention. While experimental or quasi-experimental designs must include at least one comparison group, they may or may not include a control group (Redfield, Sivin- Kachala, &amp; Schneiderman, 2003). The main difference between experiments and quasi-experiments is that in experiments, study participants are randomly selected from the population to which results of the study are to be generalized and\/or randomly assigned to experimental and comparison groups, but not necessarily to both. Random selection is not haphazard or arbitrary. It follows a specified procedure using a Table of Random Numbers or a computer program for random selection. A sample either is random or it is not (Redfield, Sivin-Kachala, &amp; Schneiderman, 2003). <\/p>\n<p><strong>Summary of Findings <\/strong><\/p>\n<p>Research cited in this literature review shows that a research base exists to support the use of graphic organizers for improving student learning and performance across grade levels, with diverse students, and in a broad range of content areas. The products from Inspiration Software, Inc. appear to be supported by the findings from SBR. A total of 29 SBR studies were reviewed in this paper. Of these, eight studies cut across two of the paper’s major areas, meaning that examples from these studies were used in more than one area (e.g., SBR on the use of graphic organizers for thinking and learning skills, and SBR on the use of graphic organizers for literacy development). Specific findings of the research follow. These findings are organized around the four major areas of research reviewed. <\/p>\n<p><strong>Cognitive Learning Theories <\/strong>• Dual coding theory maintains that we code information both in verbal and nonverbal formats. By attending to both formats (e.g., nonverbal as well as verbal can be addressed through the use of graphic organizers), information is easier to retain and recall. <\/p>\n<p>• Schema theory explains that within our memory exists schemas, or networks of information. The use of a graphic organizer can help students link the existing knowledge organized in schemas to the new knowledge. <\/p>\n<p>• Cognitive load theory suggests that working memory has a maximum capacity of information it can process. If that load is exceeded, learning does not take place. Graphic organizers, if used appropriately, can help reduce the cognitive load and, consequently, enable more resources (working memory) to be devoted to learning new material. <\/p>\n<p><strong>SBR on the Use of Graphic Organizers for Literacy Development <\/strong><\/p>\n<p>• One SBR study (Brookbank et al., 1999) and a meta-analysis of 23 studies (Moore &amp; Readence, 1984) concluded that graphic organizers moderately affect vocabulary test scores. The SBR study (quasi-experimental), which involved two classes of first- and second-grade students, found that graphic organizers helped at least 80% of students at all grade levels master key vocabulary skills. <\/p>\n<p>• Two quasi-experimental SBR studies (Gallick-Jackson, 1997; Meyer, 1995) focused on the use of graphic organizers as a part of the writing process for second- and third-grade students. Results of posttests and writing samples revealed that students’ writing skills improved. <\/p>\n<p>• Two quasi-experimental SBR studies (Brookbank et al., 1999; Sinatra et al., 1984) that included early elementary age students (first and second grade) found that graphic organizers helped improve students’ reading comprehension. <\/p>\n<p>• Following a review of the research literature on vocabulary and text comprehension instruction, the National Reading Panel (2000) cited graphic and semantic organizers (including story maps) as one of seven categories of instruction that are the most effective in the improvement of reading comprehension. Findings from the seven SBR studies (Berkowitz, 1986; Bowman et al., 1998; Darch et al., 1986; Davis, 1994; Gordon &amp; Rennie, 1987; Reutzel, 1985; Troyer, 1994) (four quasi-experimental, three experimental) included in this paper concurred with these findings. <\/p>\n<p><strong>SBR on the Use of Graphic Organizers for Thinking and Learning Skills <\/strong>• Two SBR studies (Brookbank et al., 1999; DeWispelaere &amp; Kossack, 1996) examined how critical thinking skills or higher order thinking skills were enhanced as a result of using graphic organizers. The quasi-experimental studies involved students from six elementary, junior high, and high school classrooms. Findings indicated that graphic organizers enable students to improve critical thinking and higher order thinking skills, as measured by teacher observations and student performance on classroom projects. <\/p>\n<p>• Three SBR studies (Bos &amp; Anders, 1992; Ritchie &amp; Volkl, 2000; Griffin et al., 1995) examined the effects of graphic organizers on retention and recall. Overall findings of the three studies (two quasi-experimental, one experimental) indicated that graphic organizers are a helpful method for improving student retention and recall of information for both elementary and junior high students with learning disabilities, as well as upper elementary students (fifth and sixth grade). Followup tests at various intervals following instruction found that students retained information they learned via graphic organizers. In one study, graphic organizers were also found to help students transfer retention and recall skills to new situations (Griffin et al., 1995). <\/p>\n<p>• Findings from one quasi-experimental SBR study that used graphic organizers as a problem-solving tool in mathematics demonstrated that fifth-grade students’ problem-solving skills improved based on teacher observation (Braselton &amp; Decker, 1994). <\/p>\n<p>• Two quasi-experimental SBR studies (Doyle, 1999; Meyer, 1995) used graphic organizers as an outlining tool. One study used graphic organizers with eight senior high students with learning disabilities in the area of social studies. The second study, which integrated graphic organizers as a part of the creative writing process, was conducted with a class of third-grade students. The first study concluded that graphic organizers were a viable alternative to conventional note taking methods, as measured by results on the end-of-chapter test. Graphic organizers also assisted students in the writing process, as measured by writing samples. <\/p>\n<p><strong>SBR on the Use of Graphic Organizers in Other Classroom Work <\/strong>The majority of SBR studies included in this review have used graphic organizers with students in the upper elementary (fourth and fifth) and middle level (sixth, seventh, and eighth) grades (24 studies). A smaller number of studies have taken place in the lower elementary grades (four studies) and with secondary school students (four studies). (Note: Some studies included more than one grade level; consequently, the total across the three levels adds up to more than 29 SBR studies.) Findings from the studies included in this review show that the effects of using graphic organizers are positive. In other words, students have demonstrated improvement in achievement or performance in the content assessed. Findings from the studies suggest that graphic organizers are an advantageous teaching and learning strategy at the upper elementary and middle level grades. <\/p>\n<p>• Five SBR studies (Guastello et al., 2000; Hawk, 1986; Ritchie &amp; Volkl, 2000; Simmons et al., 1988; Willerman &amp; Mac Harg, 1991) focused on the use of graphic organizers to facilitate middle level students’ (sixth, seventh, and eighth grade) learning of science content. Findings from these studies (three quasiexperimental, two experimental) indicate that the graphic organizer is an effective tool for aiding student comprehension and retention of science material. Additionally, students using concept maps scored higher on posttests than students receiving more traditional types of instruction. <\/p>\n<p>• Four SBR studies (Alvermann &amp; Boothby, 1983; Alvermann &amp; Boothby, 1986; Armbruster et al., 1991; Griffin et al., 1995) in the area of social studies used graphic organizers to help students organize information from expository texts and comprehend content area reading. All four studies were conducted with either fourth- or fifth-grade students. Findings from the four studies (two quasiexperimental, two experimental) found that graphic organizers helped students select, organize, and recall relevant information, as measured by posttests. Students were also able to transfer thinking and learning skills to novel situations and content. <\/p>\n<p>• One quasi-experimental SBR study (Braselton &amp; Decker, 1994) with sixth-grade mathematics students found graphic organizers to be advantageous in the improvement of students’ problem-solving skills. <\/p>\n<p>• One quasi-experimental SBR study (DeWispelaere &amp; Kossack, 1996) in a junior high and high school Spanish as a second language class found that graphic organizers improved students’ higher order thinking skills as measured by performance on chapter quizzes, tests, and student projects. <\/p>\n<p>• The seven SBR studies (Boyle &amp; Weishaar, 1997; Doyle, 1999; Gallego et al., 1989; Gardill &amp; Jitendra, 1999; Griffin et al., 1991; Scanlon et al., 1992; Sinatra et al., 1984) on the use of graphic organizers with students with learning disabilities included in this review indicated that graphic organizers are beneficial with this population of students. The studies (five quasi-experimental, two experimental) found the use of graphic organizers to be an effective strategy in helping students comprehend content area material, organize information, and retain and recall content, as measured by posttests. Graphic organizers have also been found to be effective tools for helping students organize information and make connections with existing schemas. <\/p>\n<p><strong>Conclusions <\/strong>The primary purpose of this literature review was to analyze the extant research on visual learning and graphic organizers to determine what the findings from SBR indicated about the effects these visual tools had on student achievement, critical thinking, comprehension, and writing. Inspiration Software, Inc. identified these areas as key to the assessment of its products’ effectiveness. The conclusions in this section are drawn to align with this purpose. After reviewing 29 SBR studies, researchers drew several conclusions about the effects of graphic organizers on student achievement, critical thinking (and thinking and learning skills as a whole), and reading comprehension and writing (literacy development). <\/p>\n<p><strong>Student Achievement <\/strong>The benefits of graphic organizers across several content areas (science, social studies, mathematics, Spanish as a second language, vocabulary, reading, and writing), multiple grade levels (first through senior high school), and different student populations (regular education students and students with learning disabilities) have been verified in the 29 experimental and quasi-experimental SBR studies cited throughout this paper. All of the studies included in this review have shown that using graphic organizers led to improved student performance as measured by various forms of assessments (classroom-based, observation, textbook, and standardized). Graphic organizers also have been found to result in superior student performance when compared with more traditional forms of instruction (e.g., lecture, linear note taking, question\/answering). <\/p>\n<p>SBR supports the use of graphic organizers at the upper elementary and middle level grades (sixth through eighth) (Alvermann &amp; Boothby, 1986; Alvermann &amp; Boothby, 1983; Armbruster et al, 1991; Berkowitz, 1986; Braselton &amp; Decker, 1994; Brookbank et al., 1999; Bowman et al., 1998; Darch et al. 1986; Davis, 1994; DeWispelaere &amp; Kossack, 1996; Gallego et al., 1989; Gardill &amp; Jitendra, 1999; Gordon &amp; Rennie, 1987; Griffin et al., 1995; Griffin et al., 1992; Guastello et al., 2000; Hawk, 1986; Reutzel, 1985; Ritchie &amp; Volkl, 2000; Scanlon et al., 1992; Simmons et al., 1988; Sinatra et al., 1984; Troyer, 1994; Willerman &amp; Mac Harg, 1991). Some SBR (Brookbank et al., 1999; Davis, 1994; Gallick-Jackson, 1997; Meyer, 1995; Sinatra et al., 1984) also exists to support the use of graphic organizers in the lower elementary grades (kindergarten through third). Positive results have been shown with secondary grade level (ninth through twelfth) students as well (Boyle &amp; Weishaar, 1997; DeWispelaere &amp; Kossack, 1996; Doyle, 1999; Scanlon et al., 1992). <\/p>\n<p>For the special population of students with learning disabilities, graphic organizers have been used with success (Boyle &amp; Weishaar, 1997; Doyle, 1999; Gallego et al., 1989; Gardill &amp; Jitendra, 1999; Griffin et al., 1992; Scanlon et al., 1992; Sinatra et al., 1984). Students with learning disabilities typically have difficulty comprehending content area texts and lack reading comprehension skills (Scanlon et al., 1992). Graphic organizers have been found to be effective tools for helping these students organize information and make connections with existing schemas. As a result, for the students with learning disabilities studied, comprehension and recall of information was enhanced. <\/p>\n<p><strong>Critical Thinking <\/strong>The process of developing and using a graphic organizer has been shown to enhance students’ critical thinking or higher order thinking skills (Brookbank et al., 1999; DeWispelaere &amp; Kossack, 1996). In addition to developing critical thinking skills, graphic organizers have also been shown to help students with mathematical problem solving (Braselton &amp; Decker, 1994). Graphic organizers have helped students retain and recall information (Bos &amp; Anders, 1992; Ritchie &amp; Volkl, 2000; Griffin et al., 1995). And, students have effectively used graphic organizers as an outlining tool (Doyle, 1999; Meyer, 1995). Doyle (1999) found students with learning disabilities obtained higher test scores on end of chapter tests if they used graphic organizers as study tools as compared to traditional linear note taking methods. Meyer (1995) concluded third grade students’ writing improved as a result of using graphic organizers to organize ideas. As a tool to support students’ thinking and learning processes, the 29 research studies have shown that graphic organizers help students: <\/p>\n<p>• brainstorm ideas. <\/p>\n<p>• develop, organize, and communicate ideas. <\/p>\n<p>• see connections, patterns, and relationships. <\/p>\n<p>• assess and share prior knowledge. <\/p>\n<p>• develop vocabulary. <\/p>\n<p>• outline for writing process activities. <\/p>\n<p>• highlight important ideas. <\/p>\n<p>• classify or categorize concepts, ideas, and information. <\/p>\n<p>• comprehend the events in a story or book. <\/p>\n<p>• improve social interaction between students, and facilitate group work and collaboration among peers. <\/p>\n<p>• guide review and study. <\/p>\n<p>• improve reading comprehension skills and strategies. <\/p>\n<p>• facilitate recall and retention. <\/p>\n<p><strong>Reading Comprehension and Writing (Literacy Development) <\/strong>Graphic organizers have been found to improve students’ reading comprehension at all levels, first grade through high school (Berkowitz, 1986; Bowman et al., 1998; Brookbank et al., 1999; Davis, 1994; Darch et al., 1986; Gordon &amp; Rennie, 1987; Reutzel, 1985; Sinatra et al., 1984; Troyer, 1994); in content area classes, for example, science and social studies (Alvermann &amp; Boothby, 1986; Griffin et al., 1995; Guastello et al., 2000); and with students with learning disabilities (Gardill and Jitendra, 1999). A limited amount of research has been conducted with students at the early elementary level—first and second grade (Brookbank et al., 1999; Sinatra et al., 1984). Further support for graphic organizers was found in a report by the National Reading Panel (2000) titled <em>Teaching Children to Read: An Evidence-Based Assessment of the Scientific Research Literature on Reading and Its Implications for Reading Instruction<\/em>. NRP cited graphic and semantic organizers (including story maps) as one of seven categories of instruction that is the most effective in improving reading comprehension. Evidence has also been found to indicate graphic organizers benefit elementary age students (second and third grade) in the writing process and improve their writing skills (Gallick-Jackson, 1997; Meyer, 1995). <\/p>\n<p>This summary is an overview of the complete, 44-page research report compiled by the Institute of Advancement of Research in Education (IARE) at AEL. The full report cites further evidence in support of visual learning techniques leading to improved student learning and performance. To receive a complete copy of this report, send a request to &#x72;&#x65;&#x73;&#x65;&#x61;&#x72;&#x63;&#x68;&#x40;&#x69;&#x6e;&#115;&#112;&#105;&#114;&#97;&#116;&#105;on&#46;com <\/p>\n<p><strong><em>About AEL <\/em><\/strong>AEL is a not-for-profit corporation that applies the latest education research to promote strategies for student success. AEL delivers products and services that integrate research and development, evaluation, professional development, technology, and diverse perspectives. AEL products and services meet the needs of state departments of education, school districts, schools and the companies that build products to serve them. Since 1966, AEL has operated major research and technical assistance contracts funded by the U. S. Department of Education, U. S. Department of Labor, National Science Foundation, and the Appalachian Regional Commission.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Graphic Organizers: A Review of Scientifically Based Research July 2003 Prepared for Inspiration Software®, Inc. by The Institute for the Advancement of Research in Education (IARE) at AEL P.O. Box 1348 Charleston, WV 25325-1348 Phone: 304-347-0400 Fax: 304-347-0487 www.ael.org 7412 &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=48\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":9,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/48"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=48"}],"version-history":[{"count":6,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/48\/revisions"}],"predecessor-version":[{"id":1121,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/48\/revisions\/1121"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/9"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=48"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}