{"id":90,"date":"2009-02-23T11:27:25","date_gmt":"2009-02-23T11:27:25","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/vl_blog\/?page_id=90"},"modified":"2009-02-25T17:04:31","modified_gmt":"2009-02-25T17:04:31","slug":"neuroscience-learning-and-the-classroom","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=90","title":{"rendered":"Neuroscience, Learning and the Classroom"},"content":{"rendered":"<p><strong>Neuroscience, Learning and the Classroom<\/strong><\/p>\n<p>Neurophilosophy<\/p>\n<p>Neuroscience and education<\/p>\n<p>Posted in Education, Neuroscience by MC on June 4th, 2007<\/p>\n<p>The <em>Economist<\/em> of June 4 2007 carried a short article about how neuroscience <em>could<\/em> be applied to education:<\/p>\n<p>Researchers hope that a better understanding of the way the brain works will improve education for all children, not only those with educational problems. But it will be some time before this grand vision becomes reality, and in the meantime practice is pulling worryingly ahead of theory. In May the Economic and Social Research Council (ESRC), a funding body, published a report on neuroscience and education. It called for more dialogue between scientists and teachers to counter the “neuromyths” that hold sway in many of Britain’s classrooms.<\/p>\n<p>One such myth is the notion that there are “critical periods” outside which certain subjects cannot be learned &#8211; witness the oft-claimed impossibility of mastering a second language unless a start is made in early childhood. It is more accurate to talk of “sensitive periods” when learning comes most naturally. Another oversimplification is pigeon-holing children as “visual”, “auditory” or “kinaesthetic” learners. Some teachers are so keen that they give each child a “V”, “A” or “K” badge to prompt adults to communicate accordingly. In reality, we all use each style, and which is most appropriate depends on what is being learnt as well as personality.<\/p>\n<p>Quoted in the article is Usha Goswami of the Centre for Neuroscience in Education at Cambridge University, one of the few research centres in the U.K. devoted to neuroscience and education. In this recent review, Goswami notes that the progress made in our understanding of the neural bases of literacy, numeracy and attention has been theoretical and largely inapplicable in the classroom. The gap between neuroscientific data and the classroom has therefore been filled by misinformation from the brain-based learning industry.<\/p>\n<p>Educationalists have eagerly adopted teaching methods based on the spurious and unfounded claims of the brain-based learning initiatives. (One of the neuromyths &#8211; that some children are “visual learners” while others are “auditory learners”, etc. &#8211; is based on Howard Gardner’s theory of multiple intelligences.) Goswami believes that effective communicators of neuroscience are needed to bridge the gap between research and the classroom. Ideally, these communicators would be ex-scientists with an interest in education, who can “translate” new findings in neuroscience into a language that educationalists can understand.<\/p>\n<p><strong>Reference:<\/strong><\/p>\n<p>Goswami, U. (2006). Neuroscience and education: from research to practice. Nat. Rev. Neurosci. <strong>7<\/strong>: 406-413.<\/p>\n<p><strong>&#8220;What sort of evidence from Neuroscience should inspire educational change?&#8221;<\/strong><\/p>\n<p><strong>Collaborative Frameworks for Neuroscience and Education<\/strong><\/p>\n<p><a href=\"http:\/\/www.bristol.ac.uk\/education\/research\/networks\/nenet\/brain\/docs\">http:\/\/www.bristol.ac.uk\/education\/research\/networks\/nenet\/brain\/docs<\/a><\/p>\n<p>Resources from the ESRC Teaching and Learning Research Programme at the Graduate School of Education, University of Bristol.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Neuroscience, Learning and the Classroom Neurophilosophy Neuroscience and education Posted in Education, Neuroscience by MC on June 4th, 2007 The Economist of June 4 2007 carried a short article about how neuroscience could be applied to education: Researchers hope that &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/vl_blog\/?page_id=90\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":80,"menu_order":0,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/90"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fcomments&post=90"}],"version-history":[{"count":3,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/90\/revisions"}],"predecessor-version":[{"id":408,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/90\/revisions\/408"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=\/wp\/v2\/pages\/80"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/vl_blog\/index.php?rest_route=%2Fwp%2Fv2%2Fmedia&parent=90"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}