{"id":138,"date":"2011-04-21T14:49:51","date_gmt":"2011-04-21T14:49:51","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=138"},"modified":"2014-02-24T10:22:50","modified_gmt":"2014-02-24T10:22:50","slug":"david-fuller","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/david-fuller\/","title":{"rendered":"David Fuller"},"content":{"rendered":"<p><a rel=\"attachment wp-att-139\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/consultants\/david-fuller\/david-fuller\/\"><img loading=\"lazy\" class=\"size-thumbnail wp-image-139 alignright\" title=\"David Fuller\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/David-Fuller-150x150.png\" alt=\"\" width=\"150\" height=\"150\" \/><\/a>My approach to teaching and learning is based on what I have learnt from practical teaching in the classroom and in independent schools.  I am keen to develop the instinctive feel for teaching that is not always encouraged by chasing targets.I think good teachers should be allowed to judge what will work in the classroom to get the best results as long as they can show that their approach is in the best interests of a pupil progress. The classroom should provide a relaxed, relatively informal atmosphere, but one where discipline is maintained, and the children feel secure in their learning.<\/p>\n<p>These are the teaching and learning ideals that I like to encourage other teachers to embrace in ourMirandaNet iCatalyst Continuing Professional Development Programmes, in our communities of practice and in face to face situations where I can draw on considerable experience from working in a variety of independent schools and academies.<\/p>\n<p>Talking about digital technologies in particular I do not think they should ever be seen as a replacement for good teaching. However there are a number of tasks that could be undertaken through the use of such technologies &#8211; from the repetitive learning required for certain subjects to enabling students to be creative in their use of technology. A  set of digital tools, well used, will, however, enable students to go through the various stages of the substitution &#8211; augmentation &#8211; modification &#8211; redefinition model. The use of tablets and modern computers enable students to undertake the redefinition aspect with a lot more ease than before. More importantly technology enables students to engage in collaborative learning which enables them to share good practice and receive peer review for what they produce. This is very much in line with their understanding of the use of technology in their everyday lives through social networking and messaging services. My belief is that if we can use technology in a similar way to students use outside school we can offer them  a huge boost to their performance in the classroom.<\/p>\n<p>My skills are:<br \/>\nCommunications at all levels, motivating, encouraging, coaching, training and development, influencing, conflict management, identifying individuals’ strengths, facilitator and builds trust, leadership, performance management.<br \/>\nStrategic vision, ideas development, forward planning, research, analysis and evaluation, problem solving and resolution, creative, change management, creating new opportunities.<\/p>\n<p>Some of my relevant projects  are:<br \/>\nInvestigating e-learning in a school radio station project<br \/>\nWorking withe GTC as an e-facilitator for their online forums<br \/>\nTechnology roadshows for schools<br \/>\nWorking with schools to help develop their use of the creative tools on Apple Mac computers.<\/p>\n<p><a href=\"http:\/\/www.trainingtothefull.com\/Trainingtothefull\/Updates\/Updates.html\">www.trainingtothefull.com\/Trainingtothefull\/Updates\/Updates.html<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>My approach to teaching and learning is based on what I have learnt from practical teaching in the classroom and in independent schools.  I am keen to develop the instinctive feel for teaching that is not always encouraged by chasing &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/david-fuller\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"parent":14,"menu_order":6,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/138"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=138"}],"version-history":[{"count":22,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/138\/revisions"}],"predecessor-version":[{"id":1526,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/138\/revisions\/1526"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/14"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=138"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}