{"id":1653,"date":"2014-04-11T10:16:55","date_gmt":"2014-04-11T10:16:55","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=1653"},"modified":"2014-11-23T17:01:01","modified_gmt":"2014-11-23T17:01:01","slug":"the-team","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/","title":{"rendered":"Core team"},"content":{"rendered":"<h2>Ros Asher<\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/Ros-asher.jpg\"><img loading=\"lazy\" class=\"alignleft  wp-image-1812\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/Ros-asher-300x261.jpg\" alt=\"Ros asher\" width=\"203\" height=\"176\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/Ros-asher-300x261.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/Ros-asher.jpg 485w\" sizes=\"(max-width: 203px) 100vw, 203px\" \/><\/a>Ros works with organisations to develop creative approaches that can improve learning, performance and life chances. Before becoming free-lance, Ros was an Education Director and Project Director at Partnerships for Schools, the company set up to deliver the UK’s Building Schools for The Future programme, where she led the ‘Leading Learning’ programme. She has been a Children’s Services Improvement Adviser at the Department for Education, a Local Authority Chief Officer with responsibility for school improvement, development, inclusion and arts services, and an education adviser in four local authorities. Extensive teaching experience covers a range of schools, colleges, higher education and other education settings. She has worked with public, private, third sector and education industry partners, contributed to BBC and Channel 4 music education projects, and been a visiting university lecturer and external examiner.<\/p>\n<p>Contributions to conferences and training in Europe and the USA include sessions on leadership, creativity, change management, improving learning, curriculum development, music and the arts. Ros’s work with voluntary, community and charitable organisations focuses on increasing educational impact. She was Chair of Trustees for WebPlay and is a Trustee with icould, both organisations incorporating innovative use of ICT to inspire learners. She was a founder Trustee of ‘Music for Life’ a programme now run by the Wigmore Hall and Dementia UK, is a Trustee of the New Mozart Orchestra, and a member of the Cultural Learning Alliance steering group, which champions the power of high quality arts and cultural education for all learners.<\/p>\n<h2>Patricia Charlton<\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/Patricia-Charlton.jpg\"><img loading=\"lazy\" class=\"alignleft size-full wp-image-1822\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/Patricia-Charlton.jpg\" alt=\"Patricia Charlton\" width=\"233\" height=\"225\" \/><\/a>Dr. Patricia Charlton is a researcher on artificial intelligence, cognitive science and technology-enhanced learning.  She is the author of several papers on artificial intelligence, education, ubiquitous computing and intelligent context-aware designs.<br \/>She is currently working with teachers, students, researchers and industry to bring a broader understanding of the importance in how and why to teach and learn about computational thinking, computer science and technology enhanced learning. She also continues her research development into the design of knowledge co-construction systems using computational reflection and meta-level inferencing techniques thus enabling learning analytics in context. Her key interests are in creativity and deep learning that brings both the science and arts together.<\/p>\n<p>Patricia is a part-time researcher at the Knowledge Lab (LKL), Institute of Education, University of London. She heads the <em>What the Research Says<\/em> seminars for education and industry partnership at LKL with MirandaNet support.<\/p>\n<h2> <\/h2>\n<h2> <\/h2>\n<h2>Adrian Hall<\/h2>\n<p><!--EndFragment--><\/p>\n<p> With a thorough understanding of the way educational and broader government policy works Adrian is an international keynote speaker. He has been a policy maker in the UK Government and is a member of Project Inkwell a US Think Tank looking at 1:1 access for students.<\/p>\n<p>Skills include: <br \/> · Wide ranging experience on the development of government level policy and strategy, as well as business strategy.<br \/> · Considerable writing experience from policy documents, parliamentary questions and presentations to writing for publication.<br \/> · Ability to conceptualise and develop innovative market-changing products and services<br \/> · Capacity to build relationships across government and the commercial sector<br \/> · International company representation and business development<br \/> · Identifying new business and policy opportunities<br style=\"font-size: 12pt;\" \/> <\/p>\n<h2 dir=\"ltr\">Francis Howlett<\/h2>\n<div id=\"attachment_319\" style=\"width: 220px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/francis.jpg\"><img aria-describedby=\"caption-attachment-319\" loading=\"lazy\" class=\" wp-image-319\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/francis.jpg\" alt=\"MirandaNet Web Editor\" width=\"210\" height=\"268\" \/><\/a><p id=\"caption-attachment-319\" class=\"wp-caption-text\">MirandaNet Web Editor<\/p><\/div>\n<p>Francis Howlett has been the MirandaNet Web Editor for over fifteen years. He has a background in Education as a Modern Foreign Languages and later Information Technology teacher, followed by a spell as an Advisory Teacher and then managing projects at NCET\/Becta. Since leaving Becta he has worked freelance for a number of educational organisations. Much of his current work is divided between maintaining and developing web sites, and translating learned documents and press releases into English.<\/p>\n<h2> <\/h2>\n<p> Read more <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/francis-howlett\/\"><strong><span style=\"color: #ff0000;\">here<\/span><\/strong><\/a><\/p>\n<h2> <\/h2>\n<h2> <\/h2>\n<h2> <\/h2>\n<h2> <\/h2>\n<h2>Theo Kuechel<\/h2>\n<p dir=\"ltr\"> <\/p>\n<p dir=\"ltr\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/polario.jpg\"><img loading=\"lazy\" class=\"alignleft size-medium wp-image-1494\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/polario-272x300.jpg\" alt=\"polario\" width=\"272\" height=\"300\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/polario-272x300.jpg 272w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/polario.jpg 579w\" sizes=\"(max-width: 272px) 100vw, 272px\" \/><\/a>Theo Kuechel is a MirandaNet Senior Fellow developing MirandaNet’s social media presence and the MirandaMod events. He has been a partner on national and international projects on digital content and video He is a consultant and researcher having with experience of  developing  and teaching courses in digital media at the University of Hull and NAACE. He has been a partner on national and international projects on digital content and video with JISC, QIA and the EdutubePlus project funded under EU eContentplus. Within the UK he has undertaken research for BECTA and VITAL, (Open University), and the University of Hull. Theo was recently invited to work in Qatar advising ICT Qatar on Qatar’s strategy for digital content.  Currently, Theo is working in the EU LLL HandsOn project in which MirandaNet is a partner.<\/p>\n<p dir=\"ltr\">Theo’s research covers digital literacies, social media and learning ecosystems. His expertise is harnessing (Open) digital content, archives and resources for learning, OERs and online video in education. He has specialist knowledge of Copyright in education including Creative Commons and he has given presentations and workshops on these topics in UK, Ireland, Czech Republic, France, Austria, United Sates, Romania, Belgium, Qatar and Greece.<\/p>\n<h2 dir=\"ltr\">Jan Lepeltak<\/h2>\n<p dir=\"ltr\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/jan-sr-door-tonny.jpg\"><img loading=\"lazy\" class=\"alignleft  wp-image-1856\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/jan-sr-door-tonny-300x225.jpg\" alt=\"jan sr door tonny\" width=\"416\" height=\"312\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/jan-sr-door-tonny-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/jan-sr-door-tonny.jpg 320w\" sizes=\"(max-width: 416px) 100vw, 416px\" \/><\/a>Jan was was a senior curriculum developer for ICT at the National Institute for Curriculum Development SLO in Enschede and a professor at the NHL-University of applied science in Leeuwarden (the Netherlands) at the Institute for Education and Communication. For almost 20 years he was editor-in-chief of a Dutch monthly educational magazine on educational technology (COS) and still writes about ICT in several magazines and national newspapers. In 2013 he was a member of the National Organizing Committee of the WorldRoboCup Junior games 2013 in Eindhoven. He is also a representative of NGI (the Netherlands Association for Informatics) in the EU education network CEPIS in Brussels. He is a Senior MirandaNet Fellow and has participated since 1992 in the network. He gave in 2014 several keynotes in conferences about social media, coding and education.<br \/>As a freelance consultant Jan continues to do research and development in new pedagogies and ICT. His projects include: e-learning; using social media in small schools; action research; and language development enhanced with ICT. He works as an independent consultant and is founder of <a href=\"http:\/\/www.learningfocus.nl\">LearningFocus<\/a>. <\/p>\n<h2> <\/h2>\n<h2>Ian Lynch<\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/Ian1.jpg\"><img loading=\"lazy\" class=\"alignleft  wp-image-1501\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/Ian1-243x300.jpg\" alt=\"SAMSUNG\" width=\"171\" height=\"211\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/Ian1-243x300.jpg 243w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/Ian1-829x1024.jpg 829w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/Ian1.jpg 1320w\" sizes=\"(max-width: 171px) 100vw, 171px\" \/><\/a>Ian Lynch, is  Senior MirandaNet Fellow, and has contributed his wide experience of project administration as well as improving the accreditation available to teachers who undertake MirandaNet projects.  Ian Lynch is responsible for the development of a governance policy  for the HandsOn  project and the sustainability strategy as well as assisting with links to EU policy and personnel and financial management. He uses his extensive networks in order to disseminate the project.<\/p>\n<p>Ian has experience as an assessor of the national professional qualification for headteachers, as a Registered Inspector (OFSTED) and Chief Assessor at The Learning Machine Ltd (Ofqual accredited awarding organisation) He is a member of the Senior Leadership Team that set up the first UK City Technology College, government flagship school for technology.<\/p>\n<p>Ian  has successfully managed two LDV TOI projects each scoring 80% in final evaluation. Contributed to writing proposals for 6 successful TOI project applications, experience with two Comenius and one Grundtvig projects. His specific expertise is  in curriculum design, assessment, EQF, ECVET, EQARF, Open Source Software communities and business models to support OER. He has  won DTi Smart Award for software development and Midlands Small Business of the Year Award with commendation for financial management.<\/p>\n<p>Ian designed the assessment structure for the <a href=\"http:\/\/www.modbac.info\/overview\/%20\">ModBac<\/a> and provided the certification support technology for the new Duke of York’s Award for STEM subjects.<\/p>\n<h2>Christina Preston<\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/smallchristina-copy.jpg\"><img loading=\"lazy\" class=\"alignleft size-full wp-image-1466\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/smallchristina-copy.jpg\" alt=\"smallchristina copy\" width=\"200\" height=\"275\" \/><\/a><span style=\"font-family: Calibri,Verdana,Helvetica,Arial;\"><span style=\"font-size: 11pt;\">Christina has been at the forefront of education and technology for over 25 years. She started MirandaNet in 1992 to research and advise clients in the impact of technology and learning. The company has become a global thought leader with over 1,000 members in 80 countries. Knowledge sharing and creation and managing the change process to ensure impact is at the core of MirandaNet’s philosophy. A full programme of events is held in partnership with the London Knowledge Lab, Institute of Education. As Professor of Educational Innovation, Christina also advises the Future Learning Centre at the University of Bedfordshire.<\/span><\/span><\/p>\n<p>She is also the Chair of Trustees of World Ecitizens charity established by the MirandaNet Fellows in 2002 after the events of 9\/11 in New York. This charity provides a web space where learners across the world can publish for an international audience: for more <a href=\"http:\/\/http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/)\">information<\/a>.<\/p>\n<h2> <\/h2>\n<h2> <\/h2>\n<h2>Joanna Wild<\/h2>\n<p> <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/me.jpg\"><img loading=\"lazy\" class=\"alignleft size-full wp-image-1824\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2014\/04\/me.jpg\" alt=\"me\" width=\"273\" height=\"294\" \/><\/a>Joanna Wild is digital experience and evaluation consultant and researcher. Currently she works on two projects: 1) ESRC- KEO funded ‘<a href=\"http:\/\/buildingcommunityknowledge.wordpress.com\/build-community-knowledge\/\">Building Community Knowledge<\/a>‘ project led by Diana Laurillard from the Institute of Education. University of London, and 2) JISC-funded <a href=\"http:\/\/digitalstudent.jiscinvolve.org\/wp\/\">Digital Student study<\/a>.<\/p>\n<p>From 2010 to 2013 Joanna was researcher attached to the <a href=\"http:\/\/blogs.it.ox.ac.uk\/eet\/about\/\">Academic IT Education Enhancement Team<\/a> at the University of Oxford.  She has worked in a number of JISC-, HEA-, and ESRC-funded projects in the field of TEL, specialising in digital experience research and evaluation, learning design (<a href=\"https:\/\/sites.google.com\/a\/lkl.ac.uk\/ldse\/\">LDSE project<\/a>), Open Educational Resources (<a href=\"http:\/\/bit.ly\/Lajesu\">OER Impact Study<\/a>), Open Practice (<a href=\"http:\/\/bit.ly\/UEcbPi\">OER Engagement Study<\/a>) and Open Access (<a href=\"http:\/\/openaccess.ox.ac.uk\/\">Open Access at Oxford<\/a>).  <\/p>\n<p>Before joining Academic IT Services she worked first as e-learning course designer and staff developer at the <a href=\"http:\/\/www.cel.agh.edu.pl\/english\/english\/\">Centre of e-Learning<\/a> of AGH-University of Science and Technology in Krakow, and then as scientific project manager and educational researcher in the Technology &amp; Knowlege Unit at the <a href=\"https:\/\/www.zsi.at\/\">Centre for Social Innovation<\/a> researching in several TEL projects funded by EC FP7 and Lifelong Learning Programme. Joanna tweets as <a href=\"https:\/\/twitter.com\/askawild\">@askawild<\/a><\/p>\n<p>&nbsp;<\/p>\n<h2>Dr Sarah Younie<\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/IMG_8204_web.jpg\"><img loading=\"lazy\" class=\"alignleft size-medium wp-image-1499\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/IMG_8204_web-199x300.jpg\" alt=\"IMG_8204_web\" width=\"199\" height=\"300\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/IMG_8204_web-199x300.jpg 199w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/IMG_8204_web-681x1024.jpg 681w\" sizes=\"(max-width: 199px) 100vw, 199px\" \/><\/a>Dr Sarah Younie, Research and Innovation Director,  is a MirandaNet Senior Fellow and has bought her significant research experience to MirandaNet Projects over many years. She is currently working on several research project with MirandaNet associates including the EU LLL HandsOn project.<\/p>\n<p>Sarah  has been involved in international research on educational technologies and teaching for twenty five years. She has been involved in the use of digital technologies in educational settings for UNESCO, the EU, UK Government Agencies, Local Authorities, educational charities and other funders. She has worked as a teacher and researcher in secondary schools, universities and as UK Chair of the national subject association of IT in Teacher Education (ITTE) she has conducted  research, including gathering evidence for the Parliamentary Select Committee Inquiry into Education.<\/p>\n<p>Sarah is also  a visiting Senior Research Fellow at University of Bedfordshire and Principal Lecturer at De Montfort University, where she is  Programme leader for the MA in Education Practice. She has published widely on educational technologies and is the Associate Editor-in-Chief for the international Journal of Technology, Pedagogy and Education. Dr Younie’s latest book published by the Open University Press is entitled ‘Teaching with Technology: the essential guide’. Dr Younie is afounder member of MESH (Mapping Education Specialist knowhow) and is the Editor-in-Chief of the MESHguides for ICT.<\/p>\n<h2>Sanaa Nusrat<\/h2>\n<p>Personal assistant: organising and running meetings and events, managing the accounts, liaising between members of staff and clients, data collection for research projects, dealing with the unexpected.<\/p>\n<p>&nbsp;<\/p>\n<h2> The Consultancy Team<\/h2>\n<p>The MirandaNet consultancy can call on the skills and talents of our 1,00 plus members from 80 countries who work as full time or part-time consultants on specific projects. Practising teachers and senior managers also join MirandaNet projects as co-researchers and\/or action researchers as means of gaining up to date professional development that informs their current practices. The presence of practising professionals ensure the authenticity of MirandaNet research findings and case studies that are all available to the wider profession. The MirandaNet consultancy team, drawn from MirandaNet Fellows, have worked together on many research, development and dissemination projects since 1992 funded by companies, international government agencies, professional organisations and charities.We also have many Senior Fellows, often independent consultants, who join us in projects that are relevant to their interests. The list is <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/consultants\/\">here<\/a>.<\/p>\n<h2 class=\"MsoNormal\">The advisers<\/h2>\n<p>MirandaNet can also draw on members who are internationally expert. Their advise is greatly valued. The list is <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/team\/advisors\/\">here.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ros Asher Ros works with organisations to develop creative approaches that can improve learning, performance and life chances. Before becoming free-lance, Ros was an Education Director and Project Director at Partnerships for Schools, the company set up to deliver the &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"parent":0,"menu_order":15,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1653"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=1653"}],"version-history":[{"count":34,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1653\/revisions"}],"predecessor-version":[{"id":1893,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1653\/revisions\/1893"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=1653"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}