{"id":1801,"date":"2014-05-31T15:28:36","date_gmt":"2014-05-31T15:28:36","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=1801"},"modified":"2015-05-21T18:56:37","modified_gmt":"2015-05-21T18:56:37","slug":"1801-2","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/asssociate-events-2\/1801-2\/","title":{"rendered":"Associates news"},"content":{"rendered":"<h2>IRIS Connect<\/h2>\n<h4><strong>powerful CPD through video and web based tools<\/strong><\/h4>\n<p>IRIS Connect is innovative and unique.  IRIS Connect evolved from research into what actually works to improve outcomes for pupils and put the teacher at the centre of CPD and school improvement by empowering them to develop their own practice and that of their colleagues.<\/p>\n<p>By fusing a unique blend of a web based platform and exceptionally versatile video camera systems, IRIS  Connect has developed a collaborative CPD tool that enables teachers to reflect on, analyse and share teaching practice.<\/p>\n<p>The IRIS Connect web environment is highly secure and teacher friendly.  The flexibility of the system means that, if required, you can even provide live in-ear coaching from within the school, or even another school, through the remotely controlled camera system.<\/p>\n<p>IRIS Connect enables:<\/p>\n<ul>\n<li>Self and peer review<\/li>\n<li>Lesson observation and feedback<\/li>\n<li>Coaching and mentoring<\/li>\n<li>Evidence based objective review and evaluation<\/li>\n<li>Research and action research<\/li>\n<li>Real time, in-ear coaching<\/li>\n<li>Building and sharing libraries of best practice within and across schools.<\/li>\n<\/ul>\n<p>The IRIS Connect team has a clear understanding of the ‘theory to practice’ of professional development.  From the ground up, IRIS Connect was developed to enable those key interactions which help both teachers and schools move to excellence.  IRIS Connect was built to support the development of a trust based learning community with exceptionally high levels of security and teacher permissioning which, together with leadership from school managers, minimises the tensions inherent in using video technology.<\/p>\n<p>IRIS Connect is based at the Innovations Centre, University of Sussex, and is a rapidly growing community in over 400 schools, colleges and Universities in England and a growing number in Australia, USA and Europe.<\/p>\n<p>For more information, please look at our <a href=\"www.irisconnect.co.uk\">website<\/a> or phone us on 0853 038 578<\/p>\n<h2>Follett<\/h2>\n<p>Follett helps educate 35,000,0000 students in 148 countries by providing schools with innovative education and technology solutions.  The 5<sup>th<\/sup> generation family business was founded in 1873 and has evolved from a textbook distribution company to an industry leading education technology solutions provider.  Follett supports student achievement through school and library management systems, learning platforms, as well as print and eContent for libraries and classrooms supporting both international curricula.  And it’s all connected through a powerful MIS solution!<\/p>\n<p>Educators around the world are choosing Follett’s Aspen MIS to power their school because it’s not just an MIS but also a fully integrated learning platform.  The Web-based, flexible system allows everyone in the school ecosystem to be connected through one easy to use platform designed to use data to identify student needs and map the appropriate digital content to improve student achievement.<\/p>\n<p>For teaching and learning Aspen blends the national curriculum, programs of study and standards into the school’s timetable and planning structures, allowing teachers to build and personalise the curriculum for their classes. By adding the ability to then drag and drop resources onto the timetable, teachers can create assignments and activities for students. Teachers can create a sophisticated Page to support learning through the delivery of resources, such as web links, blogs and wikis and a range of other interactive widgets that can simply be dragged onto a class dashboard.<\/p>\n<p>Tim Morton, the Network Administrator at the RSA Academy in the UK says he chose Aspen because it is more than a MIS, “At the moment the fact that you’ve got your MIS and learning platform wrapped up into one product. Also that you can mould the products to do anything you want to do. So anyone that’s excited about educating their students and want to think differently should consider Aspen as an MIS system.”<\/p>\n<p>Explore what we do on our <a href=\"http:\/\/www.follettsoftware.com\/school-administration-software\">website.<\/a><\/p>\n<h2>Group Call<\/h2>\n<p>Groupcall who arranged the MirandaNet interview with <a href=\"http:\/\/www.mirandanet.org.uk\">Sir Bob Geldof <\/a>supply Apps, communication software and data extraction tools to the Education, Public, and Business sectors.<\/p>\n<p><a href=\"http:\/\/www.groupcall.com\">Group Call<\/a> have submitted some interesting case studies:<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/spring-newsletter\/associates-news\/central-bedfordshire-council\/\" rel=\"attachment wp-att-4184\">Central Bedfordshire Council<\/a><\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/spring-newsletter\/associates-news\/stoke-dameral-emerge\/\" rel=\"attachment wp-att-4182\">Stoke Dameral &#8211; Emerge<\/a><\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/spring-newsletter\/associates-news\/warriner-231210\/\" rel=\"attachment wp-att-4183\">Warriner <\/a><\/p>\n<h2>LightSpeed<\/h2>\n<p>Roger Turner, LightSpeed, has brought a new clarity to MirandaMods with their sounds systems. The research about children who simply cannot hear most of what is happening in the classroom is compelling. Once you read the findings it is hard to understand why more is not made of this.<\/p>\n<p>Like many of our associates, Roger has had many roles in education as a music teacher, senior lecturer in music education, local authority advisor, chief inspector and assistant director of education. As he explains,<\/p>\n<p>&#8220;In all that time I remained unaware of the critical importance of ensuring excellent speech intelligibility for all students. Since becoming an education consultant and researcher for Lightspeed Technologies, a major developer and manufacturer of classroom audio distribution (CAD) systems, I have come to understand the serious disadvantage students and teachers experience when working in classrooms with unsatisfactory acoustics.<br \/> CAD systems spread the voice of the teacher evenly around a classroom at a level (+15-20db) to overcome the problems of excessive reverberation and internal and external noise polution. Students need a considerably stronger signal than adults if they are to hear, understand and remember what is being said as they do not have the fully developed cognitive skills or vocabulary to &#8216;fill in the gaps&#8217; when they fail to hear words. My own research has resulted in my understanding the many benefits acrrued from the installation of CAD technology.<\/p>\n<p>My reason for wishing to be a member of MirandaNet is to be part of a community passionate about investigating, understanding and disseminating the benefits technology can bring to education&#8221;.<\/p>\n<p>Members can all have access to this equipment to try it out. I have been amazed at the difference these inobstrusive mics make to my hearing. Ask Roger for more information: mailto: &#114;&#x6f;&#103;&#x65;&#114;&#x40;&#114;&#x64;t&#x63;o&#x6e;s&#x75;l&#116;&#x61;&#110;&#x63;&#121;&#x2e;&#99;&#x6f;&#109;<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/spring-newsletter\/associates-news\/pilot-study-card\/\" rel=\"attachment wp-att-4185\">Pilot Study Card<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>IRIS Connect powerful CPD through video and web based tools IRIS Connect is innovative and unique.  IRIS Connect evolved from research into what actually works to improve outcomes for pupils and put the teacher at the centre of CPD and &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/asssociate-events-2\/1801-2\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"parent":1898,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1801"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=1801"}],"version-history":[{"count":4,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1801\/revisions"}],"predecessor-version":[{"id":2052,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1801\/revisions\/2052"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1898"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=1801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}