{"id":2,"date":"2011-04-11T20:35:09","date_gmt":"2011-04-11T20:35:09","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy_new\/?page_id=2"},"modified":"2014-11-23T16:58:38","modified_gmt":"2014-11-23T16:58:38","slug":"about-us","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"<p>Since 1992, the MirandaNet consultancy team, drawn from nearly 1,000 members of the <a href=\"\/fellowship\/\">MirandaNet Fellowship<\/a> in more than 80 countries have worked together on many research, evaluation, professional development and dissemination projects funded by companies, international government agencies, professional organisations and charities. MirandaNet consultants are experts in the use of digital technologies to enhance teaching and learning and as a catalyst in the management of change.<\/p>\n<p>MirandaNet consultants  have nearly twenty five years experience in:<\/p>\n<ul>\n<li><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/publications\/\">research<\/a>,<\/li>\n<li><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/core-products\/\">evaluating digital projects<\/a>,<\/li>\n<li><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/professional-development-programmes\/\">professional development,<\/a><\/li>\n<li><a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">running events<\/a><\/li>\n<li><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/associates\/\">working with companies on projects that raise their profile in the education market<\/a>.<\/li>\n<\/ul>\n<p><strong>A channel to market<\/strong><\/p>\n<p>The MirandaNet Fellowship provides a <strong>cost-effective marketing channel<\/strong> for targeting influencers and taste makers in schools as well as at local, national and international level. The website is well indexed and features prominently in Google searches.<\/p>\n<p>The site is well patronised and <strong>on average 6,000 unique visitors arrive each month<\/strong>. Visitors read up to 11 pages.<\/p>\n<p>Key news and information about free events reaches a further audience of about 5,000 professionals in professional groups like ITTE, Naace, ICTRN, BCS, IFIT, UNESCO and several University Special Interest Groups including the National Association of Professors that meets in the House of Lords. This provides a broad and targeted outreach for research findings.<\/p>\n<h3><strong>Events, conferences and unconferences<\/strong><\/h3>\n<p><strong>MirandaMods<\/strong><br \/> Companies are invited to participate in the programme of events and conference run by MirandaNet each year. One distinctive model where a company representative can join in debates with educators is the MirandaMod. This is an informal, loosely structured unconference of like-minded educators who share ideas about the use of technology to inspire others. The MirandMod is often a  fringe event following or attached to a formal MirandaNet seminar\/workshop or meeting. There is often  an International dimension to this event when as many as forty members join on line.  A transcript of the meeting is published as well as a collaborative digital map that is authored by the participants and provides a resource of the latest information on the subject in hand. Resources can be found under <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMods<\/a>. Recent MirandaMods have been held at the BETT show, the Education Show, CAL11 and at a technologies conference at Korinthos in Greece. MirandaMods  can be held to explore the value of a range of technologies, their impact in the classroom and the theories about teaching and learning that are generated by their use.<\/p>\n<p><strong>Innovative formats for research findings<\/strong><\/p>\n<p>Some research is just published as a report and an article is sent to appropriate publications. But we also offer more unique ways of spreading the message about products and services. e.g.<\/p>\n<ul>\n<li>Videos on U-Tube: talking heads, interviews, demos;<\/li>\n<li>Dissemination through articles in the journals of professional organisations;<\/li>\n<li>Building a following in Facebook, Twitter, Education Communities, Linked In;<\/li>\n<li>International events at conferences: drinks receptions, symposia, workshops, papers, stands;<\/li>\n<li>MirandaNet newsletter and website;<\/li>\n<li>emailings to membership and friends.<div id=\"attachment_1159\" style=\"width: 310px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_1215.jpg\"><img aria-describedby=\"caption-attachment-1159\" loading=\"lazy\" class=\"size-medium wp-image-1159\" title=\"IMG_1215\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_1215-300x225.jpg\" alt=\"\" width=\"300\" height=\"225\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_1215-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_1215-1024x768.jpg 1024w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_1215.jpg 2048w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><p id=\"caption-attachment-1159\" class=\"wp-caption-text\">Learning in India<\/p><\/div><\/li>\n<\/ul>\n<p><strong>Articles by Professor Preston<\/strong><\/p>\n<p>Dr Christina Preston, the founder and managing director also publishes in the internal professional journals of these groups as well as in the Times Higher, the Times Educational Supplement and the UK quality national newspapers. Her pieces are also syndicated in Holland and Russia. Members also boast a long list of research publications that have been funded by companies, by government agencies and by charities (<a href=\"..\/..\/publications\/\">www.mirandanet.org.uk\/publications<\/a>). The research is highly respected because practitioners are involved as co-researchers carrying out investigations of products in the classroom and in staff training programmes.MirandaNet also lead in the use of innovative research methods like collaborative digital mapping and critical incident research.<\/p>\n<p><strong> Marketing at conferences<\/strong><\/p>\n<p>MirandaNet Senior Fellows give keynotes and papers at international conferences throughout the year. In 2010, for example, MirandaNet associates were mentioned at conferences in nine countries where there are members: Australia, England, France, Greece, India, Japan, Portugal, New Zealand, USA. EMAP also offers international marketing when companies support the events that the Fellows run over the four days of the BETT show and the three days of the Education Show. In 2012 these events will be attended by about 700 educators, not counting participants who make a virtual appearance. The Fellowship activity has been supported in the past by small companies like 2Simple and Inspiration and by multinationals like Apple, Toshiba, Hewlett Packard, Microsoft, Steljes and Oracle (<a href=\"..\/..\/partners\/\">www.mirandanet.org.uk\/partners<\/a>).<\/p>\n<p>The MirandaNet Consultancy offers a variety of standard and bespoke Associateship Support Packages designed to accommodate the different needs of our clients. If you are an individual, a school, a regional group or any other group with an interest in innovative research and continuing professional development please contact <a href=\"&#109;&#x61;&#105;&#x6c;&#116;&#x6f;&#58;&#x63;&#104;&#x72;&#105;&#x73;t&#x69;n&#x61;&#64;&#x6d;i&#x72;a&#x6e;d&#97;&#x6e;&#101;&#x74;&#46;&#x61;&#99;&#x2e;&#117;&#x6b;\">Dr Christina Preston<\/a>.<\/p>\n<p><a href=\"\/ejournals\/\">Ejournals<\/a><br \/> <a href=\"\/publications\/\">Publications<\/a><br \/> <a href=\"\/research\/\">Case studies and research<\/a><br \/> <a href=\"\/news\/letter.php\">Newsletter<\/a><\/p>\n<p><strong>A range of projects<br \/> <\/strong><\/p>\n<p>MirandaNet consultants have led research, curriculum exchanges, professional development and teacher mentoring using a professional development programme called<a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/professional-development-programmes\/\"><strong> iCatalyst<\/strong><\/a> that focuses on change management through action research.<\/p>\n<p>Based on years of research, MirandaNet consultants have developed bespoke iCatalyst programmes with educators in Bulgaria, China, Chile, Czech Republic, England, Friesland, India, Mexico, Saudi Arabia, South Africa and Syria. Associate companies who have supported action research in schools are 2Simple, Apple, Microsoft, Inspiration, Promethean, Oracle, Steljes and Tribal.<\/p>\n<p>Under the leadership of the <a title=\"Core Team\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/core-team\/\">Core Team<\/a>, the Consultancy is supported in its work by a team of <a title=\"Consultants\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/consultants\/\">Consultants<\/a>, <a title=\"Advisers\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/advisors\/\">Advisers<\/a> and <a title=\"Associates\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/associates\/\">Associates<\/a>.<\/p>\n<p>Look at the associates&#8217; proposition to decide how you would like to work with us <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/associates\/\">here<\/a>.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since 1992, the MirandaNet consultancy team, drawn from nearly 1,000 members of the MirandaNet Fellowship in more than 80 countries have worked together on many research, evaluation, professional development and dissemination projects funded by companies, international government agencies, professional organisations &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":10,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/2"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=2"}],"version-history":[{"count":76,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/2\/revisions"}],"predecessor-version":[{"id":2011,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/2\/revisions\/2011"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=2"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}