{"id":238,"date":"2011-04-25T18:13:57","date_gmt":"2011-04-25T18:13:57","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=238"},"modified":"2014-11-22T20:48:17","modified_gmt":"2014-11-22T20:48:17","slug":"professional-development-programmes","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/joining-as-a-associate-20142015\/professional-development-programmes\/","title":{"rendered":"Professional Development"},"content":{"rendered":"<h2><strong>iCatalyst programme<\/strong><\/h2>\n<p><strong><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/professional-development-programmes\/icatalyst-logo\/\" rel=\"attachment wp-att-239\"><img loading=\"lazy\" class=\"size-medium wp-image-239 alignright\" title=\"Educators mentoring educators\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/iCatalyst-logo-300x123.jpg\" alt=\"\" width=\"300\" height=\"123\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/iCatalyst-logo-300x123.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/iCatalyst-logo.jpg 671w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/strong><\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/profdev\/\">iCatalyst<\/a> is an innovative Continuing Professional Development (CPD) programme, developed by the <a href=\"http:\/\/www.mirandanet.org.uk\/fellowship\/\">MirandaNet Fellowship<\/a>, that is relevant to the whole workforce. It is based on <a href=\"http:\/\/www.mirandanet.org.uk\/publications\/\">research<\/a> that MirandaNet Fellows have undertaken into CPD in digital technologies since 2004 and focuses on the educators taking ownership of change through action research and collaborative decision making.<\/p>\n<p>Bespoke course can be run as one day events or modules that last one term or one year.  This way of working is  particularly valuable in helping a group of professionals to reflect on changes that they wish to make to their working practices. Members of the group can make different decisions about whether they want to work towards accreditation or not. If they decide on accreditation they are mentored in deciding the level of accreditation that will be most appropriate.<\/p>\n<p>This approach to CPD is supported by the first UK Department of Education research report, <em><a href=\"http:\/\/www.education.gov.uk\/publications\/standard\/publicationdetail\/page1\/DFE-00564-2010\">The Case for Change<\/a>,<\/em> that draws on international practice in CPD. In this context iCatalyst programmes have been developed with MirandaNet chapters in China, Czech Republic, England, India, Mexico and South Africa. iCatalyst participants have access to each other across national boundaries and to the range of experience in the MirandaNet Fellowship.<\/p>\n<p>At the core of this model is:<\/p>\n<ul>\n<li>a mixed-methods or blended learning programme which provides mentoring and resources to scaffold learning about subjects that are relevant to the challenges in schools;<\/li>\n<li>personalised programmes negotiated by the educators based upon their own practice and the vision of their institution. Several staff members may work together;<\/li>\n<li>the use of online digital technologies to maximise flexibility of where and when the programme is accessed and what kinds of knowledge creation can be achieved;<\/li>\n<li>the development of a sustainable Knowledge Hub where all resources developed are made available to the community of practice and where new knowledge and evidence-based theory can be created as a result;<\/li>\n<li>a choice for educators in the ways in which they wish to be assessed as well as the mode in which they want to present their assignments;<\/li>\n<li>the creation of mature sustainable e-communities of practice where views and knowledge both of teachers and of students, can be shared to the benefit of all;<\/li>\n<li>access to professionals in other national and international communities of practice through the MirandaNet Fellowship.<\/li>\n<\/ul>\n<p>Potential project foci identified by stakeholders in consultation:<\/p>\n<ul>\n<li>whole or cluster school improvement;<\/li>\n<li>change management, including impacts on and changes for the workforce;<\/li>\n<li>implementation of changes to the curriculum agreed by the teachers;<\/li>\n<li>improved teacher engagement and extending learning and facilities with the community;<\/li>\n<li>the use of technology as an enabler of personalisation, communication and collaboration.<\/li>\n<\/ul>\n<p>MirandaNet Fellows have developed this management of change programme in partnership with universities, colleges, schools, regional groups and clusters in England and abroad, and often as courses in which senior Fellows mentor teachers who are less experienced. The programme is always modified for the groups who are commissioning the courses. New subjects are added as the demand arises. Case studies are peer reviewed by Fellows and published in the MirandaNet Braided Learning Ejournal.<\/p>\n<p>All enquiries can be made <a href=\"..\/..\/contact.htm\">by using our contact form<\/a>.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>iCatalyst programme iCatalyst is an innovative Continuing Professional Development (CPD) programme, developed by the MirandaNet Fellowship, that is relevant to the whole workforce. It is based on research that MirandaNet Fellows have undertaken into CPD in digital technologies since 2004 &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/joining-as-a-associate-20142015\/professional-development-programmes\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":239,"parent":1537,"menu_order":4,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/238"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=238"}],"version-history":[{"count":80,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/238\/revisions"}],"predecessor-version":[{"id":242,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/238\/revisions\/242"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1537"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media\/239"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=238"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}