{"id":250,"date":"2011-04-25T21:30:31","date_gmt":"2011-04-25T21:30:31","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=250"},"modified":"2014-02-24T10:16:54","modified_gmt":"2014-02-24T10:16:54","slug":"allison-allen","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/allison-allen\/","title":{"rendered":"Allison Allen"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-549\" title=\"AllisonAllen\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/AllisonAllen1.jpg\" width=\"108\" height=\"129\" \/>Allison Allen is Director of Outstream Consulting, Alumna of the Institute of Education, University of London and of the University of Newcastle upon Tyne (Education Department) and a Trustee of the Board of Management of Naace, which she represents in areas such as the Children, Schools and Families Standing Committee Curriculum review.<\/p>\n<p>She taught in schools as Head of Department and ICT Coordinator before joining the Local Authority as senior ICT Adviser in School Improvement and becoming a director of the London Grid for Learning and Chair of the pan-London Teaching and Learning action group as part of a DfE\/Becta\/LGfL\/London Challenge initiative “London Learning through ICT” (L2tICT).  Subsequently Allison joined Becta as the London Regional Manager working with all 33 LAs, the range of schools and supporting the Leading Leaders Network, SLICT and leading and facilitating national conferences.  Later she worked for Tribal as the ICT Education managing consultant, leading on ICT vision and transformation.   As one of only 22 national Lead ICT Mark assessors and e-Safety (e-Safeguarding) specialist, she is a keynote speaker and offers consultation support to schools and local authorities as well as assessment of schools.<\/p>\n<p>Allison has a well-rounded background in school improvement, change management and organisational development, government, local government, regional broadband consortia and learning platforms, visioning, procurement, CPD, e-safety, professional development, transformational ICT and project management with a track record of swiftly transforming failing school departments to outstanding, achieving results in the top five percentile.<\/p>\n<p>She is an experienced coach mentor with a strong background in change management and curriculum development working with individuals, groups and teams and believes that it is critical to schools that good practice and innovative activities are shared across the landscape; the acquisition of such knowledge should not simply rest lie in report data banks and celebration of good practice is of significant value in raising the aspirations of education institutions.<\/p>\n<p>Allison achieved a Graduate Certificate in Education Leadership Development and Consultancy in 2005, drawing on and developing skills in training, professional dialogue in the context of change and continuous improvement to leaders and managers of in all aspects of education in the UK and abroad.    In March 2011 she was accredited with theCertified Naace Professional (CNP) Level 7 award.<\/p>\n<p><strong>Publications include:<\/strong><\/p>\n<ul>\n<li>The ICT CPD Landscape in England: N. Pachler, C. Preston, J. Cuthell and A. Allen (Becta 2010; published <a href=\"http:\/\/dera.ioe.ac.uk\/1769\/\">http:\/\/dera.ioe.ac.uk\/1769\/<\/a> )<\/li>\n<li>E-safety guidance for the FE &amp; Skills Sector: A. Allen, M. Payton, C. Preston and S. Pickering (Becta 2009; published http:\/\/tinyurl.com\/esafety-FE-Skills-outstream)<\/li>\n<li>Through the Looking Glass (and What Alice Found There) &#8211; e-Safety concepts and misconceptions: A Allen (ICT Skills Briefing, Issue 14, 2009): (also MirandaMod 2009)<\/li>\n<li>New professional cultures: braided gatherings in The Third Space: Collaboration \/ MirandaNet<\/li>\n<li>Butterflies for the Use of ICT (DFES\/London Challenge\/LGfL): Collaboration Chair<\/li>\n<li>Achieving Excellence &#8211; LGfL and the Becta Self Review Framework: (DFES\/Croydon Council\/LGfL\/Outstream) Collaboration Chair<\/li>\n<\/ul>\n<p><strong>Specialisms in keywords<\/strong><br \/>\nRegional broadband consortia, learning platforms, government, local government, BSF, Academies, ICT visioning, procurement, school improvement, e-safety, professional development, transformational ICT, project management, learning styles, emotional intelligence, organisational and relationship management, teamwork and collaboration, “inspirational leadership”, change catalyst, programme development\/implementation, keynote\/executive presentations, impartiality, objectivity and independence, independent learners.<\/p>\n<p>Allison has an unparalleled track record of client satisfaction from work for central government and its agencies, local authorities, schools and the commercial and  technology sectors.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Allison Allen is Director of Outstream Consulting, Alumna of the Institute of Education, University of London and of the University of Newcastle upon Tyne (Education Department) and a Trustee of the Board of Management of Naace, which she represents in areas &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/allison-allen\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"parent":14,"menu_order":1,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/250"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=250"}],"version-history":[{"count":30,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/250\/revisions"}],"predecessor-version":[{"id":1521,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/250\/revisions\/1521"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/14"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=250"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}