{"id":27,"date":"2011-04-12T13:02:59","date_gmt":"2011-04-12T13:02:59","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy_new\/?page_id=27"},"modified":"2015-04-01T18:58:29","modified_gmt":"2015-04-01T18:58:29","slug":"associates","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/joining-as-a-associate-20142015\/associates\/","title":{"rendered":"Associate packages"},"content":{"rendered":"<div id=\"attachment_1162\" style=\"width: 414px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/05India.jpg\"><img aria-describedby=\"caption-attachment-1162\" loading=\"lazy\" class=\" wp-image-1162\" title=\"05India\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/05India-300x225.jpg\" alt=\"\" width=\"404\" height=\"303\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/05India-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/05India-1024x768.jpg 1024w\" sizes=\"(max-width: 404px) 100vw, 404px\" \/><\/a><p id=\"caption-attachment-1162\" class=\"wp-caption-text\">Girls education in India<\/p><\/div>\n<p><strong>ANNUAL ASSOCIATESHIP PACKAGES  2015-2016 <\/strong><\/p>\n<p>The MirandaNet Fellowship international network is a professional organisation. In networking with MirandaNet scholars as well as associate companies the members gain new knowledge and experience about services and products that are important in improving teaching, learning and administration.<\/p>\n<p>Associates can learn more about the education market and build up a network of advocates by joining as a scholar like the <a href=\"http:\/\/www.mirandanet.org.uk\/fellowship\/\">educators<\/a>. Company colleagues can engage in the debates on mirandalink, work on MirandaNet professional development programmes and also gain accreditation for their work with MirandaNet educators.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>This menu of MirandaNet services below is costed for each associate according to their requirements:<\/p>\n<ul>\n<li>your company  logo featured on the MirandaNet associate&#8217;s page with a landing page about your services and products;<\/li>\n<li>a fully branded company  page in the Associates section profiling your products and services to our global membership and networks;<\/li>\n<li>access to marketing through the EU education website with HandsON ICT project;<\/li>\n<li>access to our detailed web statistics;<\/li>\n<li>links to your web site;<\/li>\n<li>access to members&#8217; contact details in accordance with an agreement on how and why members should be contacted in a professional organisation;<\/li>\n<li>opportunities to post to discussions on mirandalink;<\/li>\n<li>opportunity to publish company representatives profile;<\/li>\n<li>access to the members&#8217; archive of mirandalink debates;<\/li>\n<li>leading debates on mirandalink on topics related to your product or services;<\/li>\n<li>the permissions to  upload case studies;<\/li>\n<li>entries within the MirandaNet newsletter focused on good practice, product launches and free opportunities for members;<\/li>\n<li>inclusion and citations in collaborative advice to governments;<\/li>\n<li>advice on publishing articles for the international press and professional journals;<\/li>\n<li>advice on accreditation at certificate, diploma and Masters level for company representatives working with professionals on projects:<\/li>\n<li>MirandaNet accreditation for products and services;<\/li>\n<li>representation in global conference presentations made by MirandaNet members ;<\/li>\n<li>setting up MirandaNet chapters for teachers who buy your product or service;<\/li>\n<li>accrediting teachers who use your product or service;<\/li>\n<li>the opportunity to join a MirandaNet funding consortium in order to partner bid proposals to the EU, charities, government agencies, funding bodies like JISC, ESRC and the British Council;<\/li>\n<li>using World Ecitizens (wec.mirandanet.org.uk) as a publishing area for learners who use your product or service;<\/li>\n<li>quotations for: writing articles, setting up, resourcing and publishing a MirandaNet survey; action research projects; a workshop or accredited training programme and\/or a MirandaMod for dissemination; joining MirandaNet at BETT and other exhibitions; sponsoring a MirandaMod topic; and, bespoke projects.<\/li>\n<\/ul>\n<p>At cost<\/p>\n<ul>\n<li>invitations to networking and strategy dinners;<\/li>\n<li>invitations to professional workshops on associate matters.<\/li>\n<\/ul>\n<h2>Research for companies<\/h2>\n<p>The MirandaNet team can partner companies in several ways that help  to market  the company:<\/p>\n<ul>\n<li>Understanding the service or product, researching existing information  and  reporting on the current situation in the education market;<\/li>\n<li>Developing questionnaires with companies, setting them up, analysing and reporting on quantitative results;<\/li>\n<li>Organising and running focus groups, collating the results and publishing them;<\/li>\n<li>Undertaking face to face, phone or interent interview with users of products and services for research  reports:<\/li>\n<li>Developing programmes to provide quantitative research data with built in benefits for the company in terms of professional engagement and marketing copy as well as benefits to the professional in terms of professional growth that can be accreditated.<\/li>\n<li>Suggesting development of existing markets and stimulation of new markets;<\/li>\n<\/ul>\n<h2>Marketing<\/h2>\n<p>In terms of marketing companies can disseminate through MirandaNet channels like professional journals and newsletter and closed emails lists. We can produce a range of different outputs to include:<\/p>\n<ul>\n<li>Writing article for different audiences;<\/li>\n<li>Advising on video marketing and other social media:<\/li>\n<li>Writing a MESH pathway for global publication for educators<\/li>\n<li>Writing an academic paper for conference presentation and Powerpoint presentations<\/li>\n<li>Organising, running and streaming a MirandaMod at a conference and mounting video on U-Tube<\/li>\n<\/ul>\n<p><strong>The team<\/strong><\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/smallchristina-copy.jpg\"><img loading=\"lazy\" class=\"wp-image-1230 alignright\" title=\"smallchristina copy\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/smallchristina-copy.jpg\" alt=\"\" width=\"164\" height=\"226\" \/><\/a>Dr Christina Preston, Professor of Educational Innovation at Bedfordshire University, who founded MirandaNet in 1992, draws on a team that is chosen from a wide range of MirandaNet Fellows.  She can include associates in relevant  publications in internal professional journals as in the UK Nationals, the Times Higher, the Times Educational Supplement and the UK quality national newspapers. Her pieces are also syndicated in Holland and Russia. She is a BETT judge and has recently won the Naace Lifetime Achievement Award.<\/p>\n<p><strong>Contact Christina for more details about MirandaNet Associateships and fee scales as well as bespoke packages to suit company needs: <\/strong><\/p>\n<p><strong>&#x63;&#x68;&#x72;&#x69;&#x73;&#x74;&#x69;&#x6e;&#x61;&#x40;&#x6d;&#x69;&#x72;&#x61;&#x6e;&#x64;&#x61;&#x6e;&#x65;&#x74;&#x2e;&#x61;&#x63;&#x2e;&#x75;&#x6b;<\/strong><\/p>\n<p>More about Christina Preston <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/\">here<\/a>.<\/p>\n<p>Read our testimonials <span style=\"color: #ff0000;\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/testimonials\/\"><span style=\"color: #ff0000;\">here<\/span><\/a><\/span><\/p>\n<h2>Further information<\/h2>\n<p>The following section provides more information about;<\/p>\n<ul>\n<li>Becoming a MirandaNet Associate;<\/li>\n<li>Associates&#8217; channel to market;<\/li>\n<li>Marketing outlets<\/li>\n<li>Marketing associates at conferences<\/li>\n<li>Networking opportunities;<\/li>\n<li>Initiating research projects<\/li>\n<\/ul>\n<h3><strong>Becoming a MirandaNet Associate<\/strong><\/h3>\n<p>Since 1992 MirandaNet has worked in associateship with a range of small and medium companies as well as key multinationals in educational technologies. We like to involve our company associates in our events as equal partners in the exchange of information.  Face to face and online conferences and seminars provide a valuable showcase for products and services and research projects develop the relationships between developers and educators to mutual benefit.<\/p>\n<p>Networking and dissemination opportunities can be as frequent as our associates wish as they have equal opportunities to plan the MirandaNet programmes and topics for  professional knowledge exchange. Our remit is wider in 2013\/2014\/2015 because we are also working with our partners in an EU project called HandsOn taking place in Greece, Slovenia, Spain and The Netherlands.<\/p>\n<div id=\"attachment_1163\" style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/04Conference.jpg\"><img aria-describedby=\"caption-attachment-1163\" loading=\"lazy\" class=\"size-medium wp-image-1163\" title=\"04Conference\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/04Conference-300x225.jpg\" alt=\"\" width=\"300\" height=\"225\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/04Conference-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/04Conference-1024x768.jpg 1024w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/04Conference.jpg 2048w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><p id=\"caption-attachment-1163\" class=\"wp-caption-text\">Colleagues at SITE conference, San Diego<\/p><\/div>\n<p>All our associates&#8217; logos will be on the leaflets, press releases and web spaces as well as  opportunities to speak at these events. Other kinds of sponsorship might be drinks receptions, conference bags, pull-ups and leaflet distribution.  We welcome copy in our quarterly newsletter and our associate companies are mentioned in Fellows&#8217; UK based and international speaking tours which in 2013\/14 will be in Australia, Bulgaria, China, Czech Republic, New Zealand, Poland, Spain, Slovenia and the Netherlands.<\/p>\n<p>MirandaNet consultants are keen to partner proposals that are underway and we offer partnerships in proposals we are planning. We also invite associates to join us when we are commissioned to do research, development and dissemination projects by  international government agencies and charities.<\/p>\n<p>We have long associations with many of our associates and hold quarterly networking dinners. Some company colleagues have been awarded a MirandaNet Fellowship for the programmes they have designed with us and others follow other accredited programmes as part of the associateship.<\/p>\n<h3><strong><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Friends-in-Riyadh.jpg\"><img loading=\"lazy\" class=\"alignleft  wp-image-1240\" title=\"Friends in Riyadh\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Friends-in-Riyadh-300x225.jpg\" alt=\"\" width=\"248\" height=\"186\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Friends-in-Riyadh-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Friends-in-Riyadh-1024x768.jpg 1024w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Friends-in-Riyadh.jpg 2048w\" sizes=\"(max-width: 248px) 100vw, 248px\" \/><\/a>Associates&#8217; channel to market<\/strong><\/h3>\n<p>The MirandaNet Fellowship is a portal to market with nearly 800 members in 80 countries. The website, the internal debating spaces and newsletter provide a cost effective marketing channel for targeting influencers and taste makers in schools as well as at local, national and international level. The membership includes teachers, senior managers, advisers, teacher educators, researchers and policy makers who are often account holders.  MirandaNet Fellows  have an influential voice at national level on issues concerning digital technologies and meet regularly with government Think Tanks and key members of government as well as important figures in the research field and teacher education, many of whom are members of MirandaNet. We are also well connected with influential national organisations in the use of digital technologies in education such as ITTE, Naace, ICTRN, BCS, IFIT, UNESCO and several University Special Interest Groups.<\/p>\n<p>The website is well indexed and features prominently in Google searches. The site is well patronised and on average 1,300 pages are viewed each day. In detail, during 2012 the MirandaNet site had almost 68,000 unique visitors, with an average of 2 visits each, downloading slightly less than 7.5 pages per visit. In addition, web crawlers visited the site almost 1.8 million times, with an average of 13.5 hits per visit – which is one reason that MirandaNet appears high in most web searches of ICT, education, curriculum change and teacher CPD.<\/p>\n<h3><strong>Marketing outlets<\/strong><\/h3>\n<div id=\"attachment_1231\" style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Swanns.jpg\"><img aria-describedby=\"caption-attachment-1231\" loading=\"lazy\" class=\"size-medium wp-image-1231 \" title=\"Swanns\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Swanns-300x300.jpg\" alt=\"\" width=\"300\" height=\"300\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Swanns-300x300.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Swanns-150x150.jpg 150w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Swanns.jpg 450w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><p id=\"caption-attachment-1231\" class=\"wp-caption-text\">University of Bedfordshire<\/p><\/div>\n<p>When Associates join us we tease out answers to questions our members and networks want to know:<\/p>\n<ul>\n<li>What makes your product different and innovative? Why is it newsworthy?<\/li>\n<li>What are the key outcomes\/products\/artefacts that can we refer people to?<\/li>\n<li>When will the main products be available and what interim steps can be seen?<\/li>\n<li>What are the key messages to disseminate to the teachers and mentors who we ask to pilot this?<\/li>\n<li>What are the key messages to disseminate to the general audience?<\/li>\n<li>What research can you refer to about your product?<\/li>\n<li>Is the research robust? Can a MirandaNet study help you here?<\/li>\n<\/ul>\n<p>Once we have agreed these answers we then work out the best ways to disseminate your message by reaching parts that others cannot reach! MirandaNet has access to educators&#8217; networks that are often closed or just unknown to companies.<\/p>\n<p>Some of the channels we use are:<\/p>\n<ul>\n<li><strong>Video pills.<\/strong>  Videos by teachers about your product are a good idea as a medium for dissemination. In fact planning videos describing the project story boarding and a very clear idea of the key messages will be a good exercise. But it is very important to concentrate at this stage  on the messages for the whole project e.g. what is the product focus.You Tube might be a good for disseminating videos but you need high number of views in order to get them a profile. There are now other systems than Youtube which is blocked in most school in the UK.<\/li>\n<li><strong>Blogs<\/strong> &#8211; Amongst the MirandaNet membership are some  bloggers are always needs contributions from ALL partners not just the UK. Need each partner&#8217;s project story, interests and expertise but needs to be in blog style not academic papers. In interesting blog would be  the reason for chosing the MOOC package once this decision is taken<\/li>\n<li><strong>Mirandalink<\/strong> all associates have access to the MirandaNet internal debating listserv which is active and informative. Sometimes articles can be written from members reactions to debating questions.<\/li>\n<li><strong>The newsletter<\/strong>. All Associates can supply at least three stores a year with links, promote offers and ask for educators to test their product<\/li>\n<li><strong>Links to and from the MirandaNet website<\/strong>. Associates can have a page on our website where they introduce themselves or a page on their website to which Miranda can link.<\/li>\n<li><strong>Networks<\/strong> &#8211; Associates are invited into networks of educators as the opportunities appear.<\/li>\n<li><strong>Press releases and news stories<\/strong>&#8211; MirandaNet can publish press releases and news stories in various forms.<\/li>\n<li><strong>Social networking<\/strong> &#8211; Miranda has a Face book presence and a Twitter feed<\/li>\n<li><strong>Affinity marketing<\/strong> – we can advise associates on seeking similar projects or innovations that are complementary to Handson and use them as vectors for SUSTAINED dissemination. This relates back to WP6. A teacher professional  qualification in using ICT creatively to support their work would be a specific reason for teachers to participate and then disseminate what Handson is about through their networks.<\/li>\n<li><strong>Journal articles and avertorials on other dissemination websites<\/strong><\/li>\n<\/ul>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Canal-boat-2.jpg\"><img loading=\"lazy\" class=\"wp-image-1241 alignright\" title=\"Canal boat 2\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Canal-boat-2-225x300.jpg\" alt=\"\" width=\"185\" height=\"246\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Canal-boat-2-225x300.jpg 225w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Canal-boat-2-768x1024.jpg 768w\" sizes=\"(max-width: 185px) 100vw, 185px\" \/><\/a><\/p>\n<h3><strong>Marketing associates at conferences<\/strong><\/h3>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/team\/\">MirandaNet Senior Fellows<\/a> give keynotes and papers at international conferences throughout the year. in 2013 we will be presenting in Australia, Catalonia, Poland, Slovenia and New Zealand. This Fellowship activity has been supported in the past by small and medium sized companies like 2Simple and Inspiration and by multinationals like Apple, Toshiba, Steljes and Oracle. Over the years many companies have undertaken a range of projects as listed below.<\/p>\n<p>Our conference events in 2013\/2014\/2015 <strong><br \/> <\/strong><\/p>\n<ul>\n<li>Symposium and poster session at the 10th IFIP World Conference on Computers in Education: <a href=\"http:\/\/wcce2013.umk.pl\/\">WCCE13<\/a> Torun, Poland, July 2-5, 2013<\/li>\n<li>3 Symposia and a MirandaMod at Teacher Educators in IT <a href=\"http:\/\/www.itte.org.uk\/\">(ITTE)<\/a>, Bedford, 8, 9,10th July 2013, University of Bedfordshire;<\/li>\n<li>Keynote, <em>The development of IT courses with international partners<\/em>&#8211; <em>especially the design and implementation of the K-12 IT courses<\/em>. Annual conference Committee of Information Technology Education in K-12,  National Educational Technology Society,  Shenyang, China, July 28th  to July 30th 2013;<\/li>\n<li>Innovation Forum: European Foundation for Quality in Elearning (<a href=\"http:\/\/efquel.org\/\">EFQUEL)<\/a> September 25th -27th Barcelona;<\/li>\n<li>Keynotes on research into Digital Technologies at Naace conferences: &amp;th November Nottingham, 14th November, Bury<\/li>\n<li>Keynote in Slovenia November (details to Follow)<\/li>\n<li>MirandaMods and presentations in the MirandaNet Lounge, <a href=\"http:\/\/www.bettshow.com\/\">BETT14<\/a>, Excel Centre, London 22nd &#8211; 25th January  2014;<\/li>\n<li>Keynote and MirandaMod, <a href=\"http:\/\/educationinnovation.co.uk\/cms\/\">Education Innovation Show<\/a>, Manchester 8-9th March 2014;<\/li>\n<li>Annual Teacher Educators in IT <a href=\"http:\/\/www.itte.org.uk\/\">(ITTE)<\/a>, July 2014 (place and dates to be confirmed)<\/li>\n<li>MirandaNet Lounge, BETT15, Excel Centre, London, January(dates to be confirmed)<\/li>\n<\/ul>\n<div id=\"attachment_1164\" style=\"width: 310px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/06-New-Zealand.jpg\"><img aria-describedby=\"caption-attachment-1164\" loading=\"lazy\" class=\"size-medium wp-image-1164 \" title=\"06 New Zealand\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/06-New-Zealand-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/06-New-Zealand-300x200.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/06-New-Zealand-1024x682.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><p id=\"caption-attachment-1164\" class=\"wp-caption-text\">Working with teachers in New Zealand<\/p><\/div>\n<p><strong>Professional development<\/strong><\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/profdev\/\">iCatalyst<\/a> is an innovative Continuing Professional Development (CPD) programme, developed by the <a href=\"http:\/\/www.mirandanet.org.uk\/fellowship\/\">MirandaNet Fellowship<\/a>, that is relevant to the whole workforce.<\/p>\n<p>It is based on <a href=\"http:\/\/www.mirandanet.org.uk\/publications\/\">research<\/a> that MirandaNet Fellows have undertaken into CPD in digital technologies since 2004 and focuses on the educators taking ownership of change through action research and collaborative decision making.<\/p>\n<p>This can be customised to give companies valuable feedback on their products or services. You can read more about the programme <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/professional-development-programmes\/\">here. <\/a><\/p>\n<h3><strong>Initiating research<\/strong><\/h3>\n<p>Many companies over the years have asked MirandaNet Fellows to scope a research project that will help them learn more about their product and services as well as developing credibility in the market place. Web questionnaires carefully designed can provide businesses with relevant research data relating to the actual use of your products and services by practitioners. Focus groups and case studies can range from projects that take about 20 days to projects lasting a year or two and involving many teachers as co-researchers.We are happy to quote for budgets large and small.<\/p>\n<p>Publications can be found <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/\">here.<\/a><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_0446.jpg\"><img loading=\"lazy\" class=\"alignright size-medium wp-image-1243\" title=\"IMG_0446\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_0446-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_0446-225x300.jpg 225w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_0446-768x1024.jpg 768w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/IMG_0446.jpg 1200w\" sizes=\"(max-width: 225px) 100vw, 225px\" \/><\/a><\/p>\n<h3><strong>Other services for discussion<\/strong><\/h3>\n<ul>\n<li>Representation at the full international <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMod programme<\/a> throughout the year<\/li>\n<li>Update reports about educational reforms and ICT programmes across the globe<\/li>\n<li>Business and schools networking throughout the year<\/li>\n<li>Opportunities to contribute to MirandaNet responses to Government policy and consultation documents<\/li>\n<li>Chances to publish in the MirandaNet e-journals<\/li>\n<li>Access to debate and opportunities to share ideas and issues with MirandaNet members who are often account holders<\/li>\n<li>Logo, promotional materials, lead speaking places at all MirandaMods<\/li>\n<li>Logo contained within all MirandaNet promotional material also including company references within relevant presentations and publications.<\/li>\n<\/ul>\n<p><strong>Bespoke Associateship packages <\/strong><\/p>\n<p>In addition to our standard packages we also offer bespoke packages to our partners.  These are made from a selection of our most popular services and dependent on individual discussion of requirements and marketing targets:<\/p>\n<ul>\n<li>Supervising an accredited Certificate, Masters or Doctoral programme at the University of Bedfordshire for company representatives and groups of teachers selected by the company;<\/li>\n<li>Booking training rooms and conference halls at a discount;<\/li>\n<li>Developing and writing up reports and case studies on the uses of products and services in education;<\/li>\n<li>Hosting of a seminar \/ focus meeting on a key topic of your choice;<\/li>\n<li>Hosting networking suppers and private dinners<\/li>\n<\/ul>\n<p><strong>Bespoke consultancy services<\/strong><\/p>\n<p><strong><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/DSC01449.jpg\"><img loading=\"lazy\" class=\"alignleft  wp-image-1244\" title=\"DSC01449\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/DSC01449-300x225.jpg\" alt=\"\" width=\"140\" height=\"104\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/DSC01449-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/DSC01449-1024x768.jpg 1024w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/DSC01449.jpg 2048w\" sizes=\"(max-width: 140px) 100vw, 140px\" \/><\/a><\/strong><\/p>\n<p>Many more of our services are listed on the website but here are a few:<\/p>\n<ul>\n<li>Product evaluation, development and marketing for the education market<\/li>\n<li>Designing and creating websites for communities<\/li>\n<li>Facilitating and advising on optimization of approach to the education marketplace<\/li>\n<li>Evaluating and accrediting tailored professional development programmes for the workforce to embed systemic change<\/li>\n<li>Business interpretation of key policy consultations and white papers<\/li>\n<li>Assessment, understanding of government initiatives and how to work together in a smarter way and to the greater good of the community<\/li>\n<li>Building collaborative community knowledge and creating theory online with direct focus on your products and services<\/li>\n<li>Optimising use of learning platforms<\/li>\n<li>Evaluating ICT CPD programmes against the school’s targets<\/li>\n<\/ul>\n<h2><strong>Project design<\/strong><\/h2>\n<h3>Below is a comprehensive list of the kind of projects MirandaNet consultants undertake.<\/h3>\n<p><strong>Research and Development<\/strong><br \/> Industry, Government and education research partnership<br \/> ICT professional development and training models<br \/> Data collection and analysis<br \/> Case studies and interviews<br \/> Product investigation and development<\/p>\n<p><strong>Web-based Ideas<\/strong><br \/> Dynamic Web Environments for international, national and local web-based learning communities<br \/> Use of elearning for the conflict resolution, problem solving, thinking skills and international citizenship<br \/> Developing ebooks and expert knowledge bases<\/p>\n<p><strong>Change Management and Leadership Programmes<\/strong><br \/> Planning and negotiation<br \/> Implementation<br \/> Dissemination<br \/> Accreditation<br \/> Evaluation<\/p>\n<p><strong>Organising Seminars, Forums, Focus Groups, Conference and Training Programmes<\/strong> (face to face and online)<br \/> Planning, organisation<br \/> Programme development<br \/> Dissemination<br \/> Running related courses<\/p>\n<p><strong>Papers, ebooks and online Publication<\/strong>s<br \/> Finding appropriate publishers<br \/> Joint authoring<br \/> Web versions of paper publications<br \/> Camera ready copy<br \/> Publicity and conference papers<\/p>\n<h3> Go back to the associates page <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/joining-as-a-associate-20142015\/\">here.<\/a><\/h3>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>ANNUAL ASSOCIATESHIP PACKAGES  2015-2016 The MirandaNet Fellowship international network is a professional organisation. In networking with MirandaNet scholars as well as associate companies the members gain new knowledge and experience about services and products that are important in improving teaching, &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/joining-as-a-associate-20142015\/associates\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":1537,"menu_order":2,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/27"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=27"}],"version-history":[{"count":171,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/27\/revisions"}],"predecessor-version":[{"id":2044,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/27\/revisions\/2044"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1537"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=27"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}