{"id":360,"date":"2011-04-27T11:45:27","date_gmt":"2011-04-27T11:45:27","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=360"},"modified":"2015-05-24T08:49:01","modified_gmt":"2015-05-24T08:49:01","slug":"dr-gaynor-sharp","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/dr-gaynor-sharp\/","title":{"rendered":"Gaynor Sharp"},"content":{"rendered":"<div id=\"attachment_571\" style=\"width: 310px\" class=\"wp-caption alignright\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/team\/consultants\/dr-gaynor-sharp\/gaynor\/\" rel=\"attachment wp-att-571\"><img aria-describedby=\"caption-attachment-571\" loading=\"lazy\" class=\"size-medium wp-image-571\" title=\"Dr Gaynor Sharp\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Gaynor-300x225.jpg\" alt=\"Dr Gaynor Sharp\" width=\"300\" height=\"225\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Gaynor-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Gaynor-1024x768.jpg 1024w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/Gaynor.jpg 2048w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><p id=\"caption-attachment-571\" class=\"wp-caption-text\">Dr Gaynor Sharp<\/p><\/div>\n<p>Dr Gaynor Sharp is an independent education consultant in many fields of education including science, philosophy for children, mentoring beginning science and mathematics teachers and working to inspire excellence in school science through the Association for Science Education. In order to do this Gaynor has organised numerous teacher events focusing on a broad range of issues, for example transition, formative assessment, creativity in school science, equality and diversity, How Science Works and so on. The workshops are presented as a response to teacher requests and the workshops help to inspire teachers to be creative and challenging to learners in a constructive and meaningful manner.<\/p>\n<p>Gaynor has been involved the OU PGCE course since 2002 in a variety of roles including: tutoring PGCE students and their mentors in science education; visiting PGCE students in schools; briefing mentors and school co-ordinators in schools and interviewing potential PGCE students and assessing their suitability for a career in teaching. Gaynor is a Chartered Science teacher.<\/p>\n<p>Gaynor worked at Becta for five years until it closed in March 2011. The work was focused on managing school based qualitative research projects. One of her final pieces of research was focused on Narrowing the Gap for Low and Underachieving learners. This year long project explored both achievement gap for low achievers as well as for those learners who were not working at their full potential (the ‘coasters and some Gifted and Talented students). The report was presented together with many multimedia resources illustrating how effective technology could be in supporting these groups of learners. There is a case study of this project in the <a href=\"http:\/\/www.mirandanet.org.uk\/casestudies\/9\">Mirandanet archive<\/a>.<\/p>\n<p>Previous to these experiences Gaynor lectured biomolecular science at University and before that taught science in comprehensive schools. In her role as teacher she was actively engaged in Equal Opportunities programmes both across school and within the science departments. She also worked for a charity for five years supporting learners with Moderate Learning Difficulties and their families. She understood the importance of engaging parents in the educational process and liaised closely with 4 special schools, their teachers, pupils and parents. During this time Gaynor completed a Master’s degree focused on learning and inclusivity in the curriculum In 2004 Gaynor completed her doctoral thesis on pupil’s attitudes to their school science experiences and this as one of the early ventures into learner voice, about science, educational research.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dr Gaynor Sharp is an independent education consultant in many fields of education including science, philosophy for children, mentoring beginning science and mathematics teachers and working to inspire excellence in school science through the Association for Science Education. In order &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/dr-gaynor-sharp\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"parent":14,"menu_order":10,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/360"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=360"}],"version-history":[{"count":18,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/360\/revisions"}],"predecessor-version":[{"id":2055,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/360\/revisions\/2055"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/14"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=360"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}