{"id":47,"date":"2011-04-12T13:22:35","date_gmt":"2011-04-12T13:22:35","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy_new\/?page_id=47"},"modified":"2014-06-23T21:19:12","modified_gmt":"2014-06-23T21:19:12","slug":"francis-howlett","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/francis-howlett\/","title":{"rendered":"Francis Howlett"},"content":{"rendered":"<p>Website: <a href=\"http:\/\/www.aldermary.com\">www.aldermary.com<\/a><\/p>\n<p><a href=\"#p\">Personal Statement<\/a> | <a href=\"#i\">ICT Details<\/a> | <a href=\"#r\">Recent Projects<\/a> | <a href=\"#c\">Case Histories<\/a><br \/> <a name=\"p\"><\/a><\/p>\n<p><strong><em>Personal Statement<\/em><\/strong><\/p>\n<div id=\"attachment_324\" style=\"width: 80px\" class=\"wp-caption alignright\"><img aria-describedby=\"caption-attachment-324\" loading=\"lazy\" class=\"size-full wp-image-324\" title=\"Francis Howlett\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/francis1.jpg\" alt=\"Francis Howlett\" width=\"70\" height=\"90\" \/><p id=\"caption-attachment-324\" class=\"wp-caption-text\">MirandaNet Editor<\/p><\/div>\n<p>A former teacher and then advisory teacher for Modern Languages and IT, I worked for many years at NCET\/Becta. I was responsible for the management and assessment of IT across the curriculum. Later I was in charge of NCET&#8217;s Evidence Strand, with an interest in research evidence on the impact of IT in teaching and learning. This led to involvement in a variety of evaluations including the Portables Project, CD-ROMs in Primary Schools, and Integrated Learning Systems. For some time I worked part time at The Learning Circuit, University of Surrey, Roehampton, supporting schools in Southwest London. Since then I have been involved in a wide variety of projects including Becta&#8217;s Test Bed, and supporting Lewisham PDC and Sage Educational Trust. Most of my time these days is spent on supporting web-based projects.<\/p>\n<p>I am also the MirandaNet Editor.<\/p>\n<p><a name=\"i\"><\/a><\/p>\n<p><strong><em>ICT Interests<\/em><\/strong><\/p>\n<p>Supporting ICT in teaching and learning. Supporting on-line learning through Talent NOF Training (and LSP NOF Training). Editing web sites. From Commordore PET through BBC B, BBC Master, Amstrad PCW, Archimedes, PCs. Most standard packages. Some programming work. Some html. Taught Computer Studies, and Computer Science (GCSE, Alevel), also GCSE Information Technology. Despite being slightly pointy-headed, I hope I am overwhelmingly a user rather than a tweaker, but I must confess to taking a delight in solving intractable web coding problems, and in making websites standards-compliant and, I hope, accessible.<\/p>\n<p>Occasionally I&#8217;m asked why a &#8216;mere&#8217; languages teacher should get so interested in computers. I guess it&#8217;s in the blood: you might like to look at an article I wrote on MirandaNet about my father&#8217;s experiences with early computers: <a href=\"\/pubs\/computing_history.htm\">Vannevar Bush, Douglas Hartree, Jack Howlett (<em>and did Watson of IBM really say that the world would only need five computers?<\/em><\/a>)<\/p>\n<p><a name=\"r\"><\/a><\/p>\n<p><strong><em>Recent Projects<\/em><\/strong><\/p>\n<p>The Learning Circuit was one of the early adopters of Think.com, with its innovative New Generation Audiences project. I am very interested in ways of using the Internet and Conferencing to support learners and learning. I believe that careful use of the Internet can lead to a revolution in the delivery of teaching and learning materials, and in the interactive exploitation of those materials. I also believe that this revolution will not happen on its own &#8211; we must determine ourselves how we are to promote this exciting medium.<\/p>\n<p>As for web work, MirandaNet is an interesting case. Since I took over as the editor, there has been a revolution in the way that web pages are designed, with HTML primarily used to hold the content, and all the styling issues carried by CSS, the style sheets. MirandaNet was an early user of stylesheets, but even so I eventually re-wrote every single page to remove all the tables and deprecated tags, and to bring the site steadily up to modern standards-compliant coding and to make it more accessible. I&#8217;d love to hear from anyone who has any comments on this last point, as I can only work at text-book level on accessibility, and need the feedback from those for whom the accessibility standards have been developed to say whether or not I have achieved my goal.<\/p>\n<p><a name=\"c\"><\/a><\/p>\n<p><strong><em>Case Histories<\/em><\/strong><\/p>\n<p>My personal web site (<a href=\"http:\/\/www.aldermary.com\/\">www.aldermary.com<\/a>) contains a selection of sites that I have worked on, and can be seen as a case study. The oldest sites, such as Talent, are written in the most terrible of old-fashioned table-based font-tag-ridden code, without proper headers, full of deprecated features, largely provided by courtesy of Claris Home Page, and a wonder that they work at all. Others are in XHTML, fully compliant, and achieve level AAA of the Web Access Initiative.<\/p>\n<p>My greatest pride is in the MirandaNet site, with its extraordinary range of content, and its equally amazing range of technical features using HTML, CSS, PHP, Perl, JavaScript and MySQL, and for whose structure and layout faults I take all the blame.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Website: www.aldermary.com Personal Statement | ICT Details | Recent Projects | Case Histories Personal Statement A former teacher and then advisory teacher for Modern Languages and IT, I worked for many years at NCET\/Becta. I was responsible for the management &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/francis-howlett\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":1653,"menu_order":5,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/47"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=47"}],"version-history":[{"count":18,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/47\/revisions"}],"predecessor-version":[{"id":1833,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/47\/revisions\/1833"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/1653"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=47"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}