{"id":76,"date":"2011-04-12T15:26:55","date_gmt":"2011-04-12T15:26:55","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=76"},"modified":"2014-02-24T10:15:05","modified_gmt":"2014-02-24T10:15:05","slug":"richard-allen","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/richard-allen\/","title":{"rendered":"Richard Allen"},"content":{"rendered":"<p>Richard has a background of business management in international hi-tech industries, business school senior lecturer, teacher training and consultancy to government, local authorities and schools. He is a specialist in education transformation and learning services, and an experienced educator to Masters level.<\/p>\n<p>Richard has written, delivered and assessed HE courses from foundation to masters on Managing Business Processes, Operations Management, Total Quality Management, Environmental Management and EU Environmental Legislation. He has particular experience in education advising on the use of Investment Planning tools and sustainability for technology (ICT) in education. Richard has organised and led capital program visioning events for wide ranging stakeholders, introducing tools such as the Self Review Framework and ICT Design Quality Indicators as a precursor to developing outstanding and coherent visions. He is fully familiar with all the elements of capital program ICT Consultancy covering Education, Technical and Procurement.<\/p>\n<p>As a specialist consultant to Becta for Learning Services Richard advised Local Authorities across England on the procurement and implementation of Learning Platforms to transform teaching and learning. In his work as a trainer in one London Authority he trained over 1000 staff in their implementation and use, including developing the architecture of their use to introduce &#8220;paperless&#8221; communication between authority and schools.  He was recently contracted to York as Managing Consultant for their procurement of authority wide learning services for all schools at all phases.<\/p>\n<p><a href=\"http:\/\/www.outstream.co.uk\/\"><img loading=\"lazy\" class=\"alignright size-full wp-image-559\" title=\"Outstream Consulting\" alt=\"Outstream Consulting\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/outstream_logo_small.jpg\" width=\"200\" height=\"133\" \/><\/a>Richard is one of a small community of highly experienced accredited lead assessors for the ICT Mark, having engaged with schools using the Self Review Framework as both consultant and assessor since its pilot and inception in 2005. He is involved in the training and accreditation of assessors nationally and has been contracted by the DCSF to work with challenged schools (&#8220;Keys to success schools&#8221;) in London and to explore with their Senior Leadership how better deployment of technology in learning, teaching and school operations can deliver operational benefits and diminish burdens. As a teacher trainer and educator he is engaging and successful, with consistently high evaluation scores. Richard is the founder and director of <a href=\"http:\/\/www.outstream.co.uk\/\">Outstream Limited<\/a><\/p>\n<p>Richard has an unparalled track record of client satisfaction from work for central government and its agencies, local authorities, schools and the commercial and technology sectors.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Richard has a background of business management in international hi-tech industries, business school senior lecturer, teacher training and consultancy to government, local authorities and schools. He is a specialist in education transformation and learning services, and an experienced educator to &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/richard-allen\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":14,"menu_order":1,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/76"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=76"}],"version-history":[{"count":18,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/76\/revisions"}],"predecessor-version":[{"id":1519,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/76\/revisions\/1519"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/14"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=76"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}