{"id":78,"date":"2011-04-12T15:27:14","date_gmt":"2011-04-12T15:27:14","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=78"},"modified":"2014-02-24T10:22:39","modified_gmt":"2014-02-24T10:22:39","slug":"terry-freedman","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/terry-freedman\/","title":{"rendered":"Terry Freedman"},"content":{"rendered":"<div id=\"attachment_125\" style=\"width: 160px\" class=\"wp-caption alignright\"><a rel=\"attachment wp-att-125\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/consultants\/terry-freedman\/terryfreedman2011b-m\/\"><img aria-describedby=\"caption-attachment-125\" loading=\"lazy\" class=\"size-thumbnail wp-image-125 \" title=\"terryfreedman2011b-m\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/04\/terryfreedman2011b-m-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a><p id=\"caption-attachment-125\" class=\"wp-caption-text\">Terry Freedman<\/p><\/div>\n<p>Terry Freedman has worked in education since 1975. He has taught in schools, been Head of Department, worked as an ICT advisor in a Local Authority, was a Principal Officer for ICT at the UK&#8217;s Qualifications &amp; Curriculum Authority, held a senior position in a London local education authority, and was an Ofsted inspector for ICT and Business Education.<\/p>\n<p>Now an independent educational ICT consultant, Terry publishes the ICT in Education website and the ICT in Education archive website, and the newsletter “Computers in Classrooms”. He is also a regular contributor to the USA’s Technology &amp; Learning Blog.<\/p>\n<p>Terry has contributed many articles to a wide range of British and overseas journals, both print and online, including the Times Educational Supplement and The Guardian’s website and supplements. Having had over 12 books published, he is a member of the UK&#8217;s Society of Authors.  He has also self-published a number of titles. Further details of Terry’s writing activities may be found in the “Writing” section of his website.<\/p>\n<p>In addition, he is a member of the British Computer Society, a Fellow of Naace, a Fellow of Mirandanet, and a Fellow of the Royal Society of Arts.<\/p>\n<p>Terry also gives presentations on educational ICT, including the use of Web 2.0 applications in schools, in the UK and elsewhere.<\/p>\n<p>Approach To Teaching And Learning In Relation To Supporting Teachers<br \/>\nTerry’s philosophy of CPD in the context of Communities of Practice (CoP) may be summarised as follows:<\/p>\n<p>Everyone in the community has something to offer, and should be encouraged to offer it.<br \/>\nThe environment, whether physical or online, should lend itself to the sharing of that expertise in the forms of discussion, articles, links, exemplars, talks (perhaps by guest speakers) and so on. A good example of this is the Secondary ICT Co-ordinators’ Forum Terry was involved in setting up for the OU’s Vital project.<br \/>\nWhether the event\/discussion\/course takes place online or offline, colleagues must be given sufficient time to explore the resources and develop their ideas for their own situation, drawing on the expertise of the community and facilitator\/leader as required.<br \/>\nThe role of the person chairing or leading the proceedings is to pose pertinent questions, keep the pot boiling, as it were, and provide expertise, or invite one of the participants to provide expertise, where necessary. A good example of this is Terry’s chairmanship of several MirandaMods, in which both a physical and an online discussion were taking place at the same time. Another good example is the Secondary ICT Co-ordinators’ Teachshares – online discussions – that Terry was involved in organising for the OU’s Vital project.<br \/>\nNo matter how erudite the discussion, there should always be a practical outcome, ie a means by which the lessons learnt in the CoP may become translated into improved teaching and learning.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Terry Freedman has worked in education since 1975. He has taught in schools, been Head of Department, worked as an ICT advisor in a Local Authority, was a Principal Officer for ICT at the UK&#8217;s Qualifications &amp; Curriculum Authority, held &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/terry-freedman\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":14,"menu_order":5,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/78"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=78"}],"version-history":[{"count":8,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/78\/revisions"}],"predecessor-version":[{"id":1525,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/78\/revisions\/1525"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/14"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=78"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}