{"id":840,"date":"2011-11-15T21:50:11","date_gmt":"2011-11-15T21:50:11","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=840"},"modified":"2014-02-24T10:22:58","modified_gmt":"2014-02-24T10:22:58","slug":"dr-glenys-hart","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/dr-glenys-hart\/","title":{"rendered":"Glenys Hart"},"content":{"rendered":"<p><a rel=\"attachment wp-att-842\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/team\/consultants\/dr-glenys-hart\/glenys-hart-2\/\"><img loading=\"lazy\" class=\"alignleft size-full wp-image-842\" title=\"Glenys Hart\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2011\/11\/Glenys-Hart1.jpg\" alt=\"\" width=\"100\" height=\"100\" \/><\/a>Dr Glenys Hart has worked in education  for many number of years. She has taught in schools, been Head of Department, a Senior Leader, worked as an ICT adviser in a Local Authority and is an Ofsted inspector for ICT and science.  Glenys is now an independent education consultant involved in a wide range of projects, including science and ICT, mentoring new science and mathematics teachers, personalised, collaborative and global learning.  One of her clients is a charity which aims to bridge the digital divide by significantly increasing access to ICT for education, and specifically to ensure that every child in the UK, irrespective of background, should have access to technology for learning especially at home, working in partnership with schools, parents and businesses. She has trained many school to target track using assessment software,  assessed the ICT mark, been a tutor for Masters level training for ICT Co-ordinators.  Her particular interests are digital photography (still and video), use of digital microphones for specific learning difficulties and the use of video conferencing in education .<\/p>\n<p>Glenys was involved the Open University PGCE course between 2006 and 2010 in a variety of roles including: tutoring PGCE students and their mentors in science education; visiting PGCE students in schools; briefing mentors and school co-ordinators in schools,  interviewing potential PGCE students and assessing their suitability for a career in teaching and doing Quality assurance visits to schools.  During this period she completed a piece of research on the use of webcams in education. She has also written about the uses of digital microscopes and  several e-learning modules for the Triple Science programmes.  Glenys has contributed many articles to a wide range of British and overseas journals including the Times Educational Supplement.<\/p>\n<p>She led Teachers International Professional Development groups to Poland to research Teaching and Learning; to Montreal, Canada to study motivation; to Hungary to study transitions; to Connecticut USA to look at a Gifted &amp; Talented programme and to Beijing China and Stavanger Norway to examine ICT and Creativity.  Further she participated in an Arion visit to Tomolloso Spain, to study the use ICT in schools with senior educators from across Europe and was a member of ECOTEC study visit to Poland. Over the past decade she has studied French, Spanish and Italian to Advanced level in order to speak to colleagues abroad and is currently registered on an Oxford University Arabic programme.<\/p>\n<p>Through her work she has acquired an international perspective on the use of ICT in over a dozen countries. Glenys gives presentations on educational ICT in the UK and overseas. She recently presented ‘Twenty First Century classrooms’ and ‘ICT innovations’ at an International conference in Abu Dhabi.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dr Glenys Hart has worked in education  for many number of years. She has taught in schools, been Head of Department, a Senior Leader, worked as an ICT adviser in a Local Authority and is an Ofsted inspector for ICT &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/the-team\/consultants\/dr-glenys-hart\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":6,"featured_media":0,"parent":14,"menu_order":6,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/840"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=840"}],"version-history":[{"count":9,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/840\/revisions"}],"predecessor-version":[{"id":867,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/840\/revisions\/867"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/14"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=840"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}