{"id":928,"date":"2012-06-13T11:50:40","date_gmt":"2012-06-13T11:50:40","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/consultancy\/?page_id=928"},"modified":"2015-05-21T18:54:12","modified_gmt":"2015-05-21T18:54:12","slug":"home-2","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/consultancy\/","title":{"rendered":"Consultancy Home"},"content":{"rendered":"<div id=\"attachment_1025\" style=\"width: 229px\" class=\"wp-caption alignleft\"><a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/MIR1.gif\"><img aria-describedby=\"caption-attachment-1025\" loading=\"lazy\" class=\" wp-image-1025 \" title=\"MIR1\" src=\"http:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/MIR1-150x150.gif\" alt=\"Always Innovating\" width=\"219\" height=\"219\" srcset=\"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/MIR1-150x150.gif 150w, https:\/\/www.mirandanet.org.uk\/consultancy\/wp-content\/uploads\/2012\/06\/MIR1.gif 180w\" sizes=\"(max-width: 219px) 100vw, 219px\" \/><\/a><p id=\"caption-attachment-1025\" class=\"wp-caption-text\"><span style=\"color: #800000;\">Always innovating<\/span><\/p><\/div>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Since 1992 MirandaNet Fellows have established a reputation for <strong>developing change management techniques in the workplace.<\/strong> The professional development programme, called iCatalyst, is designed to engage the whole workforce in reflecting on work practices and collaborating on changes that improve motivation and retention.<\/p>\n<p>In addition, MirandaNet Fellows excel in <strong>research about digital learning products and services undertaken by members who become co-researchers.<\/strong> MirandaNet is unique in marketing the findings through a range of mulitmodal channels to targeted market that are not generally easy to influence.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><b>The background<\/b><\/p>\n<p>The MirandaNet Fellowship  was founded by Dr Christina Preston. Professor of Education Innovation in 1992. This professional organisation that represents a vibrant ecommunity of practice,  has now attracted 1,000 members in nearly 80 countries who are committed to using the power of digital technologies as a catalyst for change in teaching and learning practice. The membership breaks down across continents: Europe 49%, UK 28%, China 18%, USA 16%. The annual growth of membership which is free is currently at 12%.<\/p>\n<p>The current MirandaNet website attracts 6,000 unique visitors a month because of the breadth and variety of free publications authored by the membership. Visitors often return and read up to eleven pages.<\/p>\n<p>The website provides a means of publishing knowledge about digital technologies in learning from members and associates that has been created and developed by a number of means: the internal debating system called mirandalink that provides trending topics and crowd sourcing; the MirandaNet newsletter and blog; MirandaMods, international knowledge creation webinars that are streamed worldwide; talking head videos from practitioners; members’ book reviews; conference papers and presentations; help sheets and manuals for teachers; research papers for journals; opinion pieces; summaries of educational research; MirandaNet Fellows also prepare policy submissions for politicians.<\/p>\n<p> Some members have the opportunity to join the research projects as co-researchers in the iCatalyst programme – a professional development programme that focuses on the management of change. iCatalyst is another key source of the publications on the website.<\/p>\n<p>Publications are all well indexed and appear prominently on Google searches. In addition, through a range of professional social networks, microblogging, messages to other professional organisation, professional journals and through other internal professional channels the Fellowship has a reach of more than 20,000 other professionals who receive MirandaNet news.<\/p>\n<p>MirandaNet research has been been funded by governments, companies, charities, corporates and organisations such as the European Union.<\/p>\n<p>MirandaNet Fellowship is not-for-profit and is funded by associate companies who pay an annual subscription in order to develop their products and services in the context of research undertaken by the professional users. A new website will be ready by 2015 designed to improve the visitor experience and increase the visibility of the associates who support the free MirandaNet services through an overhead on the research projects they commission with the members as co-researchers. <\/p>\n<p><b>Our services<\/b><\/p>\n<p>The MirandaNet Consultancy is the trading arm of the international <a href=\"http:\/\/www.mirandanet.org.uk\/\">MirandaNet Fellowship<\/a>, established in 1992. We work with government agencies, charities, universities and associates companies engaging in education. When companies join us on projects they have access to a wide and effective network of policy makers, teacher educators, senior managers, teachers and researchers.   We draw on this international network of members for advice, participation and dissemination of the results of consultancy projects. Our prices are reasonable and transparent and we welcome discussion about the kinds of project we might undertake, large or small.<\/p>\n<p>These are some of our skills:<\/p>\n<ul>\n<li>Product evaluation, development and marketing for the education market<\/li>\n<li>Facilitating and advising on optimisation of approach to the education marketplace<\/li>\n<li>Evaluating and accrediting tailored professional development programmes for the workforce to embed systemic  change<\/li>\n<li>Business interpretation of key policy consultations and white papers<\/li>\n<li>Assessment, understanding of government initiatives and how to work together in a smarter way and to the greater good of the community<\/li>\n<li>Building collaborative community knowledge and creating theory online with direct focus on your products and services<\/li>\n<li>Optimising use of learning platforms and teaching online<\/li>\n<li>Advice on bidding and partnership in proposals<\/li>\n<li>Advice on e-safety<\/li>\n<li>Advice on IT procurement<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; &nbsp; Since 1992 MirandaNet Fellows have established a reputation for developing change management techniques in the workplace. The professional development programme, called iCatalyst, is designed to engage the whole workforce in reflecting on work practices and collaborating on changes &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/consultancy\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/928"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/comments?post=928"}],"version-history":[{"count":94,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/928\/revisions"}],"predecessor-version":[{"id":2051,"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/pages\/928\/revisions\/2051"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/consultancy\/wp-json\/wp\/v2\/media?parent=928"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}