{"id":1276,"date":"2012-02-27T09:59:22","date_gmt":"2012-02-27T08:59:22","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=1276"},"modified":"2013-09-16T15:27:04","modified_gmt":"2013-09-16T14:27:04","slug":"notes-for-participants-march-1st","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/notes-for-participants-march-1st\/","title":{"rendered":"How to participate in an unconference"},"content":{"rendered":"<h2>Planning a new research design<\/h2>\n<p>You can learn more about MirandaMods <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">here<\/a><\/p>\n<p>The MirandaNet iCatalyst professional development programme is designed to put teachers in the driving seat.  A <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMod<\/a> which is one aspect of the approach is designed to improve the opportunity for higher order thinking in informal professional development: summarising, analysing and evaluating the information that is being presented. We are plan our research approach on the basis of several previous events where we have used concept mapping as a knowledge creation tool.<\/p>\n<p>The MirandaMod that has been developed by the MirandaNet Fellowship, is a form of unconference &#8211; a generic term for an informal conference among peer professionals, who come together to set their agenda and determine the format and content of their conference, rather than having to accept the more formal agenda of traditional conference committees and organisers. The participants in these informal professional development events are seen as equals, regardless of status, culture and nationality. This wide range of education professionals choose a theme for a face-to-face meeting. But others join in across national boundaries, using a range of such digital communications technologies as video conferencing, microblogging and collaborative concept maps that emphasise the social element of learning. All participants are invited to being web-enabled devices so that they can engaged in the collaborative knowledge creation during the event.<\/p>\n<p>Collaborative concept mapping has been central to these events because these artefacts bring scaffolding into focus in a particularly concrete way: providing an opportunity to pinpoint a concept from a visual rather than a written perspective. Several factors emerge from earlier studies that appear to have an influence on the emergence of unconferences e.g all participants in the MirandaMod event should:<\/p>\n<ul>\n<li>feel that they are involved in an enterprise that is part of a community trajectory in professional learning;<\/li>\n<li>feel that they have something to gain from the learning;<\/li>\n<li>feel that their contributions are equally valued;<\/li>\n<li>have a role as co-researchers;<\/li>\n<li>have access to the artefacts before, during and after the event;<\/li>\n<li>should have ownership of the artefact including the right to edit;<\/li>\n<li>should have publishing rights and reappropriation opportunities.<\/li>\n<\/ul>\n<p>The lead researchers contribute to developing these condition by making their aims clear and offering to share the drafts of the resulting papers. The chair, Chris Yapp, will also focus on the learning at the beginning and in a summary at the end. Expert participants might like to suggest headings for the concept map that is to be developed.<\/p>\n<p>As a result of these findings we started a new research phase in May 2012 at a MirandaMod at the University of Bedfordshire.A description of what took place will be helpful to those who are considering participating in MirandaNet events in the future.<\/p>\n<p>In order to comply with conditions that seem to facilitate professional learning all the attendees at the event were invited to be co-researchers whether they were teachers, teacher educators, advisers, company representatives or student teachers. Opportunities to engage with the free communications software and experiment with the online environments were offered to all the participants in advance of the event.<\/p>\n<p>The title of this two-hour MirandaMod was <em>Integrating 21st century skills into the classroom. <\/em>Seven expert participants from the MirandaNet membership  volunteered to speak on a range of related topics:<\/p>\n<ul>\n<li>The Big Picture<\/li>\n<li>What’s new in digital tools for learning?<\/li>\n<li> Visual Learning and Digital Literacy<\/li>\n<li>Using Video as a curriculum tool<\/li>\n<li>Can every student hear?<\/li>\n<li>Using Skype as a learning tool<\/li>\n<li>Mapping concepts collaboratively<\/li>\n<\/ul>\n<p>Each of the expert participants had about seven minutes to make their main points and elicit questions. They were asked to make their presentation informal and argue their case avoiding bullet points. To increase the informality all the participants and expert participants are seated in a circle so that eye contact is good and engagement can take place between the expert participants and the others and also between all the participants.<\/p>\n<p>It is preferable if the experts do not use  bullet pointed slides but concentrate on eye contact with the audience and engagement. Presentation software can be used where seeing an image is vital to the argument however.<\/p>\n<p>All participants are invited to bring online devices so that they can contribute to the Twitter stream and the remotely authored concept map that will be developing on screens in the room. The event is be video-streamed and those with an interest who cannot attend face to face are invited to join the Flash meeting which is a free video conferencing service that also boasts a discussion transcript.<\/p>\n<p>After this two hour professional knowledge gathering process the participants engaged in an hour’s session where they investigate the Twitter stream, the Flash meeting transcript and the concept map that has been produced. The discussion will focus on what has been learnt and whether a bigger picture is emerging about the <em>Integrating 21st century skills into the classroom. <\/em>At the centre of this discussion was a focus on summary, analysis and evaluation. At this point they also worked on the concept map to ensure that it held all the messages of the event and could be developed as a resource. Some questions were developed to scaffold this activity.<\/p>\n<p>To comply with ethical requirements when the participants are invited to be co-researchers at this event they will be asked for their permission to  publish the data that they provide on the basis that they will have sight of the drafts and the opportunity to censor their own contribution if they wish.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Planning a new research design You can learn more about MirandaMods here The MirandaNet iCatalyst professional development programme is designed to put teachers in the driving seat.  A MirandaMod which is one aspect of the approach is designed to improve &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/notes-for-participants-march-1st\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1222,"menu_order":50,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1276"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=1276"}],"version-history":[{"count":22,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1276\/revisions"}],"predecessor-version":[{"id":5281,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1276\/revisions\/5281"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1222"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=1276"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}