{"id":1352,"date":"2012-03-25T09:11:35","date_gmt":"2012-03-25T08:11:35","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=1352"},"modified":"2014-08-06T18:31:30","modified_gmt":"2014-08-06T17:31:30","slug":"braided-learning-in-collaboration","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/braided-learning-in-collaboration\/","title":{"rendered":"Braided Learning"},"content":{"rendered":"<p><strong> <\/strong><\/p>\n<p>Working with professional educators, the MirandaNet Fellows have developed the emergent theory of Braided Learning by observing how communities of practice engage with each other face to face and online.<\/p>\n<p>The term, Braided Learning,  refers to a meaning-making process that is emerging from the observation of online communication as communities of professionals mature in digital competence (Haythornthwaite, 2007). In her paper on six models for online community engagement Haythornthwaite explained that first three stages of Braided Learning were established when the communities being researched were only using email. MirandaNet Fellows continued to record this process for collaborative engagement on knowledge creation in context of the liminal space where collaboration takes place. Liminal Space is already established in learning theory with the image of a tunnel in the mind. This relates to the formal learning of concepts that are difficult to understand.  A learner finding knowledge troublesome would be ‘stuck’ in the tunnel of liminal space.  The old, comfortable understanding is no longer sufficient yet s\/he cannot progress to the extended area because the new knowledge is either not understood or misunderstood. However, Raiker (2010) has found that tutors can act in the Brunerian sense (1986) as scaffolds to support them traversing liminal space. Indeed, liminal space can be equated with Vygotsky’s Zone of Proximal Development, defined by Vygotsky as being ‘…the distance between the actual developmental level as determined by independent problem solving and the level of potential development as determined through problem solving under adult guidance, or in collaboration with more capable peers’ (1986:78).<\/p>\n<p>The MirandaNet Fellows are looking at the potential that online learning provides for learning collaboratively. The kind of informal learning that we are engaged with here is particularly related to the potential of working in a community rather than learning in solitude. Hence the metaphor of tunnel, which has been used to describe individual liminal space, is no longer appropriate.  Liminal space in this sense can be described as essentially inchoate and formless. However, as it is proposed that individuals will progress from one learning state to another through shared liminal space, there must be elements that allow this to happen, including a sense of boundedness. MirandaNet Fellows Cuthell, Cych and Preston (2010) argue that social liminal space can be conceptualised as anthropological and contains semiotic  elements  that can be visual as well as written.<\/p>\n<p>The MirandaNet Fellows are exploring this extended explanation of  liminal space as an virtual space in which professionals explore new knowledge.  The Fellowship have developed  a virtual liminal space called a MirandaMod where members engage face to face and online.In this virtual space  the participants are struggling to make sense of what they hear, see or read (Preston and Cuthell 2011: Cuthell, Preston and Cych 2011, in press). As CoPs learn to use digital technologies in sophisticated ways, an interesting form of social learning is emerging that is underpinned by the use of technologies. This is collaborative, community-focused and voluntary, in contrast to focusing on the learning progress of individual learners towards accreditation on a course.<\/p>\n<p>Braided Learning has drawn on the theories of other members of MirandaNet notably the Communal Constructivism theory that emphasises teachers’ knowledge building role as they work together often across national boundaries (Lave and Wenger 1991; Wenger 1998; Holmes, Tangney et al. 2001; Leask and Younie, 2001; Wenger, McDermott et al. 2002; Leask and Younie, 2002; Stuckey, 2005). Much of this communal cross-national work is online.<\/p>\n<p>We are working on the ideas from our three current papers in Prague, June 6th to 10th 2012 below.<\/p>\n<p>1. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/Hitchin-Preston.pdf\">Collaborative concept maps<\/a><\/p>\n<p>2. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/Beyond-Collaboration.pdf\">Beyond Collaboration<\/a><\/p>\n<p>3. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/MirandaMods-paper.pdf\">Teacher professional development and learning in a technologised world<\/a><\/p>\n<p>We would be delighted with any comments made by members in the MirandaNet Braided Learning Forum.<\/p>\n<p>You can also join online the MirandaMod from Prague on June 7th. Further information and joining instructions will appear <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/how-can-digital-technologies-support-learners-prague-6th-10th-june\/\">here<\/a>.<\/p>\n<p>If you are not a member but would like to comment please email to  &#x63;&#104;&#x72;&#105;s&#x74;&#105;n&#x61;&#64;&#x6d;&#x69;r&#x61;&#110;d&#x61;&#110;&#x65;&#x74;&#46;&#x61;&#99;&#46;&#x75;&#107;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>  Working with professional educators, the MirandaNet Fellows have developed the emergent theory of Braided Learning by observing how communities of practice engage with each other face to face and online. The term, Braided Learning,  refers to a meaning-making process &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/braided-learning-in-collaboration\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1337,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1352"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=1352"}],"version-history":[{"count":12,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1352\/revisions"}],"predecessor-version":[{"id":1359,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1352\/revisions\/1359"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1337"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=1352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}