{"id":1388,"date":"2012-03-26T22:31:24","date_gmt":"2012-03-26T21:31:24","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=1388"},"modified":"2014-11-01T18:52:14","modified_gmt":"2014-11-01T17:52:14","slug":"articles","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/","title":{"rendered":"Articles, blogs, opinion pieces"},"content":{"rendered":"<p>MirandaNet is a community of educators who are curating our collaborative thinking under themes that have been identified  so that colleagues can trace how the community has developed key ideas over time. There is no limit to this collaborative process,  but it is important that from time to time we communicate our ideas to policy makers, the profession and the research world. We do this through our events and in our publications that come in many forms: academic publications, articles for professional journals, newspapers and contributions to relevant consultations.<\/p>\n<p>The progress of our professional thinking can be traced through articles listed below.<\/p>\n<p>There are four kinds of articles in this section of the website that represent MirandaNet members thinking on a range of issues:<\/p>\n<ul>\n<li>digests of debates on mirandalink that is a membership online debating service;<\/li>\n<li>articles based on MirandaNet expertise and opinions offered at unconference events;<\/li>\n<li>articles based on the resources developed from innovative virtual communication events called MirandaMods;<\/li>\n<li>comments on Computing debates  that emerge in the news;<\/li>\n<li>the MirandaNet newsletters.<\/li>\n<\/ul>\n<p>We are gradually curating these for the new MirandaNet website that is planned for January 2015 <a href=\"http:\/\/www.mirandanet.org.uk\/articles\/\">here<\/a>. Meanwhile you can gain a flavour what the new resource will have to offer as some of the latest articles are below:<\/p>\n<ol>\n<li>D<span style=\"color: #000000;\">oes research really have any measurable impact on teaching practice?<\/span><\/li>\n<li><span style=\"color: #000000;\">A political attack on academics and teachers in the UK<\/span><\/li>\n<li><span style=\"color: #000000;\">Developing effective professional communication models using technology<\/span><\/li>\n<li><span style=\"color: #000000;\">Is there really an alternative to Powerpoint?<\/span><\/li>\n<li><span style=\"color: #000000;\">Continuing Professional Development: multimedia resources and training for teachers<\/span><\/li>\n<li><span style=\"color: #000000;\">Continuing Professional Development: multimedia resources and training for teachers<\/span><\/li>\n<li><span style=\"color: #000000;\">An ICT curriculum for the Knowledge Age<\/span><\/li>\n<li><span style=\"color: #000000;\">Can schools throw out their computers now that the ICT Curriculum is being threatened with disapplication?<\/span><\/li>\n<li><span style=\"color: #000000;\">Theories of learning underpinning digital technologies in education<\/span><\/li>\n<li><span style=\"color: #000000;\">Exploring Education Future<\/span><\/li>\n<\/ol>\n<h1 class=\"MsoNormal\" style=\"mso-margin-top-alt: auto; mso-margin-bottom-alt: auto;\">Opinion Pieces<\/h1>\n<p>Laurillard, D (2014) <em>Hits and Myths: Moocs may be a wonderful idea but they are not viable. <\/em>The Times Education Supplement January 16th. Download here <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2009\/04\/Laurillard_THE_JAN1614.pdf\">Laurillard_THE_JAN1614.pdf<\/a><\/p>\n<p class=\"MsoNormal\" style=\"mso-margin-top-alt: auto; mso-margin-bottom-alt: auto;\">Preston C (2013). <em><a href=\"http:\/\/inroads.acm.org\/archives.cfm?iid=2465085\">Critical Perspective: Re-engineering the ICT profession<\/a><\/em> ACM InRoads Paving the way to excellence in Computing June 2013 | Volume 4, No. 2 ACM<\/p>\n<h1>Articles<\/h1>\n<h2><span style=\"color: #0000ff;\">1. Does research really have any measurable impact on teaching practice? <\/span><\/h2>\n<p>The closing of Becta, the UK ICT government agency, by the new Coalition government in 2009, also resulted in the wiping of research findings that had been built up over the last twenty years, paid for by the tax payers. Attempts are being made to restore some of these findings on independently owned websites like MESH and as part of this process MirandaNet Fellows were asked:<\/p>\n<ul>\n<li><span style=\"color: #000000;\">Where do you look for credible research?<\/span><\/li>\n<li>Where do you expect research funding to come from in the next 10 years<\/li>\n<li>What research questions would you like answered in your current situation.<\/li>\n<\/ul>\n<div><span style=\"font-size: medium;\"><span style=\"line-height: 24px;\">From some answers read more <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/does-research-really-have-any-measurable-impact-on-teaching-practice\/\">here<\/a>.<\/span><\/span><\/div>\n<div><\/div>\n<h2><span style=\"color: #0000ff;\">2. A political attack on academics and teachers in the UK<\/span><\/h2>\n<p>Educators and academics may not have the longevity of the British Queen, but nevertheless professionals in education have more longevity than governments and, therefore, are likely to have more knowledge about education than merely having attended a school in their youth. In the century of the internet, we now have evidence that professionals should not be dependent on political favour to maintain repositories of research findings and resources that, in the long terms can have global impact on educational achievement.<\/p>\n<p>In this context, Professors Marilyn Leask  and Christina Preston have just returned from a speaking tour of Australia and New Zealand universities building up support for <em>Re-engineering the profession: call for collective action.<\/em> Underlying this initiative is a concern about recent attacks on academics and their respositories of knowledge.<\/p>\n<p>MirandaNet has been involved recently in the consultations about the ICT curriculum which the Coalition government are threatening to change to two thirds coding without the agreement of the main professional bodies: ITTE, Naace and MirandaNet.<\/p>\n<p>The attempts to by-pass professional opinion about the ICT curriculum is one aspect of an more wide reaching attack on academics and teachers that the Coalition has mounted. In one attack, Micheal Gove, the UK Secretary of State for Education, and ex-journalist, is clearly not expecting to win teachers&#8217; votes with his polemic published in the Mail on Sunday, a right wing tabloid:<\/p>\n<p><em>I refuse to surrender to the Marxist teachers hell-bent on destroying our schools: Education Secretary berates &#8216;the new enemies of promise&#8217; for opposing his plans.<\/em><\/p>\n<p>Next we have the Chief Inspector of OFSTED, Michael Wilshaw&#8217;s comments about the letter, signed by 100 UCET academics, criticising his reforms. Apart from the fact that the Chief Inspector should be impartial, Michael Wilshaw shows a lack of understanding of teacher educators’ partnerships with schools by calling on them to come out of their ‘ivory towers’. This is a strange attack on academics from an ex-head teacher who thought that the most important achievement of the school he ran in a disadvantaged London community was that a few pupils won places at Oxbridge. He says all pupils should aspire to this level of academic excellence and yet criticises academics if they do not agree with his approach. Isn&#8217;t the point of creating academics an effort  to create more intelligent thinkers in a democracy?<\/p>\n<p>Firstly the way in which the new ICT curriculum has been designed in England is a concern in terms of wider issues about the preservation of democracy processes and regard for professionalism. For example, government websites holding many years of resources and research developed by professionals have been closed down by the Coalition. For example, Becta, the government agency for digital technologies in education, funded a huge variety of publications developed by teachers and teacher educators. These publications can no longer be accessed as in 2010 when they were elected, the Coalition closed all the government websites including Becta’s research and professional development publications, the Teacher Training Agency ICT resource bank for teachers and Teachers’ TV. A huge repository of resources, advice and evidence has been destroyed.<\/p>\n<p>But developing collaborative strategies for building knowledge has also resulted in strategies for influencing government policy by strengthening professional judgment with ‘crowd sourced’ evidence. So far teachers and academics have not been good at publishing evidence in a single place as doctors have.  The successful model used in the medical field, The Cochrane review, already adopts the ideas of knowledge management to the managing and building of knowledge which is scaled up by the submission of small scale studies that are analysed to achieve a wider consensus on what works and what does not work. The intention is that learner attainment will be raised by professionalizing teaching.<\/p>\n<p>Independent global ownership by universities of the platform means that the teaching profession and the associated academics do not have to trust the continued funding of government websites when the political regimes change drastically and education becomes a political football. From this starting point an international community of communities has been established, the Education Futures Collaboration, based at the University of Bedfordshire. This independent organisation is for global educators, teachers and academics as well as companies,  who wish to work collaboratively to improve the quality of education and make sure that knowledge is disseminated. The ideas, values and work strands underpinning the Education Futures Collaboration have been evolving for many years through the professional interests and work of a number of founding members. The Royal Academy of Engineers, the British Computer Society and teachers from Computers in Schools who have been advising the Coalition are also be invited to add pathways from their research and knowledge about Computing Science.<\/p>\n<p>Read more about Miranda&#8217;s involvement in the Education Futures Collaboration here.<\/p>\n<p><a href=\"http:\/\/www.dailymail.co.uk\/debate\/article-2298146\/I-refuse-surrender-Marxist-teachers-hell-bent-destroying-schools-Education-Secretary-berates-new-enemies-promise-opposing-plans.html#ixzz2PD3mT9xh \">Read more<\/a> about the Gove article.<\/p>\n<p><a href=\"http:\/\/www.thetimes.co.uk\/tto\/education\/article3718769.ece\">Read more <\/a>about the Wilshaw article.<\/p>\n<h2><span style=\"color: #0000ff;\">3. Developing effective professional communication models using technology<\/span><\/h2>\n<p><strong>Digital Approaches to informal Building and Sharing Professional Knowledge<\/strong><\/p>\n<p>Contributions coordinated by Fellows: Dewi Lloyd (Iris Connect),  Matthew Pearson and Rachel Jones (Steljes), Roger Turner (Light Speed) and Katya Toneva (St Mary&#8217;s).<\/p>\n<p>Professional Development needs to change radically to meet the needs and challenges of the digital age.  We now have very powerful tools at our disposal for sharing professional knowledge in new ways, and the challenges to all, especially academics and policy makers, is to develop ways of harnessing this potential so that impacts on practice are maximized and a real culture of innovation and creativity is fostered amongst teachers.<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/building-and-sharing-professional-knowledge\/\"> Read more&#8230;<\/a><\/p>\n<h2><span style=\"color: #0000ff;\">4. Is there really an alternative to Powerpoint?<\/span><\/h2>\n<p>December 2011<\/p>\n<p>Of course it is not that simple – although some excellent alternatives to Powerpoint have been offered in the mirandalink debate about effective presentations: Prezi, Keynote, Articulate Studio, Xerte, Timtoast.com, Google Earth and Sketchup  and others…as well as some warnings about them all – as Chris Yapp said it depends on what you want to do. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/building-and-sharing-professional-knowledge\/is-there-an-alternative-to-powerpoint-really\/\">Read more&#8230;<\/a><\/p>\n<h2><span style=\"color: #0000ff;\">5. Continuing Professional Development: multimedia resources and training for teachers<\/span><\/h2>\n<p><strong>Continuing Professional Development in ICT<\/strong><\/p>\n<p>Contributions coordinated by Fellows: Dewi Lloyd (Iris Connect),  Matthew Pearson and Rachel Jones (Steljes), Roger Turner (Light Speed) and Katya Toneva (St Mary&#8217;s). November 2012<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/matt-cpd\/\" rel=\"attachment wp-att-3204\"><img loading=\"lazy\" class=\"alignright size-medium wp-image-3204\" title=\"Matt CPD\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/Matt-CPD-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/Matt-CPD-300x200.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/Matt-CPD-1024x682.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a>The challenges to teacher professional development that will arise in the next 5 to 10 years are considerable, yet the opportunities to transform practice and create a generation of teachers delivering a world class ICT curriculum are within our grasp. Innovations in ICT and the exponential growth of the digital world will not patiently wait for educators to catch up and implement change at their own pace.  Rather than a programme that is built on gradual and incremental improvements to existing practice, we need to embrace methodologies for CPD in ICT that move practice on at a much greater pace. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/ict-professional-development\/\">Read more&#8230;<\/a><\/p>\n<h2><span style=\"color: #0000ff;\">6. What does the 21st century teacher need to know?<\/span><\/h2>\n<p>From Prague 2013<\/p>\n<p>At the MirandaNet conference in Prague 2012 a key consideration raised by this international group was the kind of model of continuing development that was most appropriate for professionals in education. on of the partcipants, Gareth Meed, a deputy head teacher in a large primary school in a challenging urban area of Bradford, UK, looked more closely at how the curriculum for teachers should be organized, “If an educator is to be effective in the development of learning then the questions may be: firstly, is knowledge about digital technologies sufficient in itself ?; and, secondly, what kind of educator or what pedagogy is needed to use these technologies most effectively?<\/p>\n<p>Jan Lepeltak, journalist, educator and researcher joined the debate saying: “The challenge I see is:\u2028 how can we use ICT to enhance ‘traditional’ skills and stimulate deep-learning?”<a href=\"www.mirandanet.org.uk\/researchexchange\/articles\/poskole-report-prague-june-2012\/\"> Read more<\/a>&#8230;<\/p>\n<h2>The  iCatalyst programme: innovative professional development<br \/>\n<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/icatalyst-logo-2\/\" rel=\"attachment wp-att-3195\"><img loading=\"lazy\" class=\"alignleft size-medium wp-image-3195\" title=\"iCatalyst logo\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/iCatalyst-logo1-300x123.jpg\" alt=\"\" width=\"300\" height=\"123\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/iCatalyst-logo1-300x123.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/iCatalyst-logo1.jpg 671w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/h2>\n<h2><\/h2>\n<h2><\/h2>\n<p>Based on MirandaNet research, Fellows have devised iCatalyst, an an innovative Continuing Professional Development (CPD) programme that is relevant to the whole workforce. MirandaNet Fellows have undertaken research into CPD in digital technologies since 2004 particularly focusing on educators who want to take ownership of change through action research and collaborative decision making.<\/p>\n<p>Bespoke course can be run as one day events or modules that last one term or one year. Modules can be linked together if required to do a Masters or a Ph.D. This way of working is  particularly valuable in helping a group of professionals to reflect on changes that they wish to make to their working practices. Members of the group can make different decisions about whether they want to work towards accreditation or not. If they decide on accreditation they are mentored in deciding the level of accreditation that will be most appropriate. <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/professional-development-programmes\/\">Read more&#8230;<\/a><\/p>\n<h1><span style=\"color: #0000ff;\">7. An ICT curriculum for the Knowledge Age<\/span><\/h1>\n<p><strong>Miranda&#8217;s ICT curriculum<\/strong><\/p>\n<p>From the Exploring Education Futures Conference at Bedford November 2013<\/p>\n<p>Christina Preston, Theo Kuechel, Ian Lynch, Gebol, Iris Lanny-Oracle, Carsten Trinitis- University of Munich and Andrea Forbes, Gareth Lee, Omnisoft, Texas Instruments, Gerlinde Gniewosz, KO-SU.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/ict-curr\/\" rel=\"attachment wp-att-3206\"><img loading=\"lazy\" class=\"alignright size-medium wp-image-3206\" title=\"ICT Curr\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/ICT-Curr-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/ICT-Curr-300x200.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/ICT-Curr-1024x682.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/p>\n<p><strong>The draft programmes of study<\/strong><\/p>\n<p>While the draft programme of study produced by The British Computer Society and the Royal Academy of Engineering is a good starting point, we have identified the following weaknesses.<\/p>\n<p>Too much space (about 50%) is taken up with purpose, aims and definitions.<br \/>\nInconsistency in the use of language and the detail presented in different parts of the text.<br \/>\nProgression routes between key stages lack sufficient clarity to be maximally useful to teachers.Some language is not helpful to a general readership. It is not always well matched to the level associated with the content and could therefore be misleading.<br \/>\nThe lack of reference to assessment sends the wrong signals in terms of professional rigour.  We do not need to be prescriptive about assessment methods but we do need to ensure that regular assessment takes place since it is an essential element in any teaching strategy to raise standards.We propose the following redraft. This concise, consistent and balanced version gives a clearer steer on progression and takes account of evidence of age related cognitive development. We do not think this redraft changes the overall statement of what good teaching in the field should be about, but presents the information in language that more educators will be familiar with. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/our-ict-curriculum\/\">Read more&#8230;<\/a><\/p>\n<p>You  can read more about the UK ICT consultation <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/ict-curriculum-consultation\/\">here<\/a>.<\/p>\n<p>Dr Noeline Wright has commended from the perspective of New Zealand here<\/p>\n<h2>8. Can schools throw out their computers now that the ICT Curriculum is being threatened with disapplication?<\/h2>\n<p><strong>Unexpected results from consultation<\/strong><br \/>\nRegional advisers and school cluster trainers in Information and Communications Technology (ICT) have been disappearing since the Coalition took over in the UK two years ago. But now there are indications that some teachers of ICT in schools will lose their jobs at the end of this academic year. The reason is that <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/keynotes-and-papers\/\">in his address<\/a> to BETT12 in January, Michael Gove set up <a href=\"http:\/\/www.education.gov.uk\/schools\/teachingandlearning\/curriculum\/nationalcurriculum\/a00202110\/ict-curriculum-consultation\">the consultation<\/a> about the disapplication of the ICT curriculum. If disapplication goes through in September it will mean that heads no longer have to be accountable to Ofsted for the use of digital technologies in teaching and learning in their schools. Some heads are already taking advantage of the apparent lack of political support to economise on ICT provision. The danger is that if a new ICT curriculum is agreed there will be few staff trainers, advisers and commercial providers left to deliver it. Meanwhile master level course in universities are seriously threatened by the move to school based training. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/can-schools-throw-out-their-computers\/\">Read more&#8230;<\/a><\/p>\n<h2><span style=\"color: #0000ff;\">Sustaining collaborative professional learning and research through technology<\/span><\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/eec_logo_1_white\/\" rel=\"attachment wp-att-3209\"><img loading=\"lazy\" class=\"size-thumbnail wp-image-3209 alignleft\" title=\"EEC_Logo_1_white\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/EEC_Logo_1_white-150x150.png\" alt=\"\" width=\"100\" height=\"100\" \/><\/a>At the Exploring Education Futures unconference, one working party in partnership with Education Futures Collaboration, was discussing how to solve a problem that affects academics and professionals all over the world: Why aren’t policy and practice in the education professions underpinned by an agreed body of research based evidence? Probably because teaching and learning are among the most complex of all human activities and probably not because of lack of original, rigorous and significant research work across the discipline of education.<\/p>\n<p>So, what to do?<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/efc\/\" rel=\"attachment wp-att-3207\"><img loading=\"lazy\" class=\"size-medium wp-image-3207 alignright\" title=\"EFC\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/EFC-300x225.jpg\" alt=\"\" width=\"300\" height=\"225\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/EFC-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/EFC-1024x768.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a>In the UK, building and making accessible a reliable database of evidence-based research has strengthened policy and practice in the medical and health professions through such collaborations as the Map of Medical Healthguides and the National Institute for Health and Clinical Excellence (NICE).<\/p>\n<p>Improving education systems in a similar way has proved to be an elusive goal across the globe. In its 2009 report<a title=\"\" href=\"#_ftn1\">[1]<\/a> the OECD calls for the creation of knowledge-rich, evidence-based systems to empower educational leaders and teachers with the knowledge needed to transform models of schooling. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/education-communities\/\">Read more&#8230;<\/a><\/p>\n<p>Each of the members was awarded a Fellowship for their contribution to the publications from this group that can be found here. The authors were: Professor Marilyn Leask, Dr Sarah Younie, Dr Sean McCusker, Kevin Burden, Graham Newell, Iris, Dr Andrea Raiker, Dr Noeline Wright, Gerlinde Gniewosz, KO-SU.<\/p>\n<p>&nbsp;<\/p>\n<h2><span style=\"color: #0000ff;\">9. Theories of learning underpinning digital technologies in education<\/span><\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/ejournals\/\" rel=\"attachment wp-att-3208\"><img loading=\"lazy\" class=\"size-medium wp-image-3208 alignright\" title=\"ejournals\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/ejournals-300x200.jpg\" alt=\"\" width=\"300\" height=\"200\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/ejournals-300x200.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/ejournals-1024x682.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a>Dr Andrea Raiker has co-ordinated this group who have published a book chapter and have another paper under  peer reviewed. This research has been following the MirandaNet group activities in order to see how collaborative professional learning might be scaffolded by tutors. She summarises this group&#8217;s research &#8216;into whether, in the current political climate, teachers could “organise themselves as communities of enquirers, organising their own enlightenment” through a blended physical and virtual environment&#8217; . She asks whether this ‘enlightenment’ would have the potential to influence policy?&#8217;  and explains how mind mapping software was used as a means of mediating language misinterpretations, misunderstandings and supporting knowledge transfer. <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/crossing-professional-boundaries-with-digital-technologies\/\">Read more<\/a>&#8230;.<\/p>\n<h2><span style=\"color: #0000ff;\">10. Exploring Education Futures<\/span><strong><br \/>\n<\/strong><\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/mirandamod-streams\/\" rel=\"attachment wp-att-3202\"><img loading=\"lazy\" title=\"MirandaMod streams\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/MirandaMod-streams-150x150.jpg\" alt=\"MirandaMod knowledge streams\" width=\"150\" height=\"150\" \/><\/a><\/p>\n<p><strong>MirandaMod collaboration<\/strong><\/p>\n<p>In order to achieve collaboration across national and cultural boundaries Fellows have invented an innovative form of unconferenc, a <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMod,<\/a>  where the debate of participants face to face is video-streamed to members in 80 countries. Remote participants can engage though five streams: Twitter, Flash meeting and remotely authored digital mind maps. All these streams provide resources for those who want to study the proceedings later. Our aim is to use this form of publication to draw attention to research findings and professional expertise to use in influencing policy makers at local, national and international levels.<\/p>\n<p>The four broad themes that emerged from this collaborative activity are:<\/p>\n<ul>\n<li>Continuing Professional Development: multimedia resources and training for teachers;<\/li>\n<li>Developing effective professional communication models using technology;<\/li>\n<li>Sustaining collaborative professional learning and research through technology;<\/li>\n<li>Theories of learning underpinning digital technologies in education<\/li>\n<\/ul>\n<p>A fifth theme was added to respond to a political agenda, <em>an ICT curriculum for the Knowledge Age<\/em>. This included the working group from Prague that were looking at digital professional identity and  e-wellness linked with digital safety.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>MirandaNet is a community of educators who are curating our collaborative thinking under themes that have been identified  so that colleagues can trace how the community has developed key ideas over time. There is no limit to this collaborative process,  &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":5,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1388"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=1388"}],"version-history":[{"count":162,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1388\/revisions"}],"predecessor-version":[{"id":6454,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1388\/revisions\/6454"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=1388"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}