{"id":161,"date":"2009-06-30T20:36:36","date_gmt":"2009-06-30T19:36:36","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=161"},"modified":"2012-09-09T20:15:34","modified_gmt":"2012-09-09T19:15:34","slug":"icatalyst-cpd-programme","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/action-research-the-main-principles\/icatalyst-cpd-programme\/","title":{"rendered":"Professional development in action research"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignleft size-medium wp-image-170\" title=\"slide0001\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2009\/06\/slide0001-300x225.gif\" alt=\"slide0001\" width=\"300\" height=\"225\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2009\/06\/slide0001-300x225.gif 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2009\/06\/slide0001.gif 720w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Below are some MirandaNet Action Research Exemplar Modules accredited at certificate, diploma, masters and doctorate level.<\/strong><\/p>\n<p>The MirandaNet iCatalyst Academy offers a basic programme in digital technologies that can be mixed and matched. This programme consists of 6 one day courses with a theoretical introduction if required, and 6 one day skills based courses. Each course is standalone and can be modified to suit. Each day course will cover three strands that can be used as the basis for a certificate, a diploma or a Master module if the student has elected to take their studies further.<\/p>\n<p><strong>The framework<\/strong><\/p>\n<p>Strand 1: What the literature says<br \/>\nIn the first strand practitioners will critique the literature relating to the module topic and use this to shape their professional perspectives and pedagogical application of digital learning technologies.<\/p>\n<p>Outcome for educators : an understanding of the overview of literature and methods for further investigation if the student wants to convert to Masters’ level.<\/p>\n<p>Strand 2: Digital learning technologies<br \/>\nPractitioners will explore the appropriate and available technology for their educational context in the second strand. The relevant technologies will be critically evaluated. An essential and integral set of collaborative technologies used in this strand will be those employed in the digital debates where teachers and experts join in discussion that values the teachers’ contribution. The communications technology involves: streamed video; Twitter streams; group videoconferencing; online collaborative concept maps and face-to-face participation. The resources are stored afterwards as a means of developing the professional knowledge base. These events are more democratic than a webinar which tends to involve experts talking to an audience. Generically they are called unconferences. The MirandaNet Fellowship has developed a version of the unconference called a MirandaMod.<\/p>\n<p>Outcome for educators: practical involvement in the processes that are required to implement this innovative mode of collaborative learning that can enrich professional practice.<\/p>\n<p>Strand 3: Pedagogical application<br \/>\nIn the third and final strand practitioners for Masters and Diploma level students will develop an action research plan about applying the selected technologies in their classroom or school system planned to extend over one term. This topic is best chosen in relationship to the school’s development plan. If the students elect to take the subject further during the action research period they will critically evaluate the effectiveness of the technologies for teaching and learning and present to the other students who are also doing extensions to an introductory one day course. At appropriate levels the findings will be related to the existing literature. The results can be used in staff training and in OFSTED reports where this is appropriate.<\/p>\n<p>Outcome for educators: practical involvement in applying digital technologies in their workplace in order to produce findings that impact on change management.<\/p>\n<p>(Strand one and strand two could run concurrently in a day course which concludes with a MirandaMod in the late afternoon\/early evening. Strand three is designed to be complete in one term).<\/p>\n<p>Six one day courses within the framework<\/p>\n<p>Course 1: Creating a digital identity for students, educators and schools<br \/>\nThe demands of the learning environment and the pervasiveness of digital technologies place educational practitioners in a position where they need to understand the value and the challenges of establishing digital credibility – the knowledge, expertise and skills required to advise young people and apply digital technologies in their practice. This one-day course gives teachers the information and tools to build personal and professional learning networks, to understand the value of professional identity and how to promote it. From classroom practitioners to academics, from school leaders to advisers –professionals need the skills and knowledge that allow them to establish, promote and maintain their own digital credibility and value in the educational marketplace. With this practical experience professionals will be supported in transferring this knowledge to learning situations where students need similar support. E-safety will be an element of this course.<\/p>\n<p>Outcome for educators: a broader and more detailed understanding of the ways in which digital identity can be established, protected and exploited for the benefit of the educational establishment.<\/p>\n<p>Course 2 : Building Learning Communities face to face and online<br \/>\nDevelop the knowledge and skills in using tools for collaborative Continuing Professional Development in schools and clusters and building a personal learning networks. Learn how to develop innovative online ways of learning in which students, teachers and experts interact on topics of mutual interest. Collaborate with other teachers in developing e-facilitation skills. Learn how to build Communities of Practice with Web 2.0 technologies and how to store the information in order to develop a professional learning base.<\/p>\n<p>Outcome for educators: a broader and more detailed understanding of the ways in which digital identity can be established, protected and exploited for the benefit of the educational establishment<\/p>\n<p>Course 3 : Integrating 21st century skills into the classroom<br \/>\nLearn and apply the concepts in using resources for learning, and finding and using digital resources for learning and teaching. Explore cultural archives and maximise their real value for learning and teaching. Practice and apply accessing artefacts and culture through mobile and hand-held technologies. Teachers publishing: creating exemplars for sharing; project learning: all these are ways of building 21st Century Skills into the classroom and developing project Learning through ICT. Use Digital Video as a curriculum tool and explore the affordances for learning of moving images. Increase your understanding and appreciation of visual learning, and what is meant by visual digital literacy.<\/p>\n<p>Outcome for educators: a detailed understanding of how digital learning tools can be used to enrich teaching and learning in the classroom and in the professional learning<\/p>\n<p>Course 4: assessing the value of social networking and gaming in learning<br \/>\nSocial networking: blogging for teachers: blogging as newsletters and community exchange all connect teachers with their colleagues across the word. No longer are classroom wall barriers to collaboration! Explore the ways in which educational games can transform the learning dynamics and outcomes in the classroom and increase student motivation and attainment. Use immersive worlds in education as a way forwards in extending the classroom for learners. Learn how to use elements from the video gaming community in your own teaching and learning, and explore how this will reinforce your learners’ digital literacy and digital safety. These are just some of the ways for keeping safe without limiting students’ creativity.<\/p>\n<p>Outcome for educators: gaining a practical understanding of the potential learning involved in social networking and gaming as well as how to guard against the dangers .<\/p>\n<p>Course 5 : revisiting summative, diagnostic and formative assessment from a digital perspective<br \/>\nThe course will begin with collaborative definitions of the assessment terminology and the attitudes that underlie the applications of these different methods indifferent educational establishments. Attention will also be given to the fact that the majority of educational assessment is based on written artefacts. The participants will consider the value of multimodal resources created by learners and what kinds of new and effective assessment tools are available to assess them. Participants will:<\/p>\n<p>use a range of tools to assess multimodal artefacts;<br \/>\nevaluate the effectiveness of the tools and their assessment utility;<br \/>\ntake away a multimodal assessment toolkit for use with learners.<br \/>\nOutcome for educators: an opportunity to revisit the meaning of different forms of assessment and how they impact on the culture of a learning institution with a particular emphasis on the influence of digital tools for assessment.<\/p>\n<p>Course 6 Concept mapping: building and disseminating collaborative knowledge in personal and professional contexts<br \/>\nMost educators have been trained to work at high levels in reading and writing but their capacity to communicate ideas visually has not always been developed. This course offers a practical introduction to a different way of investigating, storing and sharing knowledge using concept maps, sometimes called mind maps. Participants will also learn how to use concept maps as tools for assessment and as a means of encouraging learners who prefer visual modes of learning. On this course educators can explore and develop concept mapping approaches: in action research, in classrooms and in learning communities. Concept mapping can also be used as a means of sharing knowledge between staff members, creating collaborative reports and for gaining genuine consensus in meetings.<\/p>\n<p>Outcome for educators: exploring a mode of visual communication to use experimentally in professional contexts as an alternative, or an addition, to traditional writing techniques.<\/p>\n<p>Additional short courses<\/p>\n<p>Colleagues can develop a bespoke CPD programme that includes other short courses as well. The titles include:<\/p>\n<p>Using Video as a curriculum tool.<br \/>\nTo ban, or not to ban? Social networking.<br \/>\nBuilding 21st Century Skills into the classroom. Project Learning through ICT.<br \/>\nThe Autonomous Learner. Building a personal learning network.<br \/>\nTools for multimodal assessment.<br \/>\nChocolate-coated broccoli. Educational Games.<br \/>\nSkills for virtual environments: developing e-facilitation skills.<br \/>\nUn-What? Making unconferences work for your organisation.<br \/>\nWeb 2.0: 50 tools, 50 great ideas on how to use them.<br \/>\ne-Safety;  planning the strategy, minimising the risk.<br \/>\nICT and getting what you want<br \/>\nClosing the Gap: Industry Education partnership in digital resource design<br \/>\nDoing research in the classroom: a means of learning enrichment<br \/>\nRaising Attainment and Bloom’s Taxonomy<\/p>\n<p>Numbers and costing will be subject to discussions.<\/p>\n<p>&#101;&#110;&#x71;u&#105;&#x72;&#x69;e&#115;&#x40;&#x6d;i&#114;&#x61;n&#100;&#x61;&#x6e;e&#116;&#x2e;&#x61;c&#46;&#x75;k<\/p>\n<p>More details can be found here<a title=\"MirandaNet professional development programmes\" href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/professional-development-programmes\/\"> : http:\/\/www.mirandanet.org.uk\/consultancy\/about-us\/professional-development-programmes\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; Below are some MirandaNet Action Research Exemplar Modules accredited at certificate, diploma, masters and doctorate level. The MirandaNet iCatalyst Academy offers a basic programme in digital technologies that can be mixed and matched. This programme consists of 6 one &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/action-research-the-main-principles\/icatalyst-cpd-programme\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":319,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/161"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=161"}],"version-history":[{"count":16,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/161\/revisions"}],"predecessor-version":[{"id":2547,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/161\/revisions\/2547"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/319"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}