{"id":1721,"date":"2012-05-28T22:13:36","date_gmt":"2012-05-28T21:13:36","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=1721"},"modified":"2013-03-01T22:41:40","modified_gmt":"2013-03-01T21:41:40","slug":"can-schools-throw-out-their-computers","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/can-schools-throw-out-their-computers\/","title":{"rendered":"Can schools throw out their computers&#8230;"},"content":{"rendered":"<p><strong>Can schools throw out their computers now that the ICT Curriculum is being threatened with disapplication?<\/strong><\/p>\n<p><strong>Unexpected results from consultation<\/strong><br \/>\nRegional advisers and school cluster trainers in Information and Communications Technology (ICT) have been disappearing since the Coalition took over in the UK two years ago. But now there are indications that some teachers of ICT in schools will lose their jobs at the end of this academic year. The reason is that <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/keynotes-and-papers\/%20\">in his address<\/a> to BETT12 in January, Michael Gove set up <a href=\"http:\/\/www.education.gov.uk\/schools\/teachingandlearning\/curriculum\/nationalcurriculum\/a00202110\/ict-curriculum-consultation\">the consultation<\/a> about the disapplication of the ICT curriculum. If disapplication goes through in September it will mean that heads no longer have to be accountable to Ofsted for the use of digital technologies in teaching and learning in their schools. Some heads are already taking advantage of the apparent lack of political support to economise on ICT provision. The danger is that if a new ICT curriculum is agreed there will be few staff trainers, advisers and commercial providers left to deliver it. Meanwhile master level course in universities are seriously threatened by the move to school based training.<\/p>\n<p><strong>Speaking against disapplication<\/strong><br \/>\nThe MirandaNet Fellowship is a professional organization of educators who are interested in making the most of digital technologies to improve learning at all phases. They submitted a reply to the consultation this April that is emphatically against the immediate disapplication of the ICT curriculum. The greatest concern is a time lag between dis applying the existing curriculum and agreeing a new approach. Members fear varying standards in schools could result in reduced entitlement for pupils with postcode lottery provision : some schools might chose to avoid digital technologies altogether. Disapplication is likely to have most impact on those who are not well equipped at home and those whose parents are not supervising their children or who have little understanding of the issues.<\/p>\n<p>In this context, the MirandaNet community have significant concerns about the existing lack of government policy in ICT for the academies in this field. Even greater concerns are reserved for ‘free schools’ where teachers might be employed by school leaders with no educational background. Temporary learning environments, limited funding and lack of access to affordable training will disadvantage the most vulnerable pupils who have no adult guidance in this area &#8211; with implications in the field of e-safety for example.<\/p>\n<p>What will also be lost in disapplication are economies of scale. It is important that companies in this area have some idea of what will be required in order to keep prices down for regions and clusters.<\/p>\n<p><strong>A good time for a review of the ICT curriculum<\/strong><br \/>\nNevertheless, MirandaNet Fellows believe that this is a good time for a review because the current UK ICT curriculum is out of date. Since 1992 MirandaNet has worked in a wide range of countries amongst the 80 where the organisation has members: Argentina, Bulgaria, China, Chile, Czech Republic, Friesland, India, Norway, Mexico, Saudi Arabia, South Africa and Syria. These international MirandaNet members see UK practitioners as leaders in the field of ICT in schools and in teachers’ professional development. They are waiting for a lead after a period in which there has been some uncertainty about UK government support for UK plc activities in this field.This consultation with those with an interest in ICT will ensure that the UK remains a leader in this important area of global education as long as the concerns of players in the field are heard.<\/p>\n<p>Feedback from MirandaNet schools in England also indicates that they are looking to government for a clear direction &#8211; disapplication will not provide clarity in a subject that is more contested than others on the curriculum. Whereas members agree that the current ICT curriculum urgently needs review, they feel that disapplication will not only send a message to schools this area is no longer important to the DfE but also to colleagues across the world.<\/p>\n<p>In the light of these concerns, MirandaNet members recommend that whilst the new curriculum is being developed, the existing curriculum should remain mandatory. The most effective method of ensuring continuity would be gradual change in which full professional ownership of change is maintained.<\/p>\n<p><strong>The big picture matters<\/strong><br \/>\nDrawing on an article on the website DML Central from the American commentator Lyndsay Grant, one Fellow pointed out that before indulging in the detail about what the new ICT Curriculum should look like, the UK Coalition needs to develop a clear political direction on why digital technologies are important in schools that aspire to international excellence. It will be much easier to define the details of the curriculum if there is a debate about, for instance, whether enthusiasm for digital media in education stems from a desire to improve computing skills to support the digital economy and entrepreneurship; or to teach coding as part of a subversive and empowering approach that enables ordinary people to take control of the structures they live and work within?. Do the politicians believe that schools need to keep up with the rapid pace of technological change in the modern world to remain relevant to students’ lives outside school, or because digital media makes study more effective? Is the national plan to reflect a desire to equip young people with the skills to participate in new media networks, or to defend themselves against pervasive and potentially harmful media messages? Can digital technologies be used to open up new educational inequalities and as a way to combat social disadvantage?<\/p>\n<p>Of course the use of digital technologies can deliver a combination of any of the above and more. But in order to have the full engagement of the profession in the direction that the politicians plan to take it is important that a consensus is achieved about these wider issues and that teacher education rises to the challenge of thinking at these levels of complexity.<\/p>\n<p><strong>The introduction of computer science<\/strong><br \/>\nDuring the last few months the lobby for the introduction of computer science as opposed to ICT has gained ground. MirandaNet members welcomed this trend. The general MirandaNet view about the need for balance between the old curriculum and the new was summed up by one teacher educator as follows:<em><\/em><\/p>\n<p><em>The computing lobby has done a great job in starting this debate off by identifying those things that are distinctive about ICT and which were in danger of disappearing. And the renewed enthusiasm for programming and app building from an early age can only be a good thing. We do, however, others are suggesting, need some way of accounting for pedagogy and learning experiences that use social media and technology outside the formal settings and see how these can be built on inside. Otherwise the future will, as usual, be endlessly deferred.<\/em><\/p>\n<p>Computer Science was seen to have the potential to motivate a group of young people, talented in this area, who may be disenfranchised by the current offering. Members would like to see this approach to computer science based on problem solving with a strong emphasis on designs and systems above programming detail which will be difficult to keep current.<\/p>\n<p>The Fellowship’s views on the value of the design and problem solving aspects of computer science in schools are heavily influenced by the partnership with Czech Miranda members whose students are engaged in winning software design competitions all over the world.<br \/>\nHowever, there were also concerns from an assistant head teacher in charge of e-learning about the potential loss of current good practice:<\/p>\n<p><em>A concern that remains for me is the ditching of much of the good practice to be found in design principles in favour of programming. Without good design being coupled to programming, our younger audiences wouldn&#8217;t dream of using an ill-designed app. I believe that design again should be couched in terms of providing solutions to a given scenario.<\/em><\/p>\n<p>Another School Improvement Adviser warned against the kind of programming lessons he had seen in the past:<\/p>\n<p><em>Rather than get bogged down in the content of the curriculum, whether we should do programming or use office applications and so on is not something I feel particularly passionate about. We did programming in the past just as badly as we did using office typing applications more recently &#8211; and no doubt we will end up seeing the same sorts of lessons we saw then &#8211; two weeks on nested loops!<\/em><\/p>\n<p><em>What is more challenging is how to determine what we want as an output. There are a number of projects around the world that explore just what sort of competencies we should encourage in our young people and our teachers. As an example the <a href=\"http:\/\/www.iste.org\/standards\/nets-for-students.aspx\">ISTE Nets <\/a>standards would transform the learning experience were a school to develop its curriculum around them. It would not really matter what the content was or what applications were used but it would make the construction of the learning journey for young people far more stimulating.<\/em><\/p>\n<p>Balance between theory and practice is always an issue in a crowded curriculum but one of the MirandaNet policy makers drew a challenging distinction between long standing principles of computing and the rapid obsolescence of hardware and software:<\/p>\n<p><em>If you have a good grounding in the fundamentals (slow evolution) the rapid change in the tools doesn&#8217;t need much &#8220;teaching&#8221;. If all you have is the tools and no grounding no amount of teaching will keep you up to date.<\/em><\/p>\n<p><em>For example the skills of creative writing don&#8217;t change at the same pace as the tools for learning to type and word processing. Don&#8217;t fall into lumping all tools together as X weeks\/months\/years out of date. It&#8217;s like saying we shouldn&#8217;t teach Dickens or Austen as they are obviously a century out of date.<\/em><\/p>\n<p>What is required is an ICT curriculum that can nurture those who will leave school with different needs: both the IT specialists of the future, business leaders who understand, the possibilities that technology affords and educators who can use the tools to improve pedagogy.<\/p>\n<p><strong>Taking a new view of ICT<\/strong><br \/>\nIn such a fast moving area as computing members expect an emphasis on generic skills and understanding, rather than learning about specific hardware and software &#8211; the latter approach will give the curriculum too short a life.<\/p>\n<p>In terms of how the new curriculum is organized one company member sent a detailed answer:<\/p>\n<p><em>The separation of the use of tools from the creation of tools would make for a good structure, as in pure and applied maths. Much of the applied could be more heavily e-learning based, while the pure would need more teacher input. The problem is we have more capable in the former than the latter.<\/em><\/p>\n<p><em>While the tools changes annually as new ones develop, the underlying theory is much more stable. Systems, analysis and synthesis, logic and algorithms, programming and testing are more stable from a curriculum perspective.<\/em><\/p>\n<p><em>The applied tools would be better embedded in curriculum, where relevant. For example, word-processing is part of writing, not ICT. Spreadsheets could be embedded in maths for example.<\/em><\/p>\n<p><em>The difficulty over curriculum is the &#8220;subject straight jacket&#8221;. ICT is a particular problem, but until we step back and look at general competencies rather than history versus science versus arts, we are rearranging decks chairs on Titanic.<\/em><\/p>\n<p>This view was popular. Other members applauded a similar approach from the Naace professional organization that divided the curriculum into Digital Life, Digital Tools and Digital Technologies.<\/p>\n<p>In terms of curriculum detail, one teacher was representative of a trend:<\/p>\n<p><em>My curriculum would start from the uses to which ICTs are put in the real world &#8211; to present information in a range of formats, to handle\/analyse information and numeric data, to create systems, for business or entertainment or communication, to model or control systems, to design graphics and animation and so on. (The old National Strategy materials are not so irrelevant here &#8211; just need updating and developing). Then I would choose scenarios that I thought would interest and motivate my pupils. Then I would choose a range of software which was easily accessible, widely used, fit for purpose. And that changes year on year. 3 years ago, I couldn&#8217;t consider App Inventor &#8211; now I can.<\/em><\/p>\n<p>There was some discussion about the value of teaching pupils to use blogs. One teacher saw this as recreational, whereas several others replied about the value of student ownership of content. This was a typical response, but this time from a teacher in New Zealand:<\/p>\n<p><em>To say blogging is &#8216;recreational&#8217; first and foremost is to not notice what is happening internationally. Blogs can be informative, educational, and incendiary. If you have a well-designed pedagogical purpose, a blog can help reluctant writers to craft and polish their ideas for an audience. See this from Bolton in England, for example: <a href=\"http:\/\/bit.ly\/yBFsBC\">http:\/\/bit.ly\/yBFsBC<\/a>. I don&#8217;t know much about the UK standards, but a focus on learning purposes via digital technologies seems sensible to me &#8211; because the technicalities of a piece of software keep changing, or its demise can be swift, knowing what to do is not as important as knowing how, why and when. Adaptability, critique and transference are key thinking and practice skills when applied to digital scenarios and texts.<\/em><\/p>\n<p>One teacher and adviser, who is well networked, explained eloquently where how some schools are using networks for collaborative work:<\/p>\n<p><em>[What the profession would welcome from our government] is an understanding that digital literacy and digital culture is here to stay &#8211; e-books have overtaken paper print books on sales on Amazon now for example. The cultural change around the connectedness means that the community, as a whole, is far more agile &#8211; the community is the context for change.<\/em><\/p>\n<p><em>That ICT and the communications systems it can co-opt can form the basis of school-wide communications network with the local community that does the heavy lifting if carefully managed. The CIC Social Media for Schools is set up to show exemplars of that emergent trend in schools. We are having the first large scale conference around exemplars in the Autumn after the Olympics.<\/em><\/p>\n<p>These points were ratified by a teacher from Pakistan who spoke from the global point of view:<\/p>\n<p><em>The curriculum of any school today should emphasize those aspects of ICT which promote connectivity and collaboration to ensure increased frequency of interaction in order to enable learners around the world to collaborate and engage in dialogue. [This is so important] for their career and life skills.<\/em><\/p>\n<p>Another area that members felt needs careful consideration is the value of digital technologies in teaching, learning and assessment for all teachers in all schools.<\/p>\n<p>Members from teacher education agreed with the emergence of a significant overlap developing between digital literacy and media literacy and would like to see far more emphasis on this area. This was well described by a company participant that brings clarity to what should be in an ICT curriculum, what ever that is called, and what elements are of more general interest:<\/p>\n<p><em>The problem with using just &#8216;computing&#8217; as the subject name is that it would take emphasis from those parts that are not computing science, that are vital for all. The concepts behind spreadsheets are not &#8216;computing&#8217;, they are mathematical and information handling concepts. Neither are the concepts behind interface design &#8216;computing&#8217;, they are about designing for audiences and artistic and graphical ways of guiding attention. And in the Facebook world of social design, the key understanding is how personal information is obtained, aggregated and analysed and then used to manipulate user experiences. And there could be a good argument in the school as to where that should fit in the curriculum, but it&#8217;s not computing. The only computing part is the actual algorithms used.<\/em><\/p>\n<p>In fact, many members believe that democracy will only be preserved if attention is given to developing higher order thinking skills in evaluating web content and provenance in our schools. Working collaboratively is also one of the main advantages of using digital technologies well. These are cross curricula issues. Many teachers and senior managers will benefit from sophisticated training to be able to deal with the challenges in this field with the aim of celebrating learning taking place beyond the classroom.<\/p>\n<p>One wise ex-teacher who is now in advisory work had a word of warning for those engaged in this difficult design exercise:<\/p>\n<p><em>I worry about a ‘no win’ situation where you have either- a prescriptive curriculum- and then find we are stuck with something that is overly rigid and goes out of date quickly- or a very open curriculum which then gets largely ignored because it is not compulsory<\/em>.<\/p>\n<p><em>In my experience the fear of Ofsted or the senior management team was the largest factor in stopping a curriculum from developing or innovating (which it needn&#8217;t have been).<\/em><\/p>\n<p><em>There seems to be many great curricula just out, or being developed for ICT, I&#8217;m in favour of the professional teachers having some freedom to pick choose but I wonder how this can be done while making sure ICT remains important and delivered well?<\/em><\/p>\n<p><strong>Cutting accountability in ICT studies<\/strong><br \/>\nOn the issue of accountability the members thought that current assessment procedures should be retained until there had been adequate thinking about what should replace them. Too much will be lost if there is a hiatus in provision. One clear issue was the changes in assessment demanded now that so much content is available and teachers are no longer the gatekeepers of information:<\/p>\n<p><em>[Look at] the agency of Tunes U, as major Universities and other educational establishments and providers make their resources and lectures available on a global scale. Likewise with YouTube channels and platforms such as the Khan academy. Whether you agree with the format or not, such initiatives are significant and are likely to change the learning landscape considerably. There are good things going on in our classrooms, unfortunately, often behind closed doors: one is the timely launch of TED-Ed (<a href=\"http:\/\/education.ted.com\/\">http:\/\/education.ted.com<\/a>) &#8211; an initiative to crowd-source good teachers, good lesson ideas and innovative animators to create and distribute freely inspirational learning resources, some examples can be seen on the associated YouTube channel <a href=\"http:\/\/www.youtube.com\/user\/TEDEducation\">www.youtube.com\/user\/TEDEducation<\/a>.<\/em><\/p>\n<p><em>I believe the &#8216;across the curriculum&#8217; v &#8216;specialist subject&#8217; arguments is a blind alley, it assumes there will be no change in pedagogical practice in years to come, (it is easy to see why given the current data focussed assessment instruments), but we need to look beyond those. Others on this list have argued the respective cases for each well enough so I won&#8217;t go there except to say we need to look even beyond that. The trouble is most people find it easier to focus on the minutiae and selective detail rather<\/em><br \/>\n<em> than see the bigger picture and see the connectedness of things, the connectedness of subjects, the connectedness of ICT.<\/em><\/p>\n<p><em>The current state of flux may allow us to do that &#8211; if Michael Gove wants us to wikify education &#8230; let&#8217;s go for it.<\/em><\/p>\n<p>In order to provide opportunities for pupils show their wider knowledge, some members preferred contextualized technologies developed in projects and assessed through portfolios. An example of this suggestion was from an experience adviser who wanted more opportunities to assess pupil agency:<\/p>\n<p><em>That is something I see again and again as one element in change &#8211; that of pupil agency or if you want a less buzz-wordy description &#8211; having a choice and being able to act on it. If you don&#8217;t ask pupils what they are capable of you miss the rich resources all around you and what pupils are capable of within their contexts as well as the schools. A really enlightened school and management will try to marry those surely? Or at least find a way if it works&#8230; and I&#8217;m not talking about paying lip-service to pupil surveys here.<\/em><\/p>\n<p>In the future, members suggest there is a need for new categories of assessment in digital technologies that distinguish between learning about the computer algorithms that underlie digital output, the products that are created in school and the educational innovation that is emerging in some schools because students have increasing access to information on the web and to social networks. Members experience is that when schools experiment in this area the motivation to learn increases with an attendant impact on achievement. One company adviser said:<\/p>\n<p><em>It is hard for schools and teachers to realise that when new and more relevant approaches to the curriculum and teaching\/learning are adopted, there can be a significant change in pupils&#8217; attitudes to school, with them starting to take more responsibility for their learning. With the result that learning and teaching get re-balanced with a lot more learning happening out of class. And where this is &#8216;content&#8217; learning, there is now hugely more help and support for this accessible online. Schools don&#8217;t always realise what is possible until they try it and I have heard many expressions of surprise from teachers and senior managers about just how much change proves possible.<\/em><\/p>\n<p>One teacher explained what they are doing in the networked context which demands more attention to assessment of collaborative engagement in learning:<\/p>\n<p><em>How we all connect in smarter ways is how the best schools will develop, and ICT will underpin those changes, but in turn will be underpinned by social change driven by interconnectedness. The use of networked media to facilitate formative assessment and co-construction of curricular materials through collaborative working could be another lever to change”.<\/em><\/p>\n<p><em>It is important that assessment of this kind of learning is not omitted from new assessment structures because it will be more challenging than conventional assessment of schools. Will there be enough scaffolding for those who need to assess this kind of collaboration through connectiveness?<\/em><\/p>\n<p>More work needs to be done in this area to ensure that the curriculum can raise motivation and achievement in new ways but can still be assessed by the current assessors.<\/p>\n<p>In the context of assessment members have concerns that some OFSTED inspectors lack convincing understanding on where ICT is well used and are not sufficiently perceptive where it is not. Some of our members cite inspections where there was little understanding of the impact on achievement of the digital technologies that put students in more control of their learning and that engage the wider community. In other cases members saw a reluctance to give this observation adequate weight. The commitment of the Coalition will be vital in improving the standard of reports from OFSTED inspections in the field of the future of digital technologies as outlined in Michael Gove’s speech at BETT12. Too much consideration of content might obscure the needs of learners as they cope with the challenges of the future.<\/p>\n<p><strong>Engaging the teaching profession<\/strong><br \/>\nThe MirandaNet debate concluded with the conviction that the ICT curriculum planning venture will stand or fall by the engagement of the profession, the quality of professional development and the support that educators are given nationally to safeguard what already works as well as implementing agreed changes.<\/p>\n<p>The MirandaNet community expertise is most particularly in researching and delivering continuing professional development (CPD) in digital technologies and the management of change. In this context, one member commented: <em>“Whatever goes into the new orders won&#8217;t have any impact unless the CPD of teachers is good enough”.<\/em><\/p>\n<p>Another member was concerned that there seems to be an assumption that ICT trained teachers will be ready to become computing specialists and adapt to new examination syllabuses.<\/p>\n<p>The evidence of MirandaNet research suggests that, apart from support from industry, the trainers of teachers will require professional development themselves to ensure that there are enough teachers who can met the new requirements. This evidence first emerged in the 2004 MirandaNet evaluation of the <a href=\"http:\/\/www.mirandanet.org.uk\/tta\">New Opportunities Fund ICT teacher training programme for the Teacher Training Agency (1999 – 2003)<\/a>. This study highlights the reasons why this programme, popularly called NOF, was not as successful as had been hoped. One reason was that the teachers rejected the trainers from the companies running the programme who had not had training in how to work in schools. A more telling problem was that there were not enough advisers in the system who could offer higher order skills in the subject. Funding was offered for all the teachers in the system to be trained, but there had been no planning for the advisers and trainer professional development beforehand. Other MirandaNet studies in Brazil and Argentina have highlighted similar challenges for national programmes.<\/p>\n<p>Since then MirandaNet has been chosen to research this topic from several national angles, the most recent study being, <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/\">The ICT CPD Landscape<\/a>, published in 2010. Although the NOF evaluation and this latest study of ICT CPD are six years apart the underlying national problem has not been solved. In fact the training for teachers in ICT is becoming more fragmented, inconsistent in quality and content and frequently only at skills level. Most importantly this training of teachers by independent advisers, school trainers and company providers is very often not successful because the advisers and trainers have not been given adequate training at Master level themselves. Another issue is that in interviewing the various kinds of providers we found that evaluation of courses was rare. These providers who often work alone of necessity are self-trained &#8211; they are outstanding in application, but poor in theory. This tends to make learning about digital technologies a matter of skills only. Because these advisers and school trainers are not trained in the theory themselves they have also been observed dissuading teachers from embarking on the masters and doctoral routes.<\/p>\n<p>Mindful of this evidence from research Fellows developed the <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/professional-development-programmes\/\">iCatalyst programme<\/a> that combines theory and practice with action in the classroom. It has the advantage that this can be undertaken in groups at different academic levels from certificate to doctorate. Bespoke <a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/case-studies\/\">iCatalyst programmes<\/a> developed, internationally, show that this approach is particularly suitable for those who are designated to train other teachers and promotes a collaborative approach to teaching and learning in schools that can result in agreed and embedded change. MirandaNet company associates are encouraged to engage in the design of the projects and, in supervising action research in schools, associates can also gain professional qualifications themselves. Members also suggested more mentoring and coaching relationships with industry for staff trainers, advisers and university teacher educators who are teaching teachers and the teachers of teachers.<br \/>\n<strong><\/strong><\/p>\n<p><strong>The role of industry<\/strong><br \/>\nThe Coalition expects a greater contribution to education from industry than New Labour did. This approach did not perturb MirandaNet members as associates already work in some modules of iCatalyst; teachers and their pupils work on action research projects in the classroom that have decided within the remit of the school development plan. The findings are used to make changes in teaching and learning that benefit the school and provide marketing copy for the funding company.<\/p>\n<p>However, there are tensions for teachers who undertake professional development programmes alongside their day job:<\/p>\n<p><em>For all us practising teachers out here &#8211; the reality is that with the school timetable split up the way it is into one hour slots &#8211; and perhaps one lesson a week for ICT &#8211; bang goes continuity &#8211; and the other constraints of an education system mean that it is difficult to agree with the practicality of ideals in ICT. I am sure many teachers do think of themselves as educators and try hard to use approaches which motivate and challenge their pupils &#8211; but the reality is, we have got to get the coursework done by a deadline!<\/em><\/p>\n<p>In this context, members felt that the support of the senior management team is vital for teachers who are undertaking post graduate qualifications. In addition, the most successful iCatalyst programmes in terms of academic achievement have been when the teacher has been paid an honorarium of about £2,000 that helps towards paying for time for study or for action research expenses. This was based on the Department for Education and Skills Practice Based Research Bursaries that were stopped about 8 years ago. In some cases funding companies will pay expense for meetings and residential courses when their representatives also gain from working in action research with teachers.<\/p>\n<p>Members suggested that this model could also be developed with industry partners with particular reference to problem solving projects in computer science that might involve company personnel in the teaching of programming. This is a specialist area that may well be outside the training capacity of classroom teachers. It is best undertaken by company representatives who can stay up to date in cooperation with the school. These more ‘specialist’ experts could be pooled across a group of schools.<\/p>\n<p><strong>The future of professional masters courses<\/strong><br \/>\nA fundamental MirandaNet strategy is dedicated towards raising standards in English education by increasing a students’ ability over the years to analyse, evaluate and synthesis all the information that is now at their finger tips. Yet our research suggests that many of the independent consultants, schools trainers and regional advisers who are now training teachers about digital technologies in schools do not have the theoretical knowledge to raise the level of higher order thinking in the profession in this discipline. Yet the politicians are not supporting teacher education in the universities. The direction of policy in England over at least the last 14 years has raised questions about teacher education as an academic field. Current Coalition policy pushes this direction even further. Yet more highly qualified teachers and master’s level qualifications continue to be aspirations, and all the existing evidence shows that university-led teacher education provision is both extremely high quality and cost efficient, more so than any of the ‘alternative’ systems preferred. If teachers are required to take on yet another discipline, Computer Science, then government promotion of masters and doctoral programmes must be stronger if the goal they are working towards is the international excellence of our schools.<\/p>\n<p>Dr Christina Preston<br \/>\nProfessor of Educational Innovation<br \/>\nFounder of the MirandaNet Fellowship<br \/>\nUniversity of Bedfordshire<\/p>\n<p>This article was based on the opinions expressed by members of the Learning Futures Centre at the University of Bedfordshire and MirandaNet Fellowship. The views of forty English members from policy making, teaching, senior management, teacher education, ICT advisers and supporting companies with relevant additions from colleagues in the Czech Republic, Germany, New Zealand and Pakistan. The debate took place over three weeks in March 2012.<\/p>\n<p>The Learning Futures Centre at Bedfordshire is a new venture dedicated to support collaborative research to drive development in teacher education, curriculum and pedagogy using current and emerging technologies. Members form a bridge with the international MirandaNet Fellowship that Dr Preston established in 1992. This submission to the Department for Education represents the first joint report of this partnership.<\/p>\n<p>Dr Preston is a newly appointed Professor of Educational Innovation at the University at Bedfordshire where the MirandaNet professional development programme called iCatalyst is now being accredited. The programme offers a management of change approach to teachers’ learning that involves a whole school staff in rethinking their approach to teaching and learning based on action research principles. The judicious use of digital technologies is investigated as a means of improving learner motivation and aspiration as well as a way of involving the wider community.<\/p>\n<p>The MirandaNet Fellowship is non-profit making professional organisation that works with over 800 members through an e-community of practice consisting of international ICT policy makers, teachers, advisers, teacher educators, researchers and commercial companies in over 70 countries. The Fellowship, popularly called the Face Book of the international ICT community, has been mentioned by UNESCO as one of the most highly-regarded global influencers in the use of digital technologies to enhance learning and for teacher education. The following report has been drawn from the active internal online forum where international professionals from different specialisms share experience, expertise and philosophical approaches about how these digital technologies are best used in teaching and learning.<\/p>\n<p>One of cost effective ways that this community of practice learns from each other informally is through a form of online ‘unconference’ called a <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMod<\/a>. In these events a wide range of education professionals choose a theme for a face-to-face meeting. But others join in across national boundaries, using a range of such digital communications technologies as video conferencing, microblogging and collaborative concept maps that emphasise the social element of learning. This professional development event is thus widely disseminated, both synchronously and asynchronously, through the resources that are archived on the MirandaNet website.<\/p>\n<p>MirandaNet Fellows also publish in <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/\">international journals<\/a> with particular expertise in building knowledge online, innovative Continuing Professional Development (CPD) programmes for the educational workforce and the effective use of digital technologies in the curriculum and for learning.<\/p>\n<p>The Fellowship that works closely with BESA is largely funded by subscriptions from companies who are keen to work with practitioners in action research projects. Associates involved in action research projects in continuing professional development range from small companies like Radio Waves, Immersive Education, Iris, Light Speed and Quest Atlantic to multinationals like Apple, Toshiba, Hewlett Packard, Microsoft, Nelson Thornes, Oracle and Steljes.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Can schools throw out their computers now that the ICT Curriculum is being threatened with disapplication? Unexpected results from consultation Regional advisers and school cluster trainers in Information and Communications Technology (ICT) have been disappearing since the Coalition took over &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/can-schools-throw-out-their-computers\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":4058,"menu_order":120,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1721"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=1721"}],"version-history":[{"count":5,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1721\/revisions"}],"predecessor-version":[{"id":1723,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1721\/revisions\/1723"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4058"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=1721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}