{"id":1725,"date":"2012-05-28T22:23:05","date_gmt":"2012-05-28T21:23:05","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=1725"},"modified":"2014-07-15T17:40:53","modified_gmt":"2014-07-15T16:40:53","slug":"is-there-an-alternative-to-powerpoint-really","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/building-and-sharing-professional-knowledge\/is-there-an-alternative-to-powerpoint-really\/","title":{"rendered":"Is there really an alternative to Powerpoint?"},"content":{"rendered":"<p>Of course it is not that simple &#8211; although some excellent alternatives to PowerPoint have been offered in the MirandaLink debate about effective presentations: Prezi, Keynote, Articulate Studio, Xerte, Timtoast.com, Google Earth and Sketchup and others…as well as some warnings about them all &#8211; as Chris Yapp said it depends on what you want to do. Here are some good sample presentations that Leon Cych recommends:<\/p>\n<p><a href=\"http:\/\/www.youtube.com\/user\/CGPGrey?feature=watch\">CGP Grey on YouTube<\/a><br \/>\n<a href=\"http:\/\/present.me\/view\/3642-garr-reynolds-presentation-zen\">Garr Reynolds<\/a> and<br \/>\n<a href=\"http:\/\/www.youtube.com\/watch?v=liQLdRk0Ziw\">Guy Kawasaki<\/a><br \/>\nIn addition in the course of this study I’ve come across a collection of information about digital presentations in general, Scoop it, which might have some useful suggestions: <a href=\"http:\/\/www.scoop.it\/t\/digital-presentations-in%20education?_tmc=Jr8AKnTmsH5EsboUCt18M5kRY0zDi7gSS17cr-faj38\">Scoop it<\/a><\/p>\n<p>I also found Slide:ology by Nancy Duarte and her follow up book on storytelling with PowerPoint – Resonate. Edward Tufte is also thought provoking on the cognitivestyle of Powerpoint: <a href=\"http:\/\/www.edwardtufte.com\/tufte\/books_pp\">http:\/\/www.edwardtufte.com\/tufte\/books_pp<\/a><\/p>\n<p>But it is clear that bad Prezi presentations can be worse than bad Powerpoint presentations – particularly the seasickness effect. Marie Joubert comments wisely that in her view if a presentation is not good it may be because of an expectation that PPT (or whatever) can do the work for the presenter\/teacher &#8211; almost as though the work of the presenter\/teacher is done once the presentation has been made. I return to this point later.<\/p>\n<p>What really matters say MirandaNet members is the producers’ understanding of their audience, their performance ability and their capacity to limit effectively what is on the screen. Using visuals is also recommended. TED talks are also well worth watching for brilliant presentational ideas, but this video medium tends to promote the excellent performance of expert teachers. We do not often see audience engagement on this channel. Leon’s use of tools is outstanding so it is pertinent that he says, “I even just like to talk at times because ideas are often more compelling than specifics.” The performance angle of a presentation is so important: Leon, like other good presenters, is good at engaging and provoking his audience.<\/p>\n<p><strong>The next step in professional learning<\/strong><br \/>\nIn MirandaNet we consider the development of communities of practice as the key to effective professional learning. What matters from the MirandaNet viewpoint is encouraging the audience &#8211; or rather the participants &#8211; in thinking, contributing and reflecting like we do on MirandaLink. It is quite hard for excellent performers to hand over control, but in the context of a MirandaMod (<a href=\"http:\/\/www.mirandanet.org.uk\/mirandaMods\">www.mirandanet.org.uk\/mirandaMods<\/a>) all the participants have something to gain – even those who consider themselves experts in the field.<\/p>\n<p>The MirandaMod process can underpin these learning opportunities. At its best this MirandaMod learning process is intended to engage students and lecturers in higher order thinking through collaboration, locally, nationally and internationally. Many of you know we use a combination of digital technologies for presenting and sharing information: wikis, micro-blogging, video-conferencing, video streaming and remotely authored concept mapping being developed before, during and after the event by anyone who wants to participate. We hope, therefore, that some MirandaNetters will join us online on June 7th when we will be video-streaming from Prague on the topic: <em>What does the 21st century teacher need to know about digital technologies, and why?<\/em> <em>And how will their prowess be assessed?<\/em> (MirandaNet 1630 – 1830 Central European time (1530 – 1730 GMT) (More information in <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/how-can-digital-technologies-support-learners-prague-6th-10th-june\/\">our events section<\/a>)<\/p>\n<p>If you are interested in the theory and pedagogy of collaborative learning read on because Andrea Raiker explains this well in the next section.<\/p>\n<p><strong>Braided Learning theory<\/strong><br \/>\nWe currently call the MirandaMod theoretical and pedagogical approach to the communication of knowledge, Braided Learning. You may be wondering, as we are practitioners, why we should involve ourselves with theory. Well, its all to do with the strengths and weaknesses of being individuals. As individuals we access the world through our senses and the mind processes that information. The mind links the new information to what is already known, understood, misunderstood, conjectured and wraps it up in feelings. The strength of this process is that we each have a unique understanding of the world, and this uniqueness can result in creativity and progress. The weakness is that the process happens in isolation. Our knowledge and understanding is siloed by our minds. There are two ways of getting out of the silo. The first is to experience new things. That&#8217;s great but we can&#8217;t experience everything in time and space. The other way is to read about what others interested in the same topics have thought and said about them. In the academic world, this means reading about theory and and research. Why should we do this? Theory gives ideas that encourages us to question our beliefs about and practice of teaching. If we carry out our own research, using theory and works by scholars and professionals combined with data collected from our own workplaces, we can make our own informed judgments. We can gain insights into what is really happening under the surface of everyday classroom endeavour and activity. We are developing professional autonomy. These things show that we have inquiring, autonomous minds and that we are capable of change. In this uncertain, technologied world, that&#8217;s good for us as professionals, and good for our students. We will also have evidence to challenge practices in schools and beyond.<\/p>\n<p>We have several publications in the pipeline, but you can find those already published here: <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/\">http:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/<\/a><br \/>\nI have posted this article here <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/\">http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Of course it is not that simple &#8211; although some excellent alternatives to PowerPoint have been offered in the MirandaLink debate about effective presentations: Prezi, Keynote, Articulate Studio, Xerte, Timtoast.com, Google Earth and Sketchup and others…as well as some warnings &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/building-and-sharing-professional-knowledge\/is-there-an-alternative-to-powerpoint-really\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":3124,"menu_order":10,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1725"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=1725"}],"version-history":[{"count":10,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1725\/revisions"}],"predecessor-version":[{"id":1727,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1725\/revisions\/1727"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3124"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=1725"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}