{"id":2,"date":"2009-03-30T19:12:57","date_gmt":"2009-03-30T18:12:57","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=2"},"modified":"2014-11-16T23:22:24","modified_gmt":"2014-11-16T22:22:24","slug":"about","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/","title":{"rendered":"About Christina Preston"},"content":{"rendered":"<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2009\/03\/smallchristina.jpg\"><img loading=\"lazy\" class=\"wp-image-429 alignright\" title=\"Dr Christina Preston\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2009\/03\/smallchristina.jpg\" alt=\"\" width=\"200\" height=\"275\" \/><\/a><\/p>\n<p>Since the 1980s has advocated the application of digital technologies as a catalyst for enriching teaching and learning. She specialises in exciting professional development programmes for teachers and research into educational issues.<\/p>\n<p>Some of the evidence she has drawn for her research has been offered by members of the <a href=\"..\/..\/\">MirandaNet Fellowship<\/a>, an international professional organisation for teachers, teacher educators and researchers that she founded in 1992. There are currently more than 1,000 members in 80 countries and the Fellowship has a reach of more than 20,000 other educators.  The indexing is efficient and the site features prominently in Google searches. This global portal is well patronised and, on average, 6,000 unique visitors a month read up to eleven pages.<\/p>\n<p>Her main research publications in educational innovation focus on four topics:<a title=\"Action research\" href=\"..\/..\/blog\/?page_id=319\/\"> action research<\/a>; <a title=\"building communities of practice\" href=\"..\/..\/blog\/?page_id=368\/\">building communities of practice;<\/a><a title=\"concept mapping as a research tool\" href=\"..\/..\/blog\/?page_id=354\">concept mapping as a research tool<\/a> and ethnography with particular interest in <a href=\"..\/..\/blog\/?page_id=310\">critical incident methodology.<\/a> She shares these topics with professionals on the Research Exchange blog where she has also listed her <a title=\"publications\" href=\"..\/..\/blog\/?page_id=5\">publications<\/a>. A key successes in research that tackles the issues of  digital technologies in human activity is the theory and practice of <a href=\"http:\/\/www.mirandanet.org.uk\/blog\/wp-content\/uploads\/2010\/08\/Braided-Learning-First-Monday-2007-.doc\">Braided Learning <\/a>, an emerging analysis of how professionals build knowledge together on line; of innovative multimodal research methodologies for Becta with Professor Marilyn Leask; innovative designs for Masters’ modules and their multimodal accreditation; the development of new modes of knowledge sharing within the profession in communities of practice called <a title=\"MirandaMods\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\">MirandaMods<\/a> that are a modification of the unconference movement, a democratic debate between professionals from different perspectives at all phases  of education.<\/p>\n<p>Christina Preston is Professor of Educational Innovation at the University of Bedfordshire and has won five awards as a result of her international professional development programmes and her research:<strong> Naace UK Lifetime Achievement Award(2013): Global Digital Inclusion Award<\/strong> : University of Jujuy, Argentina (2011); <strong>Trnkova Medal<\/strong> for support in building democratic strategies for ICT teacher education, Czech Technical University 2002 Prague<span style=\"text-decoration: underline;\">; <\/span><strong>World Academic Council Humanitarian Award<\/strong>for the enrichment of community opportunities for Bulgarian teachers and women returnees by creating Anglo-Bulgarian exchange opportunities face-to-face and online World Academic Council, University Neofit Rilski, Blagoevgrad City, Bulgaria (2000 Paris); and, the<strong>European Union of Women of Humanitarian Achievement Award<\/strong> for creating an Anglo-Czech online alliance working on democratic participation, European Union of Women 1998 – London.<\/p>\n<p>Christina gives keynotes and lectures around the world on strategies for building professional knowledge and on Continuing Professional Development programmes designed to promote student ownership of learning agenda. Recent speaking engagements have included Argentina, Australia, China, Japan and New Zealand. Christina is also a co-director of the <a title=\"MirandaNet iCatalyst Academy\" href=\"http:\/\/www.mirandanet.org.uk\/blog\/wp-admin\/post.php?post=161&amp;action=edit&amp;message=1\">MirandaNet iCatalyst Academy<\/a> and Chair of Trustees of <a href=\"https:\/\/wec.mirandanet.org.uk\/\">World Ecitizens charity<\/a> , a website for student publication, established by the MirandaNet Fellows in 2002 after the events of 9\/11 in New York. Other partners in research projects have included Becta, the TDA, the DCSF and the EU, as well as international universities and governments. MirandaNet associate companies who support ICT research, development, dissemination and CPD projects in schools. These companies include: 2Simple, Apple, EMAP, Microsoft, Isis, Inspiration, Promethean, Oracle, Serco, Steljes and Tribal. MirandaNet Fellows have worked in a range of projects associated with digital technologies in education in Bulgaria, China, Chile, Czech Republic, Friesland, India, Norway, Mexico, Saudi Arabia, South Africa and Syria.<\/p>\n<p>Christina’s professional memberships include the British Computer Society, the Society of Authors, the National Association of Advisers in Computers and Education (NAACE), The Association for Learning Technology (ALT) and Information Technology Teachers in Education (ITTE). For the last ten years she has been a moderator on the judging panel of the annual BETT exhibition education awards organised by Becta and The British Education Suppliers Association (BESA).<\/p>\n<p>At the beginning of her career she enjoyed fifteen years experience of teaching in school in English, Drama and Information Technology, followed by four years as an English and Information and Communications technology advisor in Croydon LA and ILLEC. From 1992 she has been an associate researcher and lecturer at the Institute of Education, University of London: from 2004 at the Centre for Work-Based Learning for Education Professionals (WLE). Other research and lecturing associateships up to Masters level include Bath Spa University, Brunel University and the Czech Technical University in Prague.<\/p>\n<p><strong>Skills:<\/strong><\/p>\n<p><strong>Leadership<\/strong><\/p>\n<ul>\n<li>leading in innovation in the fields of research methodology, practice-based learning, continuing professional development, multimodal literacy, digital technologies in teaching and learning and building communities of practice;<\/li>\n<li>running international conferences and unconferences<\/li>\n<li>designing, developing, maintaining and researching a web-based collaborative knowledge creation and publication environment for policy makers, researchers, teacher educators, senior managers and teachers who are also encouraged to publish and influence policy;<\/li>\n<li>OFSTED inspector on IOE team;<\/li>\n<li>evaluator of EU programmes;<\/li>\n<li>peer review of academic papers for key journals.<\/li>\n<\/ul>\n<p><strong>Continuing professional development<\/strong><\/p>\n<ul>\n<li>strategic international leadership in CPD research, programme design and evaluation;<\/li>\n<li>innovating in the design of practice-based CPD programmes for teachers using digital technologies including designing Master modules, establishing multimodal assessment at Masters level in three universities and in China, South Africa and Mexico;<\/li>\n<li>facilitating the international creation and dissemination of knowledge between educators in informal CPD exchanges using a themed MirandaMod version of an unconference.<\/li>\n<li>designing, teaching, managing, mentoring in CPD programmes<\/li>\n<li>course direction, programme design, teaching teachers accreditation and evaluating courses from certificate to masters level face to face and online<\/li>\n<li>bid writing, evaluation and review<\/li>\n<\/ul>\n<p><strong>Research and dissemination<\/strong><\/p>\n<ul>\n<li>designing, implementing and disseminating research projects funded by governments and industry<\/li>\n<li>publishing research reports, academic journal papers, international, newspaper articles, educational software, book chapters, conference proceedings papers<\/li>\n<li>reviewing and editing for academic journals<\/li>\n<li>designing and editing a MirandaNet peer reviewed journal for teachers<\/li>\n<li>designing, directing and implementing research programmes<\/li>\n<\/ul>\n<p><strong>Project management<\/strong><\/p>\n<ul>\n<li>personnel and financial management of large, medium and small research projects<\/li>\n<li>Implementing local, national and international research projects<\/li>\n<li>managing teams of teachers, teacher educators and researchers<\/li>\n<li>sustaining professional communities of practice linked with CPD programmes<\/li>\n<li>managing a professional organisation with more than 700 members<\/li>\n<li>maintaining a global network of colleagues and students in more than 70 countries<\/li>\n<li>planning, organising and running local, national and international conferences and seminar programmes<\/li>\n<li>raising funding from industry and liaising with industrial partners.<\/li>\n<\/ul>\n<p>Other aspects of career are listed under:<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/career-milestones\/\">Career milestones;<\/a> <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/international\/\">international programme<\/a>; <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/research-projects\/\">research projects<\/a>; and <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/professional-memberships-and-roles\/\">professional memberships<\/a>.<\/p>\n<p>Her full cv is<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/full-curriculum-vitae\/\"> here<\/a>.<\/p>\n<p><a>A doctoral journey,<\/a> the preface to her <a href=\"http:\/\/www.mirandanet.org.uk\/blog\/wp-content\/uploads\/2011\/07\/Insightsthesismaster-230211MSv4.1.pdf\">Gaining insights into educators&#8217; understandings of digital technologies<\/a>, explains more about her motivations and aspirations.<\/p>\n<p><strong><br \/>\n<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since the 1980s has advocated the application of digital technologies as a catalyst for enriching teaching and learning. She specialises in exciting professional development programmes for teachers and research into educational issues. Some of the evidence she has drawn for &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":533,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=2"}],"version-history":[{"count":69,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2\/revisions"}],"predecessor-version":[{"id":6616,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2\/revisions\/6616"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/533"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=2"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}