{"id":2160,"date":"2012-07-10T12:35:51","date_gmt":"2012-07-10T11:35:51","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=2160"},"modified":"2012-07-10T17:53:25","modified_gmt":"2012-07-10T16:53:25","slug":"collaborative-learning-university-of-bedfordshire-july-13th-2013","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/keynotes-and-papers\/collaborative-learning-university-of-bedfordshire-july-13th-2013\/","title":{"rendered":"Informal professional learning: Luton, Bedford, Oxford, 2012."},"content":{"rendered":"<h2>Looking at information professional learning<\/h2>\n<p>During the conference season this July, I have been developing a presentation that invites colleagues to discuss the value of the innovative approaches the MirandaNet team has been developing in<a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\"> MirandMods<\/a>, professional unconferences, since 2005.<\/p>\n<p>The presentation, <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/07\/Bedsstudents130712.pdf\">A community of practice: social networking or professional knowledge creation?<\/a>, aims to raise questions about learning that is mediated by digital technologies. I look at how we have been analysing learning when we were only using online written text: an approach we call  <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/research-themes\/braided-learning-in-collaboration\/\">Braided Learning<\/a>. But now multimodal forms of communication have made us question how best to research learning achievement in this new context. Although our research refers to teachers learning our ultimate aim is to support teachers who are trying themselves to understand how children  are learning. A key change is that in the new digital context children have so much more ownership of what to learn and how independent of the classroom agenda.<\/p>\n<p>The July audiences have been staff and students at Bedfordshire University and teacher educators at the ITTE conference which has provided a range of feedback to consider. All this thinking is being channelled into  the draft of a paper that we plan to submit at the end of the summer. Any comments on this draft will be very welcome: &#x63;&#104;r&#x69;&#115;t&#x69;&#x6e;&#97;&#x40;&#x6d;&#105;r&#x61;&#110;d&#x61;&#x6e;&#101;&#x74;&#x2e;&#97;c&#x2e;&#117;k.<\/p>\n<h3> <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/03\/TPE-130512-Master1.doc\">Impacting on policy and practice: exploiting the affordances of digital technologies to encourage active professionals to find their voice.<\/a><\/h3>\n<h4>Christina Preston, Learning Futures Research Centre, University of Bedfordshire<\/h4>\n<h4>Andrea Raiker, Learning Futures Research Centre, University of Bedfordshire<\/h4>\n<h4>John Cuthell, MirandaNet Fellowship<\/h4>\n<h3> Abstract<\/h3>\n<p>This study focuses on an innovative method of disseminating current knowledge, the remotely-authored digital concept map, with the aim of providing a means by which the education profession might influence institutional policy and practice locally, nationally,  or even internationally. In the literature review we highlight two models of Continuing Professional Development (CPD) that are currently available to professionals: formal post graduate learning where the syllabus is agreed by tutors and accreditation boards; and informal learning in professional organisations that manage their own learning agenda, generate pictures of current knowledge and use peer review for quality control. We argue that the models for formal and informal learning are not necessarily mutually exclusive. Indeed, informal learning in communities of practice might be improved by explicit scaffolding to promote higher order cognition. Alternatively, formal learning might be improved by the replication of collaborative techniques that are adopted by informal communities of practice. In addition, these cross fertilization opportunities are strengthened because, in the last three decades, digital technologies have made collaboration across disciplinary silos much easier to achieve. However, a key question is whether developing collaborative learning can be valued and funded in the formal education system. The underlying conundrum is that most educators will not be strongly motivated to explore the value of collaboration as long as governments all over the world link funding to the scores of individual learners.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Looking at information professional learning During the conference season this July, I have been developing a presentation that invites colleagues to discuss the value of the innovative approaches the MirandaNet team has been developing in MirandMods, professional unconferences, since 2005. &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/keynotes-and-papers\/collaborative-learning-university-of-bedfordshire-july-13th-2013\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":474,"menu_order":30,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2160"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=2160"}],"version-history":[{"count":11,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2160\/revisions"}],"predecessor-version":[{"id":2162,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2160\/revisions\/2162"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/474"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=2160"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}