{"id":2210,"date":"2012-07-11T21:08:26","date_gmt":"2012-07-11T20:08:26","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=2210"},"modified":"2013-10-13T12:43:37","modified_gmt":"2013-10-13T11:43:37","slug":"poskole-report-prague-june-2012","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-professional-development\/poskole-report-prague-june-2012\/","title":{"rendered":"What does the 21st century teacher need to know?"},"content":{"rendered":"<h2><strong>And how will their prowess be assessed?<\/strong><\/h2>\n<p><em>Report from the MirandaNet conference in Prague, June 2012, by Christina Preston, England, and Jan Lepeltak, the Netherlands<\/em><\/p>\n<p>Twenty-five participants from Bulgaria, England, Germany, Slovakia, The Czech Republic and The Netherlands met together in Prague, 2012,  to share the latest ideas about educational innovation. Our topic was: What does the 21st century teacher need to know about digital technologies, and why? And how will their prowess be assessed?<\/p>\n<p>The MirandaNet Fellowship organized the conference in partnership with <a href=\"\/researchexchange\/about-the-team\/\">Future Learning Research Centre<\/a>, University of Bedfordshire. In the first place our aim was to come to some conclusions about the international MirandaNet perspective on this topic in order to write briefing papers for policy makers.<\/p>\n<p>Our second aim was to investigate how this opportunity to work closely together can be sustained in supporting professionals who want to learn collaboratively across national boundaries. Central to this aim is the further development of the supporting communications technology: MirandaMods to underpin professional collaborative thinking, research questions and policy making as well as the EdComms online working area.<\/p>\n<p>A summary of the Prague event follows. We called the conference Poskole in order to reference our Czech members organization: Poskole means ‘homework’ &#8211; a kind of joke for Czech teachers. In this summary we have included the links where members can explore subjects that interest them in more detail. There are also links to the draft policy document and an invitation to members to join us in the resulting working parties.<\/p>\n<h2>A summary of the contributions<\/h2>\n<p>The strength of the MirandaNet member who convened in Prague was the variety of their roles in educational innovation: international policy makers, strategists, computer scientists, media consultants, teacher educators, researchers, advisors and practitioners came together to explore the issue of professional development in digital technology – the delegates remarked on the broad perspectives and the depth of vision that avoided the danger of specialists disappearing into silos of knowledge and expertise.<\/p>\n<p>Our aim is to produce a draft policy briefing that each delegate can adapt to inform the strategists in their own local and national milieu.<\/p>\n<h3>Continuing Professional Development and assessment<\/h3>\n<p>A key consideration raised by this international MirandaNet Poskole group was the kind of model of continuing development that was most appropriate for professionals in education. Dr Ivan Kalas, Professor at the Comenius University of Bratislava, Slovakia, provided an overview by concentrating on the need for educational reform led by educators. He addressed several questions: What is modern education and why should we change the present practice? Ivan suggested that across the world we are still training teachers who lack basic skills and train them for the teachers of the past. Key words for Ivan Kalas are: collaboration and self-regulation; education by digital literate teachers; concentrating on learning rather than teaching; and, making education meaningful for pupils and students.<\/p>\n<p>Steve Kendall, the Associate Dean of Partnerships and Director of Widening Participation at the University of Bedfordshire talked about how he sees the role of educators in the 21st century. “It is hard for me to grasp”, he said, “that that future is upon us and that 12% of it has already elapsed. I think that educators need to understand that the digital technologies in evidence at Poskole are used by young people (and other learners). They should be thinking about how those uses might be enhanced and their educational value increased and how to encourage their use to enhance learning. Prowess can be assessed via evidence that their learners are successful.<\/p>\n<p>Rachel Jones, an educational strategist, has around 20 years’ teaching experience in London schools including secondary headship, with the additional challenge of leading the school out of ‘special measures’ (the most severe level of school failure in the UK). In the context of professional development she pointed out the challenge. “The pressure on head teachers and principals in the UK is currently higher than it has ever been.  Targets for pupil attainment are increasing and changes to the Ofsted evaluation schedule mean that schools that thought they were doing reasonably well are no longer considered so. I am keen to explore how as ‘edtech pioneers’ we can collaborate most effectively to promote excellence and to connect our evidence and successes for the long term greater good”.<\/p>\n<p>Gareth Meed, a deputy head teacher in a large primary school in a challenging urban area of Bradford, UK, looked more closely at how the curriculum for teachers should be organized, “If an educator is to be effective in the development of learning then the questions may be: firstly, is knowledge about digital technologies sufficient in itself ?; and, secondly, what kind of educator or what pedagogy is needed to use these technologies most effectively?<\/p>\n<p>Jan Lepeltak, journalist, educator and researcher joined the debate saying: “The challenge I see is:\u2028how can we use ICT to enhance ‘traditional’ skills and stimulate deep-learning?”<\/p>\n<p>This detailed thinking about what educators need to know about digital technologies was followed up by David Obst, a German doctoral research student and Dughall McCormick, a UK adviser from the North of England. David was interested in different experiences and opinions how a) ICT can enrich everyday classes and b) how innovative ideas can be\u2028transferred faster and more effective into school. “Based on observations of the impact of\u2028teacher training I&#8217;m thinking about how we can share\u2028best-practice-examples more easily and if collaborative knowledge\u2028building can help to do support this”. The key questions to be answered were: Knowledge – What should teachers know about ICT, and why? Transfer – How will we be able to transfer or realize that in schools? Assessment – How will their progress be assessed?<\/p>\n<p>Dughall declared himself a passionate advocate for the transformational potential for technologies in education. “Having said this, I worry that too often technology is used to reproduce traditional teaching and learning methods and the challenge is to bring about real change in the face of this – change that reflects the impact that technology is having in wider society. There is the potential for a wholesale shift in the system towards increasingly collaborative and constructivist approaches. Some are moving rapidly in that direction, others are standing still or moving backwards”.<\/p>\n<p>Appropriate content for curricula in digital technologies was the theme of some excellent school projects that were presented by Dr Katya Toneva and Lawrence Williams from the South East of England. Lawrence currently lectures at Brunel University on educational issues after many years in the classroom. Project include on-line cross-curricular teaching materials, STEM activities as a School Science Ambassador, and contributions to widely-used ICT text books edited by Marilyn Leask and Norbert Pachler and published by Routledge.<\/p>\n<p>In terms of introducing computer science our Czech host, Dr Bozena Mannova, stressed the necessity of project-based learning. She brought some secondary students with her who showed the robots they had designed themselves. This was a valuable demonstration from the students whose enthusiasm was palpable about their problem solving projects and about Dr Mannova’s teaching. All these issues will be developed in the working group on professional development model led by Rachel Jones, Steljes, who is a educational strategist.<\/p>\n<p>New modes of assessment were covered by Professor Preston who indicated that the majority of formal examinations for teachers and pupils still focus on writing and multi-choice questions,  “I’d like to see more research into testing through video and audio products, and far more work into valuing collaboration.”<\/p>\n<h3>Modes of professional knowledge sharing<\/h3>\n<p>At the centre of the conference proceeding was a MirandaMod, an online unconference that is designed to promote the sharing of professional knowledge and expertise. Those who could not attend in Prague were able to join in remotely using Google hangouts as well as contributing to the Twitter stream and the collaborative concept map. Andrea Raiker’s talk about the theory of learning that underpins the MirandaMod was well received. She discussed how individuals from different countries with different socio-cultural and personal perspectives but common interests can use the physical and virtual spaces provided by the MirandaMod methodology to learn socio-constructively (Vygotsky, 1986). This happens, she explained, not only by sharing knowledge and understanding but through supporting each other, consciously and unconsciously, in traversing their individual liminal spaces. In doing so the potential for public spheres (Habermas, 1962) to emerge arises, where individuals in a community of enquirers are democratised and can commit to and initiate change. These are key ideas that Andrea, Christina Preston and Marilyn Leask are developing in a series of draft papers. Members are welcome to comment and to join the working group on Learning Theories.<\/p>\n<p>Andrea was supported by the media consultants, Leon Cych (<a href=\"http:\/\/www.l4l.co.uk\/\">www.l4l.co.uk<\/a>) and Theo Kuechel (<a href=\"http:\/\/www.media-and-learning.eu\/node\/280\/lightbox2\">www.media-and-learning.eu\/node\/280\/lightbox2<\/a>) Leon is continually searching out and highlighting good practice in and outside learning institutions. “I document, in video, innovation and grass roots educational activity in the UK; disseminating it as wide as I can using social and mainstream media where possible. My contribution to the MirandMod conferences are to run the live streaming sessions and capture, on video, for research purposes the presentations and debate”.<\/p>\n<p>Theo explained how multimedia can be used for communication and learning in their exciting presentations. Leon will be leading a working group about the use of digital technologies in communication t policy makers from the grassroots of the professions. Theo Kuechel who has been working with Kevin Burden, Director Postgraduate PD, at the University of Hull, has been involved in a number of international projects, involving  e-Content and digital media. He explored the affordances and potential of visual resources allied with digital tools and networks in for learning. He illustrated convincingly how digital curation and collaboration offers new contexts and opportunities for learning.<\/p>\n<p>Professor Carsten Trinitis, like Dr Bozena Mannova, is also a consummate computer scientist with much to add about digital identity and the ways in which people can represent themselves have increased exponentially in the 21st century. In his talk he explored drawing a line between when it does make sense to use digital technologies for teaching and when educators should stay with traditional means of teaching, i.e. non digital ones. He will be leading a working group about the potential and the dangers of representing a persona online and about the ways in which learners can protect themselves from unwanted intrusions into their lives.<\/p>\n<p>In the context of e-safety Professor Christina Preston was concerned that whereas digital technologies are creating new opportunities for  communication that require capacity in multiliteracies some educators are locking down the internet in the learning institution. “This area of multiliteracies and media issues is where I believe the profession can best prepare students to understand their responsibilities as adults and world ecitizens.  Locking down the internet is an abnegation of our professional responsibilities as educators. We need more positive strategies to deal with this challenge.”<\/p>\n<p>Dr Marilyn Leask, Professor of Educational Knowledge Management, Learning Futures Research Centre, University of Bedfordshire, focused on the importance of sharing professional knowledge and experience. Marilyn is a founder member of MirandaNet where many of these processes take place. But, in reference to research results, she explained that rapid evidence review (RER) is an important method of sharing and evaluating (practice based) research in groups online in translating experiences and making them operational. She showed an existing on line community where researchers and teachers play a key role in this process: <a href=\"http:\/\/www.educationcommunities.org\">www.educationcommunities.org<\/a>. The members of the conference set up MirandaNet working groups in this space.<\/p>\n<h3>Working together<\/h3>\n<p>The members of the Poskole conference also considered the best ways of continuing to work together. Dr Marilyn Leask, Professor of Educational Knowledge, University of Bedfordshire is well known for her work on knowledge management in education and in building the evidence and knowledge base for teacher education and classroom practice.<\/p>\n<p>When she was working with a local government agency she had the opportunity to EdComms to develop an international professional networking and collaboration site. This site which is based on the successful online environment for local government in England and Scotland, is not intended to replace internal university virtual learning environments or teachers’ professional networks. Nevertheless EdComms does resolve the problem many educators face where they are prevented by firewalls from collaborating with external partners through school the university online environment &#8211; this is usually to do with software licence constraints and fears about inappropriate contacts.<\/p>\n<p>EdComms (<a href=\"http:\/\/www.educationcommunities.org\">www.educationcommunities.org<\/a>) solves some of these problems because it provides:<\/p>\n<ul>\n<li>university sector ownership<\/li>\n<li>control over development for founding members use not restricted by licences which restrict number or location of users<\/li>\n<li>a document repository (and other e-tools) shared with colleagues and partners outside your organisation within private or public online workspaces.<\/li>\n<\/ul>\n<p>We are inviting MirandaNet members to help us develop and co-own a specialist web 2.0 environment of interconnected online communities designed to support the work of university staff. There are five groups that have emerged from Poskole using EdComms as their working environment. These groups encompass the big issues we identified: the aim of each group will be to write briefing papers for policy makers; develop resources and courses for teachers; and, to submit proposals for funding for the research and development issues we thought to be important.<\/p>\n<p>Groups will work online between meetings that are being arranged at the University of Bedfordshire Bedford Campus in November 2012 and July 2013. Each working group will have an online MirandaMod as well.<\/p>\n<h2>The five working groups<\/h2>\n<p>The remit of the five working groups are:<\/p>\n<p>1. Continuing Professional Development: resources and training for teachers including assessment, models of training, training spaces: led by Rachel Jones, Elliot Academies and Steljes with school practitioners and teacher educators: Lawrence Williams, Dughall McCormick, Lenka Zerzanova, Dr Mirka Cernochova and Gareth Medd, David Obst and Katya Toneva. Leading the detail on learning spaces were Leon Cych, a communications consultant; and Theo Kuechel, media consultant.<\/p>\n<p>Some of the issues they focused on in their first meeting were<\/p>\n<ul>\n<li>The means of moving teachers forward in professional development<\/li>\n<li>Building new modules that look both at context and content<\/li>\n<li>Finding assessment routes to capture teachers&#8217; digital creativity and literacy<\/li>\n<\/ul>\n<p>2. Developing effective professional communication models led by Leon Cych, Theo Kuechel and Christina Preston aims to develop ways that grassroots professionals can communicate their ideas<\/p>\n<p>3. Sustaining collaborative professional learning and research led by Professor Marilyn Leask aims to encompass the whole group in contributing to proposals aimed at key funding bodies.<\/p>\n<p>4. Digital professional identity\/digital e-wellness (link with digital safety) led by Professor Carsten Trinitis, University of Bedfordshire and University of Munich arose from a perceived need for professionals to be more aware of the ways in which learners’ and teachers’ identities can be enhanced or compromised by the digital environments that are widely available.<\/p>\n<p>5. Theories of Learning: led by Dr Andrea Raiker, Future Learning Research Centre, University of Bedfordshire includes researchers like Marilyn Leask and Christina Preston who are publishing on the nature of individual and group learning enriched by digital technologies. In particular we are looking at the results from running MirandaMods (<a href=\"\/mirandamods\/\">www.mirandanet.org.uk\/mirandamods<\/a>) with the MirandaNet membership.<\/p>\n<p>If you want to join these five groups please email me on &#x63;&#104;&#x72;&#x69;&#115;&#x74;&#105;n&#x61;&#64;m&#x69;&#114;a&#x6e;&#100;a&#x6e;&#101;&#x74;&#x2e;&#97;&#x63;&#x2e;&#117;&#x6b; or register on <a href=\"http:\/\/www.educationcommunities.org\">www.educationcommunities.org<\/a> and put in MirandaNet Poskole. You can just google educationcommunities.<\/p>\n<ul>\n<li>For profiles of all the participants <a href=\"\/researchexchange\/events-2\/how-can-digital-technologies-support-learners-prague-6th-10th-june\/poskole-professional-knowledge-creators\/\">read more&#8230;<\/a><\/li>\n<li>For videos of the proceedings <a href=\"\/researchexchange\/events-2\/how-can-digital-technologies-support-learners-prague-6th-10th-june\/videos-from-the-poskole-event-2\/\">read more&#8230; <\/a><\/li>\n<li>For photos of the event <a href=\"\/researchexchange\/our-picture-gallery\/\">look here&#8230;<\/a><\/li>\n<\/ul>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/bulletins\/\">Back to the newsletter<\/a><\/p>\n<p><a href=\"\/researchexchange\/\">Back to the research exchange<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>And how will their prowess be assessed? Report from the MirandaNet conference in Prague, June 2012, by Christina Preston, England, and Jan Lepeltak, the Netherlands Twenty-five participants from Bulgaria, England, Germany, Slovakia, The Czech Republic and The Netherlands met together &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-professional-development\/poskole-report-prague-june-2012\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":3134,"menu_order":10,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2210"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=2210"}],"version-history":[{"count":30,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2210\/revisions"}],"predecessor-version":[{"id":5315,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2210\/revisions\/5315"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3134"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=2210"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}