{"id":2524,"date":"2012-09-05T20:26:22","date_gmt":"2012-09-05T19:26:22","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=2524"},"modified":"2013-05-03T10:31:04","modified_gmt":"2013-05-03T09:31:04","slug":"government-briefing","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/government-briefing\/","title":{"rendered":"Education Futures Collaboration and MESH"},"content":{"rendered":"<p><strong>Goverment Briefing paper <\/strong><strong><\/strong><\/p>\n<p>Prepared by Marilyn Leask, Professor of Educational Knowledge Management<\/p>\n<p><strong>Education Futures Collaboration<\/strong><strong><\/strong><\/p>\n<p><em>supporting professional judgement with evidence<\/em><\/p>\n<p><em>raising pupil attainment by professionalizing teaching<\/em><\/p>\n<p>The <a href=\"http:\/\/www.educationcommunities.org\/c\/120856\/home.do\">Education Futures Collaboration<\/a> is an independent umbrella organisation for educators and their partners who wish to work collaboratively to improve the quality of education.  The Collaboration is managed by trustees from the founding organisations.<\/p>\n<p>The Collaboration notes parallel work undertaken in health to build and quality assure the research base and make it available to practitioners through for example, the Cochrane Collaboration, the Map of Medicine Healthguides and the National Institute for Health and Clinical Excellence (NICE).<\/p>\n<p><strong>Why form a collaboration?<\/strong><\/p>\n<p>UK Reviews of the evidence base for educational practice indicate that the evidence base is neither as strong nor as accessible to practitioners as it could be, and that there is considerable duplication of effort. It is clear that there is considerable potential for existing resources in the education system to be used more effectively. The Education Futures Collaboration addresses these issues.<\/p>\n<p><strong>The international context<\/strong><\/p>\n<p>&#8230;.in many countries, education is still far from being a knowledge industry in the sense that its own practices are not yet being transformed by knowledge about the efficacy of those practices. OECD 2009 p.3<\/p>\n<p>Improving education systems is an elusive goal. The Organisation for Economic Cooperation and Development (OECD, 2009, p.3) calls for the transformation of “traditional models of schooling &#8230; into customised learning systems that identify and develop the talents of all students” and; the “creation of ‘knowledge-rich’, evidence-based education systems, in which school leaders and teachers act as a professional community with the authority to act, the necessary information to do so wisely, and the access to effective support systems to assist them in implementing change&#8230;.”<\/p>\n<p>The Educational Futures Collaboration goal is to harnesses the energies and knowledge of educators  worldwide to address these issues.<\/p>\n<p><strong>Aims<\/strong><\/p>\n<ul>\n<li>Join up the pockets of excellence in teaching and evidence based practice<\/li>\n<li>Improve the quality of teaching and student attainment by creating knowledge rich educators<\/li>\n<li>Create a joined up profession, linking educators regardless of location<\/li>\n<li>Provide diagnosis and intervention tools to help educators and learners break through barriers in student learning, and the teaching and learning of particular concepts<\/li>\n<\/ul>\n<p><strong>Activities<\/strong><\/p>\n<p>The Education Futures Collaboration provides an e-infrastructure, the online Education Communities (www.educationcommunities.org) which both connects together educators and their partners working in isolated initiatives and creates national and international development capacity, allowing for knowledge exchange and co-creation between educators, teacher educators, policy-makers and academics nationally and internationally.  This is based on the successful equivalent created for local government in the UK.  The diagram below and the text which follows outline the core strands of work.<\/p>\n<p>Core strands of work are:<\/p>\n<p><a href=\"http:\/\/www.educationcommunities.org\/welcome.do\"><strong>Online Education Communities<\/strong><\/a><strong> <\/strong>(<a href=\"http:\/\/www.educationcommunities.org\/\">www.educationcommunities.org<\/a>)<br \/>\nProvision of an e-infrastructure providing online workspaces or communities to support global partnerships, co-research and collaborative networks for innovative educators, engaged in improving the quality of education in every context. New community work spaces can be quickly set up to respond to needs of members. Membership is open to all with the ability to create private communities. Access the Education Communities,<a href=\"http:\/\/www.educationcommunities.org\/\"> HERE<\/a>.<\/p>\n<p><a href=\"http:\/\/www.meshguides.org\/\"><strong>MESH<\/strong><\/a><strong> <\/strong>(<a href=\"http:\/\/www.meshguides.org\/\">www.meshguides.org<\/a>)<br \/>\n<strong><span style=\"text-decoration: underline;\">M<\/span><\/strong><strong>apping <span style=\"text-decoration: underline;\">E<\/span>ducation <span style=\"text-decoration: underline;\">S<\/span>pecialist know<span style=\"text-decoration: underline;\">H<\/span>ow<\/strong> (MESH) provides access to subject specific research-based knowledge about barriers to students’ learning and interventions most likely to dissolve barriers. The MESH approach uses multimedia mindmaps, as a way of presenting complex knowledge, each node providing a link to an annotatable display of more in-depth fully referenced knowledge.<\/p>\n<p><strong>RaDaR<\/strong><br \/>\nThe educator<strong> Research &amp; Development &amp; Review<\/strong> (RaDaR) groups are networks of teacher researchers and academics who review and report on existing evidence and undertake collaborative research where evidence is needed. The outputs of these groups create pathways for MESH and evidence for the knowledge repositories. This approach builds on and extends innovative work happening across the sector e.g .Professor Colleen McLaughlin’s work with the <a href=\"http:\/\/www.educ.cam.ac.uk\/research\/projects\/super\/\">Schools- University Partnership <\/a>at the University of Cambridge and Dr Ian Terrell’s work with schools across north west London through <a href=\"http:\/\/mdxpartnership.org.uk\/\">MidWheb<\/a> which grew out of teacher-researcher models for the <a href=\"http:\/\/www.educationcommunities.org\/c\/120856\/doclib\/document-display.do?backlink=ref&amp;id=137061\">evaluation of the Technical Vocational Education Initiative in Enfield.<\/a><\/p>\n<p><strong>Quality Assurance<\/strong><br \/>\nQuality of resources is assured through the operation of peer review and independent judge processes. The use of e-survey tools enables rapid responses from a broad stratified sample of respondents to issues of the day.<\/p>\n<p><strong>Associated Activities<\/strong><br \/>\nA variety of associated organisations are running activities which dovetail with this work on effective knowledge management and professional networking. A number of these take forward projects initially funded by what was the Training and Development Agency for schools (TDA) or the Higher Education Academy. These are now managed by professional associations, universities or other groups:<\/p>\n<ul>\n<li><a href=\"http:\/\/www.behaviour2learn.co.uk\/\"><strong>Behaviour2Learn<\/strong><\/a> – Professor Philip Garner, University of Northampton<\/li>\n<li><strong>Multiverse<\/strong>&#8211;  Dr Sam Twiselton, University of Cumbria<\/li>\n<li><a href=\"http:\/\/www.ttrb3.org.uk\/\"><strong>Teacher Training Resource Bank3<\/strong> <\/a>– Mike Blamires, Canterbury Christ Church University<\/li>\n<li><a href=\"http:\/\/www.eep.ac.uk\/DNN2\/\"><strong>Education Evidence Portal<\/strong><\/a><strong> <\/strong>– Andrew Morris and Institute of Education<\/li>\n<\/ul>\n<p><strong>Networks<\/strong> such as<br \/>\n<a href=\"http:\/\/www.cumbria.ac.uk\/Courses\/SubjectAreas\/Education\/Research\/TEAN\/TEANHome.aspx\"><strong>Teacher Education Advancement Network<\/strong><\/a> – Alison Jackson, University of Cumbria<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/\"><strong>Mirandanet <\/strong><\/a>– Professor Christina Preston, University of Bedfordshire<\/p>\n<p><strong>Specialist Teacher Training Resources<\/strong> initially funded by the TDA are being maintained by subject associations.<\/p>\n<p><strong>Expected Outcomes<\/strong><br \/>\n-Trends in student attainment that can be directly related to new pedagogic practice: specifically through improved practice in differentiation supported through providing just-in-time access to research based knowledge for teachers, NQTs, student teachers, learners and their parents<\/p>\n<p>-Increase in teachers and teacher educators using and collaborating in building evidence based practice: specifically demonstrated through online work and engagement<\/p>\n<p>-Engagement with the evidence base from the beginning of their training by student teachers<\/p>\n<p>-Positive involvement from those who are already working in this area: specifically demonstrated through user surveys.<\/p>\n<p><strong>Vision<\/strong><br \/>\nThe Education Futures Collaboration promotes a philosophical way of collaborative working to build and share evidence based knowledge for educational practice and includes a set of tools to make that happen.<br \/>\n<strong>Why this approach?<\/strong><br \/>\nThe uniqueness of the collaboration comes from a joined up approach supporting research and evidence informed practice, managed and developed by education experts.<\/p>\n<p><strong>Sustainability<\/strong><br \/>\nThe model for development and management of the Collaboration is based on existing successful models in the medical field. The goal is to work with existing resources to ensure sustainability of the work over the long term and to seek additional funds for special projects.<\/p>\n<p><strong>Governance<\/strong><br \/>\nGovernance is through the Board of Trustees which has ten members from founding organisations and associated organisations: UCET (Universities’ Council for the Education of Teachers), University of Wolverhampton, St Mary’s University College, University of the West of Scotland, University of Bedfordshire, InterfaceSpace  and associated school network, Kings College. University of London, MirandaNet, Core Education. Staff from a wide range of universities and schools are already involved in the activities. An analysis of users of the Education Communities platform from the two year pilot stage shows engagement of over 800 educators from over 140 UK schools, universities and colleges; over 70 universities outside of the UK, over 110 UK charities, companies and education consultancies. There has been through word of mouth during the pilot phase.  As with the local government online communities of practice, some public servants in central government organisations also use the online community way of working to work with their contacts in the field.<\/p>\n<p>More on MirandaNet, MESH and Education Communities <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/government-briefing\/education-communities\/\">here.<\/a><\/p>\n<p><strong><\/strong>For more details about registering a  MESH pathway email &#99;&#x68;&#x72;i&#115;&#x74;i&#110;&#x61;&#64;&#109;&#x69;r&#97;&#x6e;&#x64;&#97;&#x6e;&#x65;t&#46;&#x61;c&#46;&#x75;k<\/p>\n<p><strong>Reference<\/strong><\/p>\n<p>OECD (2009) Creating Effective Teaching and Learning Environments: First Results from Teaching and Learning international Survey (TALIS) <a href=\"http:\/\/www.oecd.org\/document\/54\/0,3343,en_2649_39263231_42980662_1_1_1_1,00.html\">http:\/\/www.oecd.org\/document\/54\/0,3343,en_2649_39263231_42980662_1_1_1_1,00.html<\/a><\/p>\n<p>Education Futures Collaboration  <a href=\"http:\/\/www.edfuturescollaboration.org\/\">www.edfuturescollaboration.org<\/a><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Goverment Briefing paper Prepared by Marilyn Leask, Professor of Educational Knowledge Management Education Futures Collaboration supporting professional judgement with evidence raising pupil attainment by professionalizing teaching The Education Futures Collaboration is an independent umbrella organisation for educators and their partners &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/government-briefing\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":533,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2524"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=2524"}],"version-history":[{"count":10,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2524\/revisions"}],"predecessor-version":[{"id":2526,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2524\/revisions\/2526"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/533"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=2524"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}