{"id":282,"date":"2011-07-23T18:33:48","date_gmt":"2011-07-23T17:33:48","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=282"},"modified":"2014-03-29T13:13:55","modified_gmt":"2014-03-29T12:13:55","slug":"writing-about-professional-experience-of-digital-technologies-an-ethnographical-approach","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/critical-incidentsexperiences-as-research-data\/writing-about-professional-experience-of-digital-technologies-an-ethnographical-approach\/","title":{"rendered":"Ethnographical approaches"},"content":{"rendered":"<p>Why do we undertake research as a society? And why do we undertake action research as educators? Good research takes effort but teachers who are keen to find a route to &#8216;the truths&#8217; about teaching and learning that are not  based only on anecdote, conviction and emotion. In this context,  quantitative research feels like an effective means of  forcing an object view of the facts of life. Weighing and measuring feels like an important route to new truths about our profession.<\/p>\n<p>But we also know that accurate weighing and measuring is not the only route to the truth:anecdote, conviction and emotion have an important part to play in understanding human interaction.  Qualitative research can add important findings to the statistical view of  effective ways of learning, by paying more attention to individual&#8217;s emotions and reactions as a stimulus to reflections and chante.<\/p>\n<p>One area of qualitative research that has particularly attracted me is Ethnography: an ongoing attempt to place specific encounters, events and understandings into a fuller and more meaningful context (Tedlock 2000). This approach is a good adjunct to action research as it is  the branch of research that can be used to reflect on, and to share, the ways in which our experiences have impacted on our professional beliefs and practices.<\/p>\n<p>This exchange of experiences is very important in the world of digital technologies. The patterns that emerge can be significant as cery few professionals in the last century had much training in this field and there was little guidance about how to use digital technologies in teaching and learning. In this context, I have collected a series of critical incidents that have come from my own life and from the lives of Fellows. Critical incidents are key moments in life when insights are gained and new attitudes are formed. I have chosen a few that  illuminate the routes by which professionals have  became excited by and engaged with the potential of computers starting with my first view of a computer room as a child in the 1950s<\/p>\n<p>You are invited to relate similar anecdotes  to help us understand how educators learn about computers. Use the comments section to give us your critical incident. Please head your critical incident on headings that relate to the founding of MirandaNet in 1992&#8230;<\/p>\n<p>The Past, 1950 – 1991,<\/p>\n<p>The Present, 1992 – 2011,<\/p>\n<p>Any thought about the future post 2011 will also be welcome<\/p>\n<p>When we have analysed all the critical incidents we will send you the results &#8211; or join MirandaNet to keep up with our progress www.mirandanet.org.uk\/fellowship<\/p>\n<p><strong>Building Etopia here<\/strong><\/p>\n<p>This request for more information from you  is based on a draft ethnographical study I have written called Building Etopia here: an Interactivist E-community of Practice for Learners of All Ages.  <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2009\/05\/Building-Etopia-here.pdf\">Building Etopia here: <\/a>In this study I look back on the ways in which I learnt about the role  of computers as an individual teacher compared with the ways in which  the MirandaNet community has learnt as a collaborative group. It is  intended as a means of helping teachers to understand how children are  learning about computers and about the potential and the dangers of that  learning.<\/p>\n<p>This thesis focuses on the developing role of e-communities of practice in transforming teaching and learning based on evidence from the MirandaNet Fellowship (www.mirandanet.ac.uk),established in 1992. This international organisation makes practice-based research, a form of action research, a key process in building a professional database and influencing policy on the use of Information and Communications Technology (ICT) in education.<\/p>\n<p>Two aims inform the thesis. The first is to explore the ways in which the MirandaNet Fellowship has impacted on members continuing professional development (CPD) since 1992. The second aim is to investigate in which ways the ethical approach of this professional organisation has influenced the international World E-citizenship activities (wec.mirandanet.org.uk).<\/p>\n<p>This data, spanning fifty years, is organised in three periods. The first section, The Past, 1950 – 1991, is an auto-ethnographical account of the influence of computers on education by the MirandaNet founder, and author of this thesis, about her education, her teacher training and her first years of teaching. The data in the section,  The Present, 1992 – 2005, covers evidence from MirandaNet members about their learning. The Future, from 2006, looks at the learning trajectories of MirandaNet members of all ages who are building the international Etopia project.<\/p>\n<p>The analysis draws on a descriptive framework which categorises the data across four key headings. These relate to five selected MirandaNet projects: the digital affordances under investigation; key critical incidents for a lead learners; the cumulative and iterative roles of the participants in the CoP and the engagement in the social cultural communicative strata of discourse, design, production and distribution.<\/p>\n<p>The analysis builds towards an understanding of changes in the pedagogical models developed during the years of  Fellowship. In this first stage, key findings show that the professional influence exercised by the organisation is moving increasingly from the input of individuals to collaborative web-based interaction. Overarching this is the increasing evidence for the application of web-based affordances for ethical purposes.<\/p>\n<p>In the second stage of data collection many more MirandaNet members, friends and associates have been asked to supply more critical incidents that had a major impact on their professional learning.<\/p>\n<p><strong>References<\/strong><\/p>\n<p>B. Tedlock (2000) <em>Ethnography and Ethnographical Representation <\/em>The Handbook of Qualitative Research second Edition Eds. N. K. Denzin and Y.S. Lincoln. Sage publications Thousand Oaks London New Dehli<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Why do we undertake research as a society? And why do we undertake action research as educators? Good research takes effort but teachers who are keen to find a route to &#8216;the truths&#8217; about teaching and learning that are not  &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/critical-incidentsexperiences-as-research-data\/writing-about-professional-experience-of-digital-technologies-an-ethnographical-approach\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":310,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/282"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=282"}],"version-history":[{"count":5,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/282\/revisions"}],"predecessor-version":[{"id":5919,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/282\/revisions\/5919"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/310"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=282"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}