{"id":2873,"date":"2012-10-26T10:53:15","date_gmt":"2012-10-26T09:53:15","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=2873"},"modified":"2012-10-29T21:39:34","modified_gmt":"2012-10-29T20:39:34","slug":"doctoral-thesis","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/my-doctoral-journey\/doctoral-thesis\/","title":{"rendered":"Doctoral thesis"},"content":{"rendered":"<h2><em>Gaining insight into educators’ understanding of digital technologies: three models for the analysis of multi-dimensional concept maps<\/em><\/h2>\n<p><strong>Abstract<\/strong><\/p>\n<p>The thesis explores the hypothesis that an analysis of a Multi-dimensional Concept Map (MDCM) provides educators and researchers with different and possibly richer and broader insights into understanding of an issue – in this case that of digital technologies in education &#8211; than written responses alone. ‘Multi-dimensionality’ refers to the characteristics of multimodal hand-drawn or digitally produced concept maps, namely multi-layering and (remote) multi-authoring. Forty-eight pairs of concept maps were collected, in three case studies based in England and South Africa, all focusing on gaining insights into educators’ understanding of the use of digital technologies in teaching and learning. The three groups of educators were undertaking one-year courses about using computers in classrooms, underpinned by three different perspectives on learning: information transmission, constructivism and social interaction. This study of pre- and post-course concept maps aims to answer the Research Question: How does multimodal concept mapping provide insights into educators’ understanding about digital technologies? Both benefits and challenges were evident in the use of the three different methods of analysis that were used. Given the relatively low numbers, a qualitative analysis of scores is revealing whereas a quantitative analysis is unreliable; ‘words’, where they are used, provide a useful insight; a more encompassing semiotic analysis revealed some underlying ‘positions’ that surprised even the map makers themselves. A key methodological finding was that in social interaction contexts, concept maps are most valuable used as scaffolds for conversations between participants within ‘communities of practice’ to promote shared insights into professional understanding of digital technologies. The findings were influenced by the four different roles assumed by the researcher: as an objective judge of data; as a community mentor; as an active community member; and as a researcher and community member inviting other members of that community to be co-researchers. The researcher learnt, as the project progressed, that the danger of becoming too close to the ‘subjects’ to be objective about the data was outweighed by the richness of the insights when the map makers engaged with the researcher and with trusted colleagues in analyzing the meaning of their pairs of concept maps.<\/p>\n<p><a href=\"\/researchexchange\/about-the-team\/about\/my-doctoral-journey\/doctoral-thesis\/download-doctoral-thesis\/\">Download this thesis<\/a> (password needed)<\/p>\n<p>Email <a href=\"m&#97;&#x69;&#x6c;t&#111;&#x3a;&#x63;h&#114;&#x69;&#x73;t&#105;&#x6e;&#x61;&#64;&#109;&#x69;&#x72;a&#110;&#100;&#x61;&#x6e;e&#116;&#x2e;&#x61;c&#46;&#x75;&#x6b;\">Christina Preston<\/a> for the password to this  thesis.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gaining insight into educators’ understanding of digital technologies: three models for the analysis of multi-dimensional concept maps Abstract The thesis explores the hypothesis that an analysis of a Multi-dimensional Concept Map (MDCM) provides educators and researchers with different and possibly &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/my-doctoral-journey\/doctoral-thesis\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":370,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2873"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=2873"}],"version-history":[{"count":13,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2873\/revisions"}],"predecessor-version":[{"id":2912,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2873\/revisions\/2912"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/370"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=2873"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}