{"id":310,"date":"2011-07-17T23:25:41","date_gmt":"2011-07-17T22:25:41","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=310"},"modified":"2013-02-18T18:53:34","modified_gmt":"2013-02-18T17:53:34","slug":"critical-incidentsexperiences-as-research-data","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/critical-incidentsexperiences-as-research-data\/","title":{"rendered":"Critical incidents"},"content":{"rendered":"<p><strong>About critical incident research data <\/strong><\/p>\n<p>In the context of critical incidents, Richardson explains,<\/p>\n<p><em>I write because I want to find something out. I write in order to learn something I did not know before I wrote it  (Richardson 2000:924).<\/em><\/p>\n<p>In the same vein Robert Frost’s conviction is that poetic representation is the shortest emotional distance between two points – the writer and the reader (Preston 1975). Because of my early study and practice in English, Media and Drama I have been seeking a methodological approach to the MirandaNet data that would communicate equally effectively to members as poetry would, but still be valid in research terms. Denzin and Lincoln, as well as Ellis and Bochner and Burns and Parker all offered permission take a poetic stance in research writing (Ellis and Bochner 2000; Burn and Parker 2003). Their studies of ethnography support the recording  of affective factors in the data from a subjective point of view.<\/p>\n<p>The series of critical incidents, in this study, enter the affective category because they involves the continuous assessment of human behaviour over a period of time by the participant researcher who is also one of the actors in the process. Each of these critical incidents only happens once and, therefore, the normal research rules about reliability and consistency have to be suspended. This is justifiable in controlled conditions because a single unrepeatable incident or event can sometimes offer vital insights into a person or a situation that will never be repeated (Wragg 1994). The importance of the irregular that Wragg perceives is sometimes ignored by quantitative research when it relies too much on predictable, traceable patterns. In addition, the telling of stories can also involve the research audience in greater ownership of the results because they relate to similar experiences. In this paper insights are drawn from the unusual as a means of providing a novel perspective on the slow introduction of a new phenomenon, the computer, into the fabric of learning.<\/p>\n<p>In this spirit MirandaNet members have always been encouraged to tell their stories to each other and on the web through practice-based research. This study aims to present the wider narrative that drew their work together as well as encouraging them to tell collaborative tales of what they have achieved.<\/p>\n<p>The selection of critical incidents begins from my perspective in the Past, shares members individual stories in the Present and passes onto to the stories of lead-learners and young learners as they develop their strengths in Etopia. Recording the ways in which the members have acted together to create a spirit greater than themselves begins to emerge in the critical incidents towards the end of this study.<\/p>\n<p>The voice of ownership of groups appears more clearly in the mirandamods, the wikis and the podcasts. Yet there are hints of this even in 1997 when John Potter, a MirandaNet Fellow said at our first international conference, “Miranda does not believe in one day ICT courses’, and all the Fellows nodded (Preston 1999). My affirmation was different from the Fellows: at that moment Miranda was an independent community voice, no longer the voice of the founder.<\/p>\n<h4><strong>The dilemma for researchers who are also agents for change<\/strong><\/h4>\n<p>For Denzin, The Seventh Moment is the place, as yet unknown, where qualitative researchers will lead in the future. Denzin has a commitment to this new place which is like the MirandaNetters commitment to Etopia which makes this approach to research relevant because it emphasises community:<\/p>\n<p>We, [as qualitative researchers}, face a choice in the seventh moment of declaring ourselves committed to detachment or in solidarity with the human community. We come to know, and we come to exist meaningfully only in that community. We [as researchers] have the opportunity to rejoin that community as its resident intellectuals and change agents …And so we embark together on a new project, a project with its own, as yet not fully understood, cultural plots and cultural practices….And what remains throughout, will be the steady but always changing commitment of qualitative researchers &#8211; the commitment, that is, to study human experience from the ground up, from the point of view of interacting individuals who together and alone make and live histories that have been handed down to them from the ghosts of the past (P1062- 1063)<\/p>\n<p>Inspired by this comment on community I looked again at the data and realised that my experience in the Past turned on a sense of achievement in being able to disseminate my findings from practice based research and mentor my peers towards productions of their own. Kress and Van Leeuwen develop these ideas in their communicative strata which offer the learning processes of discourse, design, production and distribution (Kress and Van Leeuwen 2001). This cycle was an expansion into the wider world of the iterative cycle of practice-based research: do, review, learn, apply (Somekh 1995). Where learners are involved in all these constructivist processes the learning is fuller. In addition, some of the best learning took place when some <strong>action<\/strong> resulted, like an international exchange of ideas or the production of materials that were used to support teachers in transforming their thinking about teaching and learning. Even greater was the power of insight when interactivity between colleagues gave birth to a shared truth. From these ideas the idea of a chart developed as a framework for the categorisation of the data that I had collected which finally identify action and interaction as the key to learning achievement.<\/p>\n<p><strong>Invitation<\/strong><\/p>\n<p>As an educator who uses computers in your professional practice, you are being invited to add to the MirandaNet gallery of critical incidents. These are experiences that are important as research data as they present truths about life in a different mode from statistics. Each incident in the examples that follow has been confined to one presentation slide with perhaps one or two illustrations on another slide. This presentation explains how to do this <a href=\"\/researchexchange\/wp-content\/uploads\/2011\/07\/Critical-incidents-for-website210711.pdf\">Critical incidents: writing yours up<\/a><\/p>\n<p>MirandaNet Fellows will analyse this data to understand more about how adults learn about computers. There has already been a preliminary study: <a href=\"\/researchexchange\/wp-content\/uploads\/2009\/05\/Building-Etopia-here.pdf\">Building Etopia here:<\/a><\/p>\n<p>You can send your contribution to Dr Christina Preston <a href=\"&#x6d;a&#x69;&#108;&#x74;&#111;:&#x63;&#104;&#x72;&#105;s&#x74;&#105;&#x6e;&#97;&#64;&#x6d;i&#x72;&#97;&#x6e;&#x64;a&#x6e;&#101;&#x74;&#46;a&#x63;&#46;&#x75;&#107;\">&#x63;&#x68;&#x72;&#x69;&#x73;&#116;&#105;&#110;&#97;&#64;mi&#x72;&#x61;&#x6e;&#x64;&#x61;&#x6e;&#101;&#116;&#46;ac&#46;&#x75;&#x6b;<\/a> or fill in the comments section below.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>About critical incident research data In the context of critical incidents, Richardson explains, I write because I want to find something out. I write in order to learn something I did not know before I wrote it  (Richardson 2000:924). In &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/critical-incidentsexperiences-as-research-data\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1337,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/310"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=310"}],"version-history":[{"count":22,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/310\/revisions"}],"predecessor-version":[{"id":3934,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/310\/revisions\/3934"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1337"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}