{"id":3102,"date":"2012-11-24T10:28:08","date_gmt":"2012-11-24T09:28:08","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=3102"},"modified":"2014-10-04T18:10:33","modified_gmt":"2014-10-04T17:10:33","slug":"our-ict-curriculum","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/our-ict-curriculum\/","title":{"rendered":"Miranda&#8217;s ICT curriculum"},"content":{"rendered":"<p><strong><strong>Co-ordinators of MirandaNet contributions to the ICT curriculum consultation: Christina Preston, MirandaNet; Ian Lynch, GEBOL; Theo Keuchel, MirandaNet; Andrea Forbes, Texas Instruments; and, Iris Lanny, Oracle.<br \/>\n<\/strong><\/strong><\/p>\n<p><strong><strong>Background<\/strong><\/strong><\/p>\n<p>There is a <a href=\"http:\/\/www.education.gov.uk\/schools\/teachingandlearning\/curriculum\/nationalcurriculum\">statutory requirement<\/a> for all schools in England to provide an ICT curriculum to all children in the 5-16 age range. The requirements for specific programmes of study and assessment arrangements related to attainment targets have been <a href=\"http:\/\/www.education.gov.uk\/schools\/teachingandlearning\/curriculum\/nationalcurriculum\/b0075667\/national-curriculum-review-update\">disapplied<\/a> with the intention of reducing the constraints on schools and enabling them to take more imaginative and up to date approaches to teaching and learning. There is a common misconception that the need to teach ICT has been revoked. This is not the case. The strategy is not intended to make teaching ICT optional but to improve teaching. If schools do not have the confidence to improve their provision given greater flexibility, they are free to use the existing systems. It is thus likely that OFSTED will be highly critical of any actions that weaken rather than strengthen teaching and the associated learning outcomes for children.<\/p>\n<p>This paper examines the reasons for the changes to the statutory provision, the first draft proposal for a new slimmer programme of study and the policy strategies necessary to make the changes successful in terms of raising standards in what children know and can do. The report and mind map that follows represents the views of forty eight participants at the MirandaNet “Exploring Education Futures” conference held in partnership with the Learning Futures Research Centre, University of Bedford conference. There were also approximately twenty online contributions at the conference on video link, Twitter and the <a href=\"https:\/\/www.mindmeister.com\/215850627\/a-changing-ict-curriculum-landscape-exploring-education-futures-theo-kuechel\">mind map<\/a> and subsequent refining comments on mirandalink, the MirandaNet email debating system. These reponses have been overseen by MirandaNet Senior Fellows, Ian Lynch and Theo Kuechel.<\/p>\n<p><strong>A brief history of technology in schools<\/strong><strong><\/strong><\/p>\n<p>Since the rise of comprehensive education the approach to technology has been incoherent and <a href=\"http:\/\/www.edutopia.org\/forest-lake-nasa-technology-integration-how-to\">ill-defined<\/a>. <a href=\"http:\/\/www.data.org.uk\/index.php?option=com_content&amp;view=article&amp;id=100&amp;Itemid=35\">Practical subjects<\/a> such as <a href=\"http:\/\/www.foodinschools.org\/\">food preparation<\/a>, <a href=\"http:\/\/www.bbc.co.uk\/schools\/gcsebitesize\/design\/textiles\/\">textiles<\/a> and design through the medium of <a href=\"http:\/\/www.egaschool.co.uk\/content\/134\">resistant materials<\/a> have all been labelled “technology” alongside <a href=\"http:\/\/en.wikipedia.org\/wiki\/Microelectronics_Education_Programme\">microelectronics<\/a>, <a href=\"http:\/\/www.computingatschool.org.uk\/index.php?id=computing-is-a-discipline\">software development<\/a> and <a href=\"http:\/\/www.education.gov.uk\/a00201823\/digital-technology-in-schools\">using applications<\/a>.  Examples range from the role of <a href=\"http:\/\/www.gcsescience.com\/pse10-electrostatic-photocopier.htm\">electrostatics<\/a> in photocopying and the use of yeast in the<a href=\"http:\/\/www.gcsescience.com\/rc17-fermentation-yeast-alcohol.htm\"> brewing<\/a> industry to using a word processor. The introduction of computer technologies in the <a href=\"http:\/\/www.guardian.co.uk\/education\/2012\/jan\/10\/bbc-micro-school-computer-revolution\">1980s<\/a> added a further dimension to the breadth of technologies taught in schools that has had an unprecedented amount of money <a href=\"http:\/\/news.bbc.co.uk\/1\/hi\/education\/4746438.stm\">spent on material learning resources<\/a> if not on <a href=\"http:\/\/www.guardian.co.uk\/education\/2008\/jan\/28\/schools.uk\">teacher training<\/a>. The difficulty is that the curriculum time is no bigger now than it was fifty years ago but there is massively more potential content as well as multiple understandings of what technology means.<\/p>\n<p><strong>What is technology?<\/strong><strong><\/strong><\/p>\n<p>The word <a href=\"http:\/\/en.wiktionary.org\/wiki\/technology\">technology<\/a> comes from <a href=\"http:\/\/en.wikipedia.org\/wiki\/Greek_language\">Greek<\/a> <a href=\"http:\/\/en.wiktionary.org\/wiki\/%CF%84%CE%B5%CF%87%CE%BD%CE%BF%CE%BB%CE%BF%CE%B3%CE%AF%CE%B1\">τεχνολογία<\/a> (technología); from <a href=\"http:\/\/en.wiktionary.org\/wiki\/%CF%84%CE%AD%CF%87%CE%BD%CE%B7\">τέχνη<\/a> (téchnē), meaning &#8220;art, skill, craft&#8221;, and <a href=\"http:\/\/en.wiktionary.org\/wiki\/%CE%BB%CE%BF%CE%B3%CE%AF%CE%B1\">-λογία<\/a> (<a href=\"http:\/\/en.wiktionary.org\/wiki\/logia\">-logía<\/a>), meaning &#8220;study of-&#8220;, however there are also many definitions of technology in terms of<a href=\"http:\/\/oxforddictionaries.com\/definition\/english\/technology\"> applied science and industry<\/a>. There is then an immediate problem with technology as a subject because of its increasing breadth of context, rapid development and <a href=\"http:\/\/www.unescap.org\/drpad\/panel\/hwang\/HWANG.htm\">economic<\/a> and <a href=\"http:\/\/www.time.com\/time\/magazine\/article\/0,9171,1902836,00.html\">cultural<\/a> importance. The <a href=\"https:\/\/docs.google.com\/viewer?a=v&amp;q=cache:mnXnm15DCUUJ:openlearn.open.ac.uk\/file.php\/2472\/%21via\/oucontent\/course\/189\/geog_t1_09t_2.pdf+&amp;hl=en&amp;gl=uk&amp;pid=bl&amp;srcid=ADGEESja-4fbw8lp_xS-0dbCH-GaK4tjkkFtowZQxicXkk4Zis8eUPGLg2B2sFtXNW5iOgF7Ct5gWFh9jX4wiNLO48ElwD0uCNVrRgjRfhscqiujH9OCxB26qyDXx3X_f7zxx3J1h2f8&amp;sig=AHIEtbStGwwo-WjOSF7HKFXHj5IIKwMRTA\">politics<\/a> of the curriculum means that different<a href=\"http:\/\/www.sigite.org\/it-model-curriculum\"> interest groups<\/a> interpret the word technology from a range of different perspectives and policy makers confronted with an already overcrowded subject based curriculum find increasing difficulty in deciding priorities. There is a real danger of making things worse rather than better.  The road to hell is paved with good intentions.<\/p>\n<p><strong>Digital technologies<\/strong><strong><\/strong><\/p>\n<p>Against this background, the<a href=\"http:\/\/www.bbc.co.uk\/news\/education-16493929\"> crisis<\/a> in digital technologies has emerged. Unlike the craft based traditional school technologies, digital technologies have shifting requirement of the <a href=\"http:\/\/www.guardian.co.uk\/teacher-network\/teacher-blog\/2012\/may\/30\/ict-digital-literacy-computing-computer-science\">expertise<\/a> required to teach them. Most of the resourcing effort has been constant <a href=\"http:\/\/agent4change.net\/policy\/ict-provision\/1594-should-schools-switch-to-revenue-model-for-ict.html\">refresh<\/a> of rapidly dating equipment as<a href=\"http:\/\/theinnovativeeducator.blogspot.co.uk\/2011\/02\/are-iwbs-past-its-prime.html\"> technological fashions<\/a> change rather than investing in people. It is not very surprising that this situation is unsustainable. It has been <a href=\"http:\/\/www.mcgraw-hill.co.uk\/kingscourt\/col.htm\">expensive<\/a> as well as<a href=\"http:\/\/www.infodev.org\/en\/Publication.154.html\"> uncertain<\/a> in its impact. The proposed solution is to remove much of the prescription associated with the programme of study and specify a much slimmer version. A first draft of this proposal was a key focus for the  <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/exploring-education-futures-linking-digital-technologies-grassroots-practice-and-the-making-of-policy\/\">“Exploring Education Futures” conference<\/a>.<\/p>\n<p><strong>The draft programmes of study<\/strong><strong><\/strong><\/p>\n<p>While the draft programme of study is a good starting point, we have identified the following weaknesses.<\/p>\n<ol>\n<li>Too much space(about 50%) taken up with purpose, aims and definitions.<\/li>\n<li>Inconsistency in the use of language and the detail presented in different parts of the text.<\/li>\n<li>Progression routes between key stages lack sufficient clarity to be maximally useful to teachers.Some language is not helpful to a general readership. It is not always well matched to the level associated with the content and could therefore be misleading.<\/li>\n<li>The lack of reference to assessment sends the wrong signals in terms of professional rigour.  We do not need to be prescriptive about assessment methods but we do need to ensure that regular assessment takes place since it is an essential element in any teaching strategy to raise standards.We propose the following redraft. This concise, consistent and balanced version gives a clearer steer on progression and takes account of evidence of age related cognitive development. We do not think this redraft changes the overall statement of what good teaching in the field should be about, but presents the information in language that more educators will be familiar with.<\/li>\n<\/ol>\n<p><strong>National Curriculum POS redraft<\/strong><strong><\/strong><\/p>\n<p><strong>The importance of digital technologies<\/strong><strong><\/strong><\/p>\n<p>Digital technologies have revolutionised the way of life of more people in a shorter period of time than almost any other human achievement.<\/p>\n<p><strong>Opportunity, progression and the role of assessment. <\/strong><strong><\/strong><\/p>\n<p>Pupils will gain a firm foundation in understanding digital technologies enabling them to use new applications effectively and creatively as they arise. They will access higher level further study in computer science and technical fields that depend on knowledge of the principles of digital information storage, processing and transmission. The contexts of learning will include academic and practical activities. Pupils will be assessed regularly against objective criteria to inform the planning of teaching and its match to their current demonstrated attainment and levels of cognitive development. Effectiveness will be  judged by how well all pupils use a range of contemporary technologies efficiently and effectively to routinely support their learning across the curriculum, preparing them to transfer this technological culture and capability to their future employment.<\/p>\n<p><strong>Aims<\/strong><strong><\/strong><\/p>\n<p>The National Curriculum for ICT will ensure that all pupils<\/p>\n<ul>\n<li>Understand contemporary digital technologies well enough to exploit them safely for their own benefit and the benefit of others.<\/li>\n<li>Understand the fundamental principles of computer science through practical experience of writing programs for a clear purpose.<\/li>\n<li>Can make informed decisions in relation to social, moral and cultural issues related to digital technologies.<\/li>\n<\/ul>\n<p><strong>Key Stage 1<\/strong><br \/>\nPupils will be taught through activities at an appropriate level that reinforce the development of number concepts and literacy. These will include:<\/p>\n<ul>\n<li>Use of a range of digital technologies to create and manipulate information in a range of formats.<\/li>\n<li>The use of sequences of instructions and simple techniques that under-pin computer programming and computational thinking.<\/li>\n<li>Accessing and communicating information locally and globally.<\/li>\n<li>An increasing awareness of working safely with digital media particularly related to the internet and mobile technologies.<\/li>\n<\/ul>\n<p><strong>Key Stage 2<\/strong><br \/>\nPupils will be taught to build on their learning in Key Stage 1, increasing its depth and breadth through:<\/p>\n<ul>\n<li>The use of a range of software applications, including internet services, to solve problems and create original work of their own design.<\/li>\n<li>Collecting, analysing, evaluating and presenting digital data and information recognising doubtful claims through the use of evidence.<\/li>\n<li>Developing good design practice and awareness of audience when presenting digital information.<\/li>\n<li>Opportunities to work collaboratively and manage small scale digital technology projects.<\/li>\n<li>Writing programs to accomplish given goals using appropriate techniques to ensure high quality products.<\/li>\n<li>Exploring issues related to on-line safety, intellectual property, business and media and effects on freedom, rights and responsibilities of individuals.<\/li>\n<\/ul>\n<p><strong>Key Stage 3<\/strong><br \/>\nBuilding on their current attainment, pupils will be taught to:<\/p>\n<ul>\n<li>Work creatively, acting in leadership and team roles when collecting, analysing, evaluating and presenting digital information.<\/li>\n<li>Evaluating digital data using evidence to inform judgements about validity and accuracy, presenting findings appropriately to the audience.<\/li>\n<li>Deal with unfamiliar technologies in increasingly complex circumstances that require interoperability between several applications.<\/li>\n<li>Describe relevant aspects of a problem in abstract terms that can be described within a computer program, including data storage, variables, loops and instructions for processing.<\/li>\n<li>Modify existing programs to improve them or extend their range of application.<\/li>\n<li>Write practically useful programs to accomplish given goals using appropriate techniques to ensure quality products.<\/li>\n<li>Relate generic hardware principles to a range of computing devices.<\/li>\n<li>Understand issues related to on-line safety, intellectual property, commercial interests and freedom of individuals.<\/li>\n<\/ul>\n<p><strong>Key Stage 4<\/strong><br \/>\nAll pupils will be taught to:<\/p>\n<ul>\n<li>Develop and apply their computational thinking skills.<\/li>\n<li>Use on-line digital technologies competently including the underlying knowledge and understanding to transfer this competence to new contexts.<\/li>\n<li>Support their learning in a range of subject contexts to accelerate their progress and thus raise their level of attainment.<\/li>\n<li>Critically evaluate ethical, moral, legal and environmental aspects of digital information systems explaining the impact of digital technologies on society and the implications of technological innovation in employment contexts.<\/li>\n<li>By the end of KS4, the great majority of pupils should have achieved a recognised qualification at level 2 primarily focused on digital technologies and including aspects of computing as well as using applications.<\/li>\n<\/ul>\n<p><strong>In order for this curriculum to be effective we have identified the following contextual issues.<\/strong><\/p>\n<p><strong>1. Leadership from the top.<\/strong><\/p>\n<p>If we are serious about high standards in the use of IT in schools, the DfE and related agencies need to set an example. We have data collected regularly inappropriately in word processing documents that should be collected through web forms. Files distributed in .pdf format when the information would be more accessible in web pages and distribution of information in proprietary Powerpoint files when the information, if provided in a web page would be updatable instantly to all and could be integrated and referenced directly with other web based applications. It is no use claiming that IT can be simply picked up by osmosis when there is so much evidence of weak practice across both public and private sectors.<\/p>\n<p><strong>2. Examples of good practice.<\/strong><\/p>\n<p>Establish a wiki where examples of good practice can be linked to the programmes of study to provide clear alternatives for implementation. We have removed much of the jargon and specialist technical vocabulary from the programmes of study because these can be provided with as much detail as necessary in the Wiki. This will encourage community participation and bring together special interest groups such as NAACE and CAS to fill the gap left by QCDA aa well as shifting the initiative to grass roots support and development.  Evidence from on-line digital communities suggests that this approach can be successful.<\/p>\n<p><strong>3. Research<\/strong><\/p>\n<p>Prioritise research on the effectiveness of each aspect of the programmes of study in contributing to raising standards, not forgetting that technology has a reason to be learnt in its own right as well as a service to learning in other subjects. Ensure that research findings are publicised and feed in to any review process so that in time the teaching programme is optimised through the use of objective evidence.<\/p>\n<p><strong>4. Review<\/strong><\/p>\n<p>Set up a biannual review to ensure that the content of the POS is kept relevant and to prioritise the provision of supporting material and research projects. The review committee can be made up from volunteers from CAS, NAACE, ITTE and MirandaNet and so costs would be minimal.<\/p>\n<p><strong>5. Qualifications<\/strong><\/p>\n<p>The great majority of children should leave school with a recognised high quality qualification that is directly supported by the programmes of study.<\/p>\n<p>The MirandaNet <a href=\"https:\/\/www.mindmeister.com\/215850627\/a-changing-ict-curriculum-landscape-exploring-education-futures-theo-kuechel\">mind map<\/a> recorded the wider views of our membership that this report is based on.<\/p>\n<p>Two MirandaNet collaborative articles build up to this report:<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/ict-curriculum-consultation\/\">The ICT curriculum consultation<\/a><\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/can-schools-throw-out-their-computers\/\"> Can schools throw out their computers?<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Co-ordinators of MirandaNet contributions to the ICT curriculum consultation: Christina Preston, MirandaNet; Ian Lynch, GEBOL; Theo Keuchel, MirandaNet; Andrea Forbes, Texas Instruments; and, Iris Lanny, Oracle. Background There is a statutory requirement for all schools in England to provide an &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/our-ict-curriculum\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":4058,"menu_order":100,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3102"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=3102"}],"version-history":[{"count":41,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3102\/revisions"}],"predecessor-version":[{"id":3104,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3102\/revisions\/3104"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4058"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=3102"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}