{"id":3124,"date":"2012-11-24T12:31:37","date_gmt":"2012-11-24T11:31:37","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=3124"},"modified":"2013-02-07T22:05:14","modified_gmt":"2013-02-07T21:05:14","slug":"building-and-sharing-professional-knowledge","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/building-and-sharing-professional-knowledge\/","title":{"rendered":"Developing effective professional communication models using technology"},"content":{"rendered":"<h3><strong>Digital Approaches to collaboration<\/strong><\/h3>\n<p>Contributions co-ordinated by Fellows: Matthew Pearson, Rachel Jones, Roger Turner and Katya Toneva. Accompanying mind map: <a href=\"https:\/\/www.mindmeister.com\/213557446\">Digital approaches to building and sharing professional knowledge <\/a><\/p>\n<p>Professional Development needs to change radically to meet the needs and challenges of the digital age.  We now have very powerful tools at our disposal for sharing professional knowledge in new ways, and the challenges to all, especially academics and policy makers, is to develop ways of harnessing this potential so that impacts on practice are maximized and a real culture of innovation and creativity is fostered amongst teachers.<\/p>\n<h3><strong>The power of the grassroots and the unconference<\/strong><\/h3>\n<p>Grassroots movements to share teacher knowledge are already well established.  Teachmeets use an ‘unconference’ approach to allow teachers to share knowledge of what works in classrooms without the hierarchy and power structures of traditional conferences and face to face CPD events.  Mirandanet has been leading the way with this with the MirandaMod series of events which bring together academics, industry experts and teachers to share knowledge using the methodology of the unconference. In the online space, twitter is providing a medium for teachers to connect and share knowledge in radical new ways. Twitter has also provided the context for #ukedchat and similar chat sessions which allow educators to gather online to share ideas.  Teachmeets and twitter are two major manifestations of the ways in which digital culture is enabling new ways for teachers to share practice.  No longer restricted to talking to staff in their own school or their immediate geographical area, new alliances and previously unachievable combinations of skills and interests can be achieved.<\/p>\n<h3><strong>Moving from traditional CPD to digital collaborative approaches<\/strong><\/h3>\n<p>Traditional CPD approaches are characterised by being a combination of ‘text-heavy’ and ‘expert-led’.  This means that knowledge is often shared in the form of long written documents (particularly from universities) and the expertise is seen to reside within an expert who leads the CPD.  Digital technologies will allow us to challenge this model and augment it with new ways of creating and sharing knowledge. A move towards more video based CPD is crucial, as video resources can enable participants to see classroom practices contextualized in a far richer and more efficient way than text descriptions.  CPD systems which allow teachers to observe what is happening in their classroom and share this practice with others are examples of the power of moving image as a CPD tool.   There needs to be an emphasis on models of CPD which stress the collaborative nature of professional knowledge and where the focus is on building a community of practice and enabling participation by recipients.<\/p>\n<h3><strong>New frameworks and platforms<\/strong><\/h3>\n<p>Teacher professional development is currently happening on many different online platforms, from twitter to Linked-In, conversations on sites such as the TES forum and similar sites.   This multiplicity of platforms is a necessary function of the enormous choices available online, but we need to look in detail at whether a complementary online platform solely aimed at teacher professional development is needed.  The advantages of concentrating activity in one place are clear, and it will prevent the possible fragmentation of knowledge which is likely to happen at the present moment.   The importance of digital curation also needs to be addressed. Digital curation, namely the selection, preservation and tagging of content into forms which are easily reusable by others, is essential in an environment where there is far more content than can ever be reviewed individually by teachers.<\/p>\n<p><strong>Conclusion<\/strong><\/p>\n<p>Digital technology has an enormous potential to allow new kinds of professional knowledge to be created and shared.  The central feature of digital resources online is their democratic nature; they can be created by anyone, shared by anyone and used in whatever way practitioners find appropriate.  New forms of creating and disseminating knowledge which move beyond the traditional use of text are now possible and these have the potential to make sure that high quality CPD is delivered to more teachers than ever before.<\/p>\n<p>*************************************************************************<\/p>\n<p>Another MirandaLink article on sharing professional knowledge is called: I<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/is-there-an-alternative-to-powerpoint-really\/\">s there really an alternative to Powerpoint<\/a>?<\/p>\n<p>The article above relates to the theory and practice on collaborative learning that MirandaNet Fellows have been developing at <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMods<\/a> since 2005.  Email &#x63;h&#x72;&#105;&#x73;&#x74;i&#x6e;&#97;&#x40;&#x6d;i&#x72;&#97;&#x6e;&#x64;a&#x6e;&#101;&#x74;&#x2e;a&#x63;&#46;&#x75;&#x6b;  for <a href=\"http:\/\/www.mirandanet.org.uk\/publications\/\">publications<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Digital Approaches to collaboration Contributions co-ordinated by Fellows: Matthew Pearson, Rachel Jones, Roger Turner and Katya Toneva. Accompanying mind map: Digital approaches to building and sharing professional knowledge Professional Development needs to change radically to meet the needs and challenges &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/building-and-sharing-professional-knowledge\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1388,"menu_order":90,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3124"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=3124"}],"version-history":[{"count":22,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3124\/revisions"}],"predecessor-version":[{"id":3127,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3124\/revisions\/3127"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1388"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=3124"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}