{"id":3134,"date":"2012-11-24T12:42:59","date_gmt":"2012-11-24T11:42:59","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=3134"},"modified":"2014-03-18T22:21:40","modified_gmt":"2014-03-18T21:21:40","slug":"ict-professional-development","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-professional-development\/","title":{"rendered":"Continuing Professional Development: multimedia resources and training for teachers"},"content":{"rendered":"<h2>Formal ICT Professional development: the challenges<\/h2>\n<p><strong>Report coordinators: Matthew Pearson, Rachel Jones, Roger Turner.<\/strong><\/p>\n<p><strong>Accompanying mind map resource: <a href=\"https:\/\/www.mindmeister.com\/213557041\">Designing continuing professional development <\/a><br \/>\n<\/strong><\/p>\n<p>The challenges to formal teacher professional development that will arise in the next 5 to 10 years are considerable, yet the opportunities to transform practice and create a generation of teachers delivering a world class ICT curriculum are within our grasp. Innovations in ICT and the exponential growth of the digital world will not patiently wait for educators to catch up and implement change at their own pace.  Rather than a programme that is built on gradual and incremental improvements to existing practice, we need to embrace methodologies for CPD in ICT that move practice on at a much greater pace.<\/p>\n<p>Current CPD is often based on the premise of making an individual teacher better within her or his classroom, and supporting them to become a better teacher within these parameters. Such an approach will not allow teachers to keep pace with the rapid societal changes being caused by the new technologies and new ways of working.<\/p>\n<p>Technology has impacted on all aspects of life, changing the way we do many things forever.  The trend towards ever more powerful computing devices, available at lower cost and with higher levels of usability is set to continue. Digital devices are shrinking, moving from a computer tower under the desk to a laptop on the knees, and now a Smart phone held in the hands.  The next stages of development will see wearable devices and methods of input and output which move beyond touch and keyboard interfaces and into ever more sophisticated yet intuitive modes of control such as natural speech, gesture and eye contact.<\/p>\n<p>For these reasons, Continuing Professional Development for ICT teachers needs to be agile and flexible.  We cannot get bogged down teaching them how to use a particular system in an instrumental and rigid fashion. Instead they must be given chances to develop the necessary intellectual tools to rapidly evaluate technologies as they become available and then make professional judgements about how to put these to use in teaching.<\/p>\n<p>It is also vital to explore cross-curricular links between ICT and other subjects.  The placement of school subjects into silos and the concomitant subject cultures that develop are largely antithetical to creative approaches to delivering education which are found in the real world. Successful organisations break down silos and encourage collaboration, and ICT is use creatively by all employees.  Schools need to adopt this practice and ICT specialists should be working with others, particularly at Key stages 3 and 4.<\/p>\n<h3><strong>Role of Universities<\/strong><\/h3>\n<p>Continuing Professional Development in ICT needs to be built on a solid evidence base of what works, but securing that evidence base is challenging. It requires academics within universities to enter into new partnerships with teachers in schools to increase the quantity and quality of data collection and analysis. Communication and collaboration between the universities and teachers needs to be strengthened, university researchers need to pay more attention to the issues which teachers feel need researching, and they should also be undertaking far more meta-analysis and synthesis of existing studies to create a sustained and efficient knowledge transfer from the research teams to schools.  Academic knowledge remains largely inaccessible to many teachers. The reasons for this are complex, although the use of specialist terminology and writing styles which are densely written and targeted more at publication in journals than in in teachers as an audience is a major one.  The rise of the ‘unconference’ (most notably the <em>Teachmeet’<\/em>) and informal learning networks such as twitter throw down a challenge to academics to convert their knowledge into more accessible formats and think of more creative ways to share this with as many teachers as possible.<\/p>\n<h3><strong>Role of Industry<\/strong><\/h3>\n<p>Alongside an expanded role for academics in driving the development of CPD in ICT, the educational ICT industry needs also to become more involved in the 3 way exchange of knowledge between teachers and academics. Improving the interface between the practical knowledge of teachers and the insights of the university will allow the development of products and services which more closely meet the challenges of the coming years.  The UK once had a world leading education ICT industry with world-class products such as the BBC and Acorn computing platforms.  If the country is serious about competing with the rest of the world in hi-tech and knowledge industries then this golden era needs to be recaptured.<\/p>\n<p><strong> Conclusion<\/strong><\/p>\n<p>Continuing Professional Development programmes for teachers involved in teaching ICT need to recognise the centrality of the subject in the modern knowledge economy and significant investment in staff is needed.  This issue is not simply finding the answer to the question: ‘how do we train enough teachers to be able to teach programming’, but how can we give teachers the chance to develop their creativity, rigour and professional judgement in how to incorporate all aspects of the new ICT curriculum into the teaching and learning practices of the school.<\/p>\n<p>This article has been built on one earlier collaborative article developing by a MirandaNet working group in Prague:<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/poskole-report-prague-june-2012\/\">What does  the 21st century teacher need to know<\/a>?<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/how-can-digital-technologies-support-learners-prague-6th-10th-june\/\">Resources for the 21st century teacher<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Formal ICT Professional development: the challenges Report coordinators: Matthew Pearson, Rachel Jones, Roger Turner. Accompanying mind map resource: Designing continuing professional development  The challenges to formal teacher professional development that will arise in the next 5 to 10 years are &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-professional-development\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1388,"menu_order":100,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3134"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=3134"}],"version-history":[{"count":18,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3134\/revisions"}],"predecessor-version":[{"id":5905,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3134\/revisions\/5905"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1388"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=3134"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}