{"id":349,"date":"2011-07-23T17:34:51","date_gmt":"2011-07-23T16:34:51","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=349"},"modified":"2012-12-30T17:15:09","modified_gmt":"2012-12-30T16:15:09","slug":"history-of-action-research","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/action-research-the-main-principles\/history-of-action-research\/","title":{"rendered":"History of Action Research"},"content":{"rendered":"<p><strong>The history of action research<\/strong><\/p>\n<p>Schön who was the father of action research developed his thinking about the management of change in three key publications: <em>Theory in Practice: Increasing Professional Effectiveness <\/em>(1974), <em>Organizational Learning: A Theory of Action Perspective <\/em>(1978), and <em>Organizational Learning II: Theory, Method, and Practice <\/em>(1996). He revolutionised traditional ideas about professional learning 1987 when he published, <em>The reflective practitioner- how professionals think in action:<\/em><\/p>\n<p>&#8220;I begin with the assumption that competent practitioners usually know more than they can say. They exhibit a kind of knowing in practice, most of which is tacit…Indeed practitioners themselves often reveal a capacity for reflection on their intuitive knowing in the midst of action and sometimes use this capacity to cope with the unique, uncertain, and conflicted situations of practice (p. 8-9)&#8221;<\/p>\n<p>This quotation emphasises the complexity of learning how to practice and the value of tacit knowledge, understanding, conflict and lack of certainty that go beyond what can be expressed in conventional academic prose.<\/p>\n<p>&nbsp;<\/p>\n<p>Schön advocated ‘action research’ as a process for stimulating learning. This term describes a process in which professionals research new theory and practice in their work place and then implement them if the evidence is positive. These ideas were developed in England by educational researchers like Elliott (1991) and Hargreaves (2000) who saw the potential for educational change. In this following decade, these new learning strategies are being refined by the development of new designs for professional learning that focus on three key themes: shared practice, collaborative continuing professional development (CPD) and scholarly reflection (Pickering, Daly and Pachler, 2007).<\/p>\n<p>Somekh (1989; 1995; 2005; 2007),  the eminent researcher, who has supported MirandaNet from the first,  gave early workshops in action research in 1994. These emphasised the constructionist approach to teachers&#8217; learning the MirandaNet subscribed to. She. developed Schön’s action research approach with particular reference to professional learning in digital technologies that developed into a partnership with Davis (1997) who both become MirandaNet Fellows in 1995 . When I founded the professional organisation for educators, the MirandaNet Fellowship, in 1992 little was available in either practice or theory, about the use of digital technologies in classrooms. As a result MirandaNet Fellows invited Somekh to run a workshop in 1995 so that we could establish action research processes within the organisation. Our intention was to build a repository of practitioners’ action research case studies in order to promote a sense of ownership and collaboration. It was the beginning of the MirandaNet Fellows’ conviction that teachers should be reflective and activist professionals influencing policy through research evidence (Preston, 1999: Sachs, 2003: Leask and Preston, 2011, in press).<\/p>\n<p>&nbsp;<\/p>\n<p>This view of teachers as activist professionals runs against the trend of governments in the UK of telling teachers what to do. Running alongside this view at the beginning of the twenty first century were research arguments that teachers were ‘digital immigrants’ and students were ‘digital natives’ (Prensky, 2001). However, these stark labels tended to reinforce a deficit model of teachers and ignore the complexity, the fluidity and the progression of learning. Krause (2007) argued that this simple opposition between ‘immigrants’ and ‘natives’ obscured the complex factors that affected both teachers’ and students’ attitudes and competence like different socio-economic backgrounds, class and gender. In the same year, Bryne and Ross argued in conference, that this reductive binary state of immigrant and native ignored the opportunity for teacher and learner agency and the complexity of the relationship between teachers and learners and technology.<\/p>\n<p>Pachler and Daly (2006) refer to this simplistic contrast as ‘the conventional utopia, dystopia polarization (p.2)’ with which they do not concur. The context is about online communications as a tool in professional learning, but my contention, developed in Chapter two, is that collaborative multidimensional concept mapping provides a similar tool that teachers as professional learners can use to externalise their knowledge and engage in shared knowledge construction and co-construction. Furthermore the Daly and Pachler standpoint is that ‘it is impossible to enter into a debate about new technologies and teacher learning without having an ethical orientation towards the purposes of the technology in relation to the purposes of education (p.3.)’ This is also the underpinning approach in this thesis and relates closely to how the researcher and the teacher educators see their relationship to the teacher as a professional learner. Is their view as ‘expert’ to teacher as learner, or, lead learner\/mentor\/facilitator to teacher as learner? These are important distinctions in, for example, designing ICT CPD programmes.<\/p>\n<p>&nbsp;<\/p>\n<p>In the recent series of three reports about the Information and Communications Technology (ICT) CPD Landscape in England (Pachler, Daly, Pelletier 2010a and b: Pachler, Preston, Cuthell and Allen, 2011) in which both Pachler and Daly have been involved, they continue to highlight the complexity of the ways in which teachers now learn in contrast to the reductive binaries that are presented. They indicate that informal learning, particularly in professional groups, is beginning to emerge as a factor just as opportunities for formal learning become more fragmented. Informal learning about digital technologies may indeed, become more prevalent as the proposed educational cuts begin to take effect. These trends in professional learning will be developed in more detail in Chapter two: literature survey.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The history of action research Schön who was the father of action research developed his thinking about the management of change in three key publications: Theory in Practice: Increasing Professional Effectiveness (1974), Organizational Learning: A Theory of Action Perspective (1978), &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/action-research-the-main-principles\/history-of-action-research\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":319,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/349"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=349"}],"version-history":[{"count":7,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/349\/revisions"}],"predecessor-version":[{"id":351,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/349\/revisions\/351"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/319"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=349"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}