{"id":3506,"date":"2012-12-09T22:30:46","date_gmt":"2012-12-09T21:30:46","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=3506"},"modified":"2013-02-11T19:53:08","modified_gmt":"2013-02-11T18:53:08","slug":"3506-2","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/exploring-education-futures\/3506-2\/","title":{"rendered":"Abstracts and presentations from BETT13"},"content":{"rendered":"<p><strong>1330-1400 Linking CPD, learning and technology<\/strong><\/p>\n<p><strong>David Weston<\/strong><\/p>\n<h2>Technology won’t implement itself<\/h2>\n<p>Buying new technology for a school is a very attractive proposition.  Shiny new technology sends a message to parents that &#8220;our teaching is modern, we&#8217;re preparing your kids for the future&#8221;.<\/p>\n<p>The last government certainly thought so, with record levels of ICT investment in schools that ran up to £0.5 billion a year. Vast sums were spent on new computer labs, interactive whiteboards, wireless networks and laptops. In many cases this has had great effects on attendance and behaviour monitoring, but the evidence that it has led to sustained improvements in learning outcomes is thin.<\/p>\n<p>The current pressures on school budgets now require a new approach. A suggestion of improved learning is no longer sufficient grounds to spend money unless it can be shown that there are no cheaper interventions that have similar or larger positive effects on attainment.<\/p>\n<p>In order to buy with confidence school leaders should explicitly link technology purchases to learning needs, and to ensure that a major portion of any budget is set aside for implementation (i.e. training and support) and on-going evaluation.<\/p>\n<p>The key questions to ask are:<\/p>\n<ol>\n<li>What is the specific pupil learning need that we are trying to address with this purchase? Is there a cheaper or easier way to address it (e.g. working on more effective feedback and questioning or using existing technology more effectively)<\/li>\n<li>Will this technology supplement and support the teaching methods that teachers are already comfortable with, or will it require significant and expensive changes in teaching habits, schemes of work and resources?<\/li>\n<li>What is the risk that this technology becomes unreliable and impedes teaching and learning? What level of technical support, back-up and redundancy (i.e. spares) is needed to prevent this and how can this be maintained over future years?<\/li>\n<li>How will teachers embed the use of this new technology in to their schemes of work and lesson plans? Who are the experts in how to do this effectively and are they readily accessible? Will teachers be given dedicated, regular times to work together to evaluate and refine their approach to using the technology?<\/li>\n<li>Will the technology allow us to address multiple learning needs, is it flexible, upgradable and extendable?<\/li>\n<\/ol>\n<p>No school is short of good ideas or enthusiastic suggestions and it is the tough job of a leader to try and whittle these down to a few high-impact and reliable projects.  It is significantly more effective to have one or two technology projects with significant two-to-three year training and support programmes built in than have several smaller projects and risk having cupboards full of under-used, redundant and\/or broken equipment.<\/p>\n<p>Staff training and learning is possibly the most important element of any technology project, and yet it often ends up at the bottom of the priority list. Here are some dos and don’ts:<\/p>\n<ul>\n<li><em>Do<\/em> plan regular (at least twice per half-term) protected meeting times where teachers who use the technology can collaboratively review their use of it as well as the evidence on how it is affecting pupil learning. They should then plan lessons and create resources to support improvements in the next cycle, with support from an expert where possible.<\/li>\n<li><em>Don’t<\/em> simply send teachers on one-off courses without having a sustained programme of support and collaboration back at school. These courses work very well as expert input to larger processes, but less well in creating sustained improvements by themselves.<\/li>\n<li><em>Do <\/em>regularly (at least termly) evaluate how well the technology is being used, technical support needs, how pupils are being engaged, how learning is being improved, the confidence levels of teachers and further training needs. Feed the information in to the collaborative planning process and reserve some budget to act on issues that arise.<\/li>\n<\/ul>\n<p>David Weston is the Chief Executive of the <a href=\"http:\/\/TeacherDevelopmentTrust.org\/\">Teacher Development Trust<\/a>. He is a former Maths, Physics and ICT teacher, data manager, author, consultant and ITT trainer. David will be presenting a session on CPD, Learning and Technology at the MirandaNet stand in the BETT show on Wednesday 30<sup>th<\/sup> January from 1.30 to 2pm.<\/p>\n<p><strong>1430-1500  The MirandaNet approach to the new ICT curriculum<\/strong><\/p>\n<p>Ian Lynch<\/p>\n<p>The new ICT curriculum is intended to give schools more flexibility but at the same time to reinforce three key learning strands. Digital Literacy, Computing, and ICT. While there has been a great deal of consensus about the need for change, there are still a wide range of valid differences of opinion. Does digital literacy mean the same thing to all? Is computing, programming or something more related to the mathematics of computation? Is ICT simply using to-day&#8217;s technology to aid learning or is it about the transferable knowledge and skills needed to change working practices as the technology changes without needing formal retraining? Are the three strands discrete or is the reality more a mix that is dependent on context? The Mirandanet approach has been to try to arrive at an appropriate balance within the constraints of the current political consensus. It is essentially based on the extensive practical experience of teaching children in the national curriculum age range, tempered with research evidence and the needs of employers.<\/p>\n<p>About me<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/12\/Ian-Lynch.jpg\"><img loading=\"lazy\" class=\"alignleft size-full wp-image-3808\" title=\"Ian Lynch\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/12\/Ian-Lynch.jpg\" alt=\"\" width=\"96\" height=\"96\" \/><\/a>Teacher in 4 Local Authorities an independent school and a CTC<\/p>\n<p>Member of senior management responsible for science and technology setting up the first City Technology College in the UK<\/p>\n<p>Curriculum Director Science and Mathematics CTC Trust<\/p>\n<p>Registered Inspector of schools accredited by Office for Standards in Education<\/p>\n<p>Assessor of the National Professional Qualification for Headteachers<\/p>\n<p>Founded IRIS, the Professional Association for Registered Inspectors<\/p>\n<p>Founded IRL Computer Systems Ltd, ZMS Ltd and The Learning Machine Ltd<\/p>\n<p>Member of the Management Committee for Apache OpenOffice and a committer at the Apache Software Foundation<\/p>\n<p>Provided consultancy to a range of hi-tec companies including Acorn Computers, Psion Plc, Hitachi Software Engineering, Sun Microsystems.<\/p>\n<p>Written successful applications for 3 multilateral EU Transfer of Innovation projects with partners in BG, CZ, DE, NL, ES, RO.<\/p>\n<p>Achieved accreditation of TLM with Ofqual and acceptance of TLM Level 2 Certificate for IT Users for headline league table points.<\/p>\n<p>Founder contributor to the Modern Baccalaureate Foundation.<\/p>\n<p>Specialties: Business start ups, understanding global technological change, understanding education change and management of change, understanding business growth and how innovation can spread, business planning and financial control. Wide connections in many countries through open source communities.<\/p>\n<p><strong>Wednesday 1630 &#8211; 1730<\/strong><\/p>\n<h2>An ICT curriculum for the Knowledge Age<\/h2>\n<p><strong>SPECIAL TREATMENT FOR MATHEMATICS ICT IN SCHOOLS?<br \/>\nby DOUGLAS BUTLER, ICT TRAINING CENTRE, OUNDLE<\/strong><\/p>\n<p>The use of ICT made by school level Mathematics teaching is far more complex than almost all other subjects, involving the creative use of spreadsheets, dynamic software and web-based apps.  At the same time, if harnessed, the potential for ICT to make a serious improvement in the teaching and learning of the subject is enormous.  The level of complexity and technical competence required sadly means that relatively few mathematics teachers are taking advantages of the possibilities that ICT offers.   Mathematics demands a lot from ICT, and this impacts on the devices that can be used effectively as well as the all-important training needs.<\/p>\n<p>The range of software for mathematics is huge, including spread sheets and word processors that need special attention.  The best use of dynamic mathematics software requires an ability to create and select graphical objects on screen, and perform operations that create dependent objects; parameters can be set and varied dynamically.  All this places Mathematics in a league of its own when it comes to training teachers to use all this effectively.<\/p>\n<p>The classic keyboard and mouse interface suits all this perfectly, but now developers are faced with the touch interface offered by most mobile devices: this is definitely not ideal for dynamic software as it offers no ‘mouse signal’, no obvious way to select objects with any confidence, and no way to manipulate them with any degree of fine control.  A fat finger is simply an inappropriate tool for this!<\/p>\n<p>The point of this talk is to plead with IT directors to spare the mathematicians some special consideration when it comes to allocating scarce resources to hardware, software and training.<\/p>\n<p><a href=\"http:\/\/www.tsm-resources.com\">www.tsm-resources.com<\/a><br \/>\n<a href=\"m&#97;&#x69;&#x6c;t&#111;&#58;&#x64;&#x65;b&#117;&#116;&#x6c;&#x65;r&#64;&#x61;&#x72;&#x67;o&#110;&#x65;&#x74;&#46;&#99;&#111;&#x2e;&#x75;k\">deb&#117;&#116;&#108;&#x65;&#x72;&#x40;&#x61;&#x72;&#x67;one&#116;&#46;&#99;&#111;&#x2e;&#x75;&#x6b;<\/a><\/p>\n<h3><strong>Thursday January 31 <\/strong>1530-1600<\/h3>\n<h2>Digital Literacy; Digital Safety; getting the balance right<\/h2>\n<p><strong>Allison Allen, Outstream<\/strong><\/p>\n<p>In an increasingly digitalised age, where children have growing access to uncontrolled online contents, protecting children from online threats through stringent e-safety measures is as important as it ever was. David Cameron’s new adviser on childhood recently advised parents to hack into their children’s emails and monitor their texts.  This presentation will consider the importance of educating children and young people in safe practice online and teaching e-safety as part of the new ICT curriculum to be implemented in 2014.<\/p>\n<p>With the advent of the more flexible and free ‘wiki curriculum’, how can we ensure the online safety of children and involve them and young people in the development of their school’s e-safety policy?   The importance of 21<sup>st<\/sup> Century skills is clear, but the picture of how that translates into the curriculum is confused and lacking in clarity; on the other hand, preparing young people with the digital skills (including how to keep safe online), needed to succeed in a technologically advanced society is critical, and partnership working with the private and voluntary sectors vital to ensure that schools, and teachers, are equipped and confident to teach e-safety.<\/p>\n<p>There must be positive impact of the new curriculum on e-safety: How do we ensure the right balance between freedom online and safety?<\/p>\n<p>View <a href=\"http:\/\/tinyurl.com\/outstream-mirandanetBett13 \">Allison&#8217;s presentation<\/a>.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/12\/AA-new2.jpg\"><img loading=\"lazy\" class=\"alignleft size-thumbnail wp-image-3806\" title=\"OLYMPUS DIGITAL CAMERA\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/12\/AA-new2-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a>Allison Allen is Director of Outstream Consulting, a Trustee of the Board of Management of Naace and a Fellow of MirandaNet; she is joint author of Naace’s ICT Curriculum Framework and currently working with NfER\/Futurelab on their Enquiring Schools programme.<\/p>\n<p>She taught for many years before joining the Local Authority as senior ICT Adviser in School Improvement, responsible for improvement through the impact of technologies and e-safety across schools and the council, later becoming a director of the London Grid for Learning and Chair of the pan-London Teaching and Learning action group. Subsequently Allison joined Becta as the London Regional Manager working with all 33 LAs, the range of schools and developing ICT and e-safety activity as well as facilitating national conferences.<\/p>\n<p>Allison led the team that successfully wrote national e-safety guidance for FE &amp; Skills and vulnerable learners.  Other published national research includes a review of the ICT CPD landscape.  The “ICT Skills Briefing” publication has featured her writing on e-Safety and she led a worldwide “MirandaMod” debate on e-Safety Concepts at the IoE.  She is a 3<sup>rd<\/sup> Millennium Learning Award Guide and Impact Award Judge.<\/p>\n<p>As Lead ICT Mark assessor, raising attainment through technology, and e-Safety specialist, she is a keynote speaker and offers consultation to UK and international schools and organisations; exceptional, unsolicited client feedback is testimony to the quality of these activities.<\/p>\n<p><strong>Friday Ist February 1100-1130<\/strong><\/p>\n<h2>Technology and the Listening Environment<\/h2>\n<p><strong>Roger Turner <\/strong><\/p>\n<p>It has long been recognized that the impact of the faulty transmission of the speech signal from the sender to the receiver has for too long not been recognized or been tolerated in far too many of our schools to the detriment of children and young people’s attainment and well-being.  Poor classroom design that lacks both appropriate acoustic treatment and ‘soundfield’ amplification should be challenged, not least on the grounds of equality but in order to improve the potential for learning of all students, including those with SEND and for EAL students.<\/p>\n<p>This presentation will show the negative impact of high reverberation and external and internal noise pollution on speech intelligibility and the subsequent inhibiting of student academic progress.  It will detail the evidence for the necessity of not only installing acoustic materials but also ‘soundfield’ systems in classrooms to ensure that all students are able to consistently hear speech intelligibly wherever the speaker is in relation to the listener however good the classroom acoustic is, drawing on the research by Boothroyd (2012) and Ostergren (2011) amongst others.  It will look at the critical distance the voice can travel and how technology can overcome the deterioration in voice clarity and intelligibility over distance. It will review the research that demonstrates the improvement in student attainment, on-task behaviours, self-confidence and the maximization of the productive use of lesson time as well as the positive impact on teachers and their effectiveness in securing student learning.<\/p>\n<p>View <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/12\/RT-presentation-1.ppt\">Roger&#8217;s presentation<\/a>.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/12\/Roger-Turner1.jpg\"><img loading=\"lazy\" class=\"alignnone size-thumbnail wp-image-3812\" title=\"Roger Turner\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2012\/12\/Roger-Turner1-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/><\/a><\/p>\n<p><strong>Friday Ist February 1530-1600 <\/strong><\/p>\n<h2><strong>An agenda for professional communities: building and sharing professional resources to underpin policy<\/strong><\/h2>\n<h2 style=\"color: #000000; font-family: Georgia, 'Bitstream Charter', serif; line-height: 1.5em; font-size: 1.8em; font-weight: normal; margin-top: 0px; margin-right: 0px; margin-bottom: 20px; margin-left: 0px;\">Re-engineering education: a call for collective action<\/h2>\n<p><strong>Professor Marilyn Leask &amp; Dr Sarah Younie: <\/strong><\/p>\n<h2>Education Futures Collaboration (EFC)<strong><\/strong><\/h2>\n<p>The Education Futures Collaboration is an e-infrastructure which provides a network for practitioner education research.  What makes it unique is that it aims to provide an integrated forum for qualitative research that will empower all practitioners, to progress their own practice and improve the learning outcomes of the pupils they work with through a shared community of enquiry.<\/p>\n<p>The EFC harnesses the expertise of educators worldwide through the power of modern e-communications to connect excellence in teaching and learning and evidence-based practice across time and place. The EFC is brokering a joined-up profession to improve the quality of outcomes for learners through the provision and use of diagnostic tools and interventions to overcome barriers to the learning of specific curricular topics<\/p>\n<p>The vision of the EFC is to:<\/p>\n<ul>\n<li>Enhance the student experience through evidence informed practice<\/li>\n<li>Share pedagogical knowledge to support  and influence best practice and policy<\/li>\n<li>Enhance the quality of teaching in HEIs<\/li>\n<li>Support networks of collaboration in higher education<\/li>\n<\/ul>\n<p>What can the EFT do for you?<\/p>\n<ul>\n<li>Support and develop quality pedagogical and practitioner based learning between schools, HEIs and alumni<\/li>\n<li>Provide a forum for collaborative enquiry across a range of teaching environments to support the best possible outcomes for students of all ages<\/li>\n<li>Provide a repository for authoritative documentation on best practice in teaching and learning<\/li>\n<\/ul>\n<p><strong>Saturday<br \/>\n<\/strong><\/p>\n<h2><strong>Can digital devices really have an impact on learning?<\/strong><\/h2>\n<p><strong>David Obst<\/strong><\/p>\n<p><strong><\/strong><em>Wissenschaftlicher Mitarbeiter, Technische Universität Dresden, Fakultät Mathematik und Naturwissenschaften, Fachrichtung Physik. Professur Didaktik der Physik<\/em><\/p>\n<p>How can we prepare our teachers for the future? During the last years the range of ICT tools available in schools has risen very fast. From the perspective of our university their are two different stands we need to follow:<\/p>\n<p>1.) We urgently need to reform and adapt our education for our student teachers. Our aim must be the best possible preparation for the school, and this includes not just knowledge about the different tools but also some experience and the ability to decide which tool is appropriate at what time. Also teachers from schools express their expectation that young teachers from university bring &#8220;fresh air&#8221; and are able to deal with IWB and other tools. During my talk I&#8217;d like to present our approach and a reflection of our journey during the last three years, including the experiences and problems we&#8217;re facing.<\/p>\n<p>2.) On the other hand we need to ensure that we set up help for our in-service teachers. As policy in Saxony didn&#8217;t learn from the big roll-out of IWB in the UK there is an incredible need for training if they should not end as a wasted technique. Because of this a physics-specific two day teacher training session was developed and conducted regarding the experiences and advice from English studies. In contrast to other training we had the possibility to observe these lessons and analyse if it was really successful and made a difference. First results will be presented at the presentation.<\/p>\n<p>During the last three years we have made a big step forward but there is still a long way to go. I&#8217;m looking forward to sharing experiences with the audience to improve our approach, and to get inspired.<\/p>\n<p>View <a href=\"http:\/\/prezi.com\/2nqmy7bk3wkn\/bett-2013-mirandamod\/\">David&#8217;s Prezi<\/a>.<\/p>\n<p>Read <a href=\"http:\/\/wp.me\/p2Tth6-4p\">David Obst&#8217; BETT Blog<\/a>.<\/p>\n<h2 style=\"text-align: left;\">How  might ICT\/digital technologies be used to motivate and facilitate the inclusion of students from diverse backgrounds and disadvantage?<\/h2>\n<h2>Using technology to differentiate instruction and address specific learning needs<\/h2>\n<p><strong>Katya Toneva<\/strong><\/p>\n<p><strong><\/strong> Technology can motivate and facilitate the inclusion of students from diverse backgrounds and disadvantage in unlimited ways through content input, learning activities, enhanced interaction and feedback, and opportunities to demonstrate comprehension. In these processes, it is important to use inclusive technologies and make learning materials accessible to all students regardless of technological competence, confidence or disability.  In the world of fast moving and evolving digital technologies, the instructional practices that make use of them are countless. This presentation will focus on the needs and solutions for students with reading disabilities and students who learn differently because of their linguistic backgrounds.<\/p>\n<p align=\"left\">Before discussing specific technologies that can support teachers’ inclusive practices, we will consider how to effectively integrate technology into instruction. We have adopted the slogan “It is not about technology, it is about how well we use it” – teachers need to keep their focus on the learning outcomes, not on the technology itself. For example, teachers could support student with dyslexia who might normally struggle with their reading offering them to listen an audio recording through headphones. By providing audio, visual, or concept-mapping support available in class and online, teachers could extend students’ learning time without extending their work hours.<\/p>\n<p>In this presentation, we will share a few examples of using suitable technologies and resources that can support students with learning difficulties. We will also explore tools for English language learners, who could benefit from the opportunity to hear and view the text simultaneously. We will show how to make use of free software, as well as basic technologies that can be found in almost every classroom.<\/p>\n<p>Dr Katya Toneva<br \/>\nMirandaNet Senior Researcher (E-learning)<\/p>\n<p><strong>1415 – 1445<\/strong> <strong>How can partnership with colleagues abroad help teaching and learning? <\/strong><\/p>\n<p>Led by Dan Bowen and Dave Smith<\/p>\n<p>Dan is a teaching and learning advisor in Surrey and the South East. He has over 15 years of experience in schools as a Head of Department (ICT\/Computing), Assistant Head of Sixthform and is currently a school governor. As an advisor, Dan has worked with many schools in the UK and internationally and delivered several Key Notes and training sessions. As well as his main role supporting schools he is currently working on educational technology projects within the Royal Navy. He has also worked on projects with the Police, Fire Service, Prison Service and RNLI.<\/p>\n<p>He has several areas of interest within education including assessment for learning, mobile learning, innovation, blogging, Web 2.0 and is currently undergoing the new Professional Qualification for School Inspection. Dan is passionate about E-Safety and its role in securing real innovation in schools. His MSc dissertation was the impact of blogging on high school teaching and he has taken several teachers to share practice from others including trips to Sweden and within the UK.<\/p>\n<p>He is a working member of the Computing at School group as well as a member of NAACE, MirandaNet and on twitter is @dan_bowen. He is a also an ambassador for CEOP and a STEM ambassador to help promote technology and engineering in the classroom.<\/p>\n<p><strong>1500-1600<\/strong>  <strong>A Think Tank: How ICT\/digital technologies might be used to motivate and facilitate the inclusion of students from diverse backgrounds and disadvantage?<\/strong><\/p>\n<p align=\"center\"><strong><span style=\"text-decoration: underline;\">Cognitive Visual Integration Therapy<\/span><\/strong><\/p>\n<p>Why are so many children not achieving and badly behaved?<\/p>\n<p>Why are we so short of skilled workers?<\/p>\n<p>Why do so many brain training games produce no discernible long-term cognitive changes? (Fernandez and Goldberg 2012)<\/p>\n<p>What are the cognitive skills that learners need in place to manage learning and behaviour at a sufficient level to thrive in a knowledge economy?<\/p>\n<p align=\"center\"><strong>Cognitive Visual Integration therapy <span style=\"text-decoration: underline;\">is<\/span> providing solutions.<\/strong><\/p>\n<table width=\"486\" border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td valign=\"top\" width=\"486\">\n<p align=\"center\"><strong><span style=\"text-decoration: underline;\">Case Studies<\/span><\/strong><\/p>\n<ul>\n<li><strong>   <span style=\"text-decoration: underline;\">Child A: <\/span><\/strong>went through school to 14 years with record of low level behavioural problems and having to work very hard to keep up. Diagnosed with double vision and associated problems. 12 months therapy; then he went to the top of the year group with much calmer behaviour.<\/li>\n<li><strong><span style=\"text-decoration: underline;\">Child B<\/span>: <\/strong>17 years old,<strong> <\/strong>expelled from 8 schools, parents banned from the premises of 4 schools. Undertook therapy. 12 months later college phoned to say that the student was now studying a L3 qualification, calmer, and thriving.<\/li>\n<li><strong><span style=\"text-decoration: underline;\">Child C<\/span><\/strong> attempted suicide; occasional school refuser; big gap between verbal skills and written skills; could not plan extended written work; very poor sense of time, very poor at delayed gratification. 18 months therapy, moved to the top of the year.<\/li>\n<li><strong><span style=\"text-decoration: underline;\">Child D<\/span><\/strong>: 6 years old, development retarded to 3.5years of age; lost most vision and use of left limbs. 18 months therapy, followed by catch-up tutoring – now 14 years old has skipped Y9, and is at the top of Y10.<\/li>\n<li><strong><span style=\"text-decoration: underline;\">Child E<\/span><\/strong>:  7 years old, ADHD, no visual memory, history of behavioural problems. 18 months of therapy plus some follow-up tutoring – now 14 years old, settled in mainstream school, performing well.<strong><\/strong><\/li>\n<\/ul>\n<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>Providing the right kind of ‘brain training’ could be the answer.<\/p>\n<p>In this interactive session, help us to work out which digital tools might help and why, and how to spread knowledge about this solution more widely.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>1330-1400 Linking CPD, learning and technology David Weston Technology won’t implement itself Buying new technology for a school is a very attractive proposition.  Shiny new technology sends a message to parents that &#8220;our teaching is modern, we&#8217;re preparing your kids for &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/exploring-education-futures\/3506-2\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":3022,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3506"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=3506"}],"version-history":[{"count":7,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3506\/revisions"}],"predecessor-version":[{"id":3509,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3506\/revisions\/3509"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3022"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=3506"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}