{"id":354,"date":"2011-07-23T18:25:02","date_gmt":"2011-07-23T17:25:02","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=354"},"modified":"2015-05-20T19:08:26","modified_gmt":"2015-05-20T18:08:26","slug":"concept-mapping-as-a-research-tool","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/concept-mapping-as-a-research-tool\/","title":{"rendered":"Concept mapping"},"content":{"rendered":"<h2>‘The universality and ubiquity of concept maps’<\/h2>\n<p>The title of this article is also the title of a keynote by the two gurus of concept mapping, Alberto Canas and Jim Novak in Chile at the international concept mapping conference in 2010 ( www.itmc.us). Their work since the 1950s has been inspiring in the analysis of contexts where constructive learning is being promoted &#8211; but many members of this movement concentrate on the scoring of maps rather than the quality of the learning which is not the aspect of mapping that  MirandaNet Fellows are interested in.<\/p>\n<p>Concept maps have been a key area of research in the  MirandaNet Fellowship since about 2000. I describe below my own work in this area as well as my collaborations with two senior Fellows, Marilyn Leask and John Cuthell. You can email me for copies of drafts of these papers as we would be most interested in feedback ch&#114;&#105;&#115;&#x74;&#x69;&#x6e;&#x61;&#64;m&#105;&#114;&#97;&#x6e;&#x64;&#x61;&#x6e;et&#46;&#97;&#99;&#x2e;&#x75;&#x6b;.<\/p>\n<p><strong>Concept maps from a semiotic point of view<\/strong><\/p>\n<p>I  explore concept maps from the vantage point of two strands of semiotics that I discuss in detail in the article attached below: representation and multimodality. This division helps to identify two types of educators: those who mostly think about concept maps as a means of presenting existing knowledge and ideas in a visual way; and those educators who are more interested in how the map maker has presented new and original connections in creative ensembles. This second position indicates an interest in what the map makers know already rather than what has been retained of has been taught. Of course, some educators see the maps from both perspectives: representational and multimodal.<\/p>\n<p>The focus of  the discussion in this article  is mainly on how the concept maps are used as research tools. Comments are made on how various theories relate to the methodological position taken by the ImpaCT2 team who were funded by Becta to look at how digital technologies might improve achievement. During the discussion I also comment on how the use of the maps in the literature relates to four different pedagogical perspectives : information transmission; constructivism; and social interaction.<\/p>\n<p>What also emerges is how the academic definitions play out in various contexts. The key terms are ‘concept maps’, ‘mind maps’ and ‘multimodal maps’ and their relationship with ‘multidimensional concept maps’ that are defined as complex multimodal signs in terms of makers, production, levels and modes. Overall the literature study moves from positivist approaches to concept map analysis that stem from a representational viewpoint towards qualitative strategies that are more considerate of the map makers’ perspective. The latter tends to be the stance of those interested in multimodality, meaning making and qualifiable multimodal meaning-making. Thirdly the review analyses the literature that covers concept maps as complex multimodal signs. In this section the multimodal affordances of concept mapping software are discussed. Finally I turn to the multiple relationships that are facilitated when concept maps are used between the educator, the researcher and the map maker.<\/p>\n<p>The article is <a href=\"http:\/\/www.mirandanet.org.uk\/blog\/wp-content\/uploads\/2011\/07\/‘The-universality-and-ubiquity-of-concept-maps’.pdf\">‘The universality and ubiquity of concept maps’(1)<\/a>. The full draft thesis on concept mapping is <a href=\"http:\/\/www.mirandanet.org.uk\/blog\/wp-content\/uploads\/2011\/07\/Insightsthesismaster-230211MSv4.1.pdf\">Gaining insights into educators&#8217; understandings of digital technologies<\/a>.<\/p>\n<p><strong>Using concept maps to improve learners&#8217; self esteem and develop collaborative knowledge creation<\/strong><\/p>\n<p>Marilyn Leask and I have developed an approach to using mapping in collaborative work called PIMS.   This draft article that proposes a model of research using concept mapping with policy makers and practitioners working as co-researchers. The model meets the challenge rapid research for selected topics. It was developed initially for pragmatic reasons in response to a requirement from a UK government agency for rapid research on digital technologies. The acronym PIMS indicates key features of the model:<\/p>\n<ul>\n<li>P –policy makers and practitioners are involved as co-researchers<\/li>\n<li>I – <span style=\"text-decoration: underline;\">I<\/span>ntensive data collection takes place with simultaneous debate and analysis in a community of practice context<\/li>\n<li>M – <span style=\"text-decoration: underline;\">m<\/span>ultidimensional concept <span style=\"text-decoration: underline;\">m<\/span>aps (MDCMs) are used to gather and shape ideas created through debate<\/li>\n<li>S – <span style=\"text-decoration: underline;\">s<\/span>tandard research methods and tests are used to complement the above.<\/li>\n<\/ul>\n<p>This article reports on the research approach developed and tested out on two research projects funded by a national agency.<\/p>\n<p>We are currently working on an article about how maps can be used in CPD for professionals to develop the role of learners as co-researchers.  A draft version can be downloaded <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/research-themes\/concept-mapping-as-a-research-tool\/buildingprofessionalknowledgeusingcm-6\/\" rel=\"attachment wp-att-1569\">BuildingProfessionalKnowledgeusingCM<\/a><\/p>\n<p><strong>Looking at the value of scoring maps in learning contexts<\/strong><\/p>\n<p>John Cuthell and I have also analysed the value of concept maps in different learning contexts and experimented with reading and scoring the maps in a paper called, <em>The Use of Concept Maps for Collaborative Knowledge Construction,<\/em> that concentrates on our use of concept mapping in <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\">MirandaMods,<\/a> describes the development of methodologies for using multidimensional concept mapping as a data collection method, and as a medium to stimulate the creation and dissemination of collaborative knowledge. These concept maps were collected during an initial series of iGatherings organised by MirandaNet Fellows<a title=\"\" href=\"#_ftn1\"><sup><sup>[1]<\/sup><\/sup><\/a><sup>. <\/sup>in the context of work-based learning for education professionals. The first stage of this programme was designed on the MirandaMod model<a title=\"\" href=\"#_ftn2\"><sup><sup>[2]<\/sup><\/sup><\/a>, an informal, loosely structured unconference<a title=\"\" href=\"#_ftn3\"><sup><sup>[3]<\/sup><\/sup><\/a> of like-minded educators to share ideas about the use of technology to inspire others.<\/p>\n<p>This first stage of the research project aimed to<\/p>\n<p>• develop a scoring system for collaborative multimodal concept maps relating to an analysis of the potential effectiveness for identifying concept development and the formation of praxis .<\/p>\n<p>• post preliminary resources on the web as an example of the knowledge creation planned for Stage Two from September to March 2010.<\/p>\n<p>The web-based program MindMeister <a title=\"\" href=\"#_ftn4\">[4]<\/a>and Inspiration<a title=\"\" href=\"#_ftn5\">[5]<\/a> were compared as the vehicle for this study for the creation and dissemination of knowledge, rather than simply for data collection.<\/p>\n<p>Existing tools that have been used to analyse concept maps have either focused on a map’s content in order to identify the level of a student’s understanding of a particular area of knowledge (Ruiz-Primo, 2000; Park &amp; Calvo, 2008), or have examined the complexity of the map itself (Mavers, Somekh et al., 2002, Harrison et al, 2002). Whilst these tools provided data about the complexity of the maps that had been created, they failed to provide data that related to the process of knowledge construction. They also concentrate on the learning of individuals rather than on collaborative learning.<\/p>\n<p>What was needed, therefore, was a system that enabled the process of knowledge construction to be tracked, identified and analysed as it takes place within a professional group. The functionality of the program enabled the elements of collaborative mapping process to be identified, together with the identity of those involved in the process.<\/p>\n<p>In order to develop a new scoring methodology data sets were compiled that could be analysed across a number of dimensions. As a result of the analysis seven types of collaborative learning activities were identified in the creation of the maps: Adding; Editing; Inserting; Moving; Removing; Renaming and Repositioning. Each activity could be related to the relevant mapmaker, and the inter-related processes of constructing the map and building knowledge could be identified. The sequences of mapping actions were graphed, and the resulting graphs plotted the frequency of each activity across the progress of the creation of the maps. The graphs showed the inter-relationship of actions, particularly those of inserting, renaming and repositioning – the key activities in the process of knowledge creation.<\/p>\n<p>The analysis of the maps in this initial stage indicates the potential effectiveness of the methodology in building a picture of the collaborative knowledge process, rather than the existing models of either content analysis of map complexity.<\/p>\n<p>It can be further said that the complexity of the maps is directly related to the number of contributions by, and interactions of, the mapmakers. This initial study has revealed the complexity of the task of finding an effective methodology that will reflect the multiple perspectives from which this data is drawn.  The preliminary outcomes raise a series of questions:<\/p>\n<p>How effective are collaborative concept maps in creating a record of an event?<\/p>\n<p>How do collaborative concept maps stimulate thinking and debate in a space and dimension other than the face-to-face environment or the virtual FlashMeeting?<\/p>\n<p>How do collaborative concept maps facilitate new thinking that can support professional development and feed back into the institution?<\/p>\n<p>In the next stage these questions will be used to inform a system for a more extensive evaluation of these multidimensional concept maps. The analysis of their effectiveness in identifying concept development and the formation of praxis in the context of work-based learning for education professionals will be part of this longer study, which should tell us more about the nature of collaborative professional learning.<\/p>\n<div>\n<hr align=\"left\" size=\"1\" width=\"33%\" \/>\n<div>\n<p><a title=\"\" href=\"#_ftnref1\">[1]<\/a> <a href=\"..\/..\/\">http:\/\/www.mirandanet.org.uk<\/a> Last accessed 18<sup>th<\/sup> August<\/div>\n<div>\n<p><a title=\"\" href=\"#_ftnref2\">[2]<\/a> <a href=\"..\/..\/mirandamods\/\">http:\/\/www.mirandanet.org.uk\/mirandamods\/<\/a> Last accessed 18<sup>th<\/sup> August<\/div>\n<div>\n<p><a title=\"\" href=\"#_ftnref3\">[3]<\/a> <a href=\"http:\/\/en.wikipedia.org\/wiki\/Unconference\">http:\/\/en.wikipedia.org\/wiki\/Unconference<\/a> Last accessed 18<sup>th<\/sup> August<\/div>\n<div>\n<p><a title=\"\" href=\"#_ftnref4\">[4]<\/a> <a href=\"http:\/\/www.mindmeister.com\/\">http:\/\/www.mindmeister.com<\/a><\/div>\n<div>\n<p><a title=\"\" href=\"#_ftnref5\">[5]<\/a> <a href=\"http:\/\/www.inspiration.com\/\">http:\/\/www.inspiration.com\/<\/a> Last accessed 18<sup>th<\/sup> August<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<div>\n<div>\n<p><a href=\"#_ftnref1\"><br \/>\n<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>‘The universality and ubiquity of concept maps’ The title of this article is also the title of a keynote by the two gurus of concept mapping, Alberto Canas and Jim Novak in Chile at the international concept mapping conference in 2010 &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/concept-mapping-as-a-research-tool\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1337,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/354"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=354"}],"version-history":[{"count":10,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/354\/revisions"}],"predecessor-version":[{"id":1571,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/354\/revisions\/1571"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1337"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=354"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}