{"id":368,"date":"2011-07-23T22:42:56","date_gmt":"2011-07-23T21:42:56","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=368"},"modified":"2012-12-10T20:54:40","modified_gmt":"2012-12-10T19:54:40","slug":"building-communities-of-practice","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/building-communities-of-practice\/","title":{"rendered":"Communities of practice"},"content":{"rendered":"<p>The MirandaNet Fellowship was set up in 1992 by Professor Christina Preston as a means of sharing professional knowledge in the use of digital technologies. At this time one day classes for teachers in educational computing were proving inadequate and teachers were feeling de-skilled and overwhelmed. Learning as a group suggested itself as a plausible solution, especially as the potential of the internet was emerging in providing a means of communication online between face to face meetings.<\/p>\n<p>This notion of  ‘social interaction’ as a pedagogical perspective expands Freire’s notion of the wider value of collaborative learning in social and cultural contexts in order to take charge of the agenda (1967). One of the approaches to ICT CPD recommended by the Landscape Review is a greater concentration on the role of groups of professionals who meet informally to exchange the theories and practices (Daly, Pachler and Pelletier 2009a). A key term for this kind of collaborative exchange is ‘community of practice’ (CoP) first coined by Lave and Wenger (1991) to denote professional groups of people who:<\/p>\n<p>&#8220;engage in a process of collective learning in a shared domain of human endeavour: a tribe learning to survive, a band of artists seeking new forms of expression, a group of engineers working on similar problems, a clique of pupils defining their identity in the school, a network of surgeons exploring novel techniques, a gathering of first-time managers helping each other cope. In a nutshell: communities of practice are groups of people who share a concern or a passion for something they do and learn how to do it better as they interact regularly (Wenger 2004).&#8221;<\/p>\n<p>Scardamalia and Bereiter (1996) developed the idea further by bringing into the learning community a knowledge creation tool. They developed a learning platform, called the Knowledge Forum, designed to assist CoPs of young people to think collaboratively about key questions in the curriculum. Their combined contributions led to identification of gaps in their group knowledge that they fill as a team. The knowledge base is left for the next group. Instead of learning the same information, the new class absorbs the knowledge that is there and digs deeper. This way the school owns a knowledge base in which has pupil ownership. Unfortunately, Scardamalia and Bereiter had difficulties in finding enough schools willing to pilot the software because it does not fit in with the information transmission model that national curricula tend to support.<\/p>\n<p>In MirandaNet&#8217;s emergent Braided Learning theories we have developed the idea of communities of practice from the perspective how these structures can help a professional community to share and distribute knowledge. A key aim is to use this knowledge to influence policy and practice.<\/p>\n<p>Enquire for references: christina&#64;mirandanet&#46;ac&#46;&#117;&#107;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The MirandaNet Fellowship was set up in 1992 by Professor Christina Preston as a means of sharing professional knowledge in the use of digital technologies. At this time one day classes for teachers in educational computing were proving inadequate and &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/research-themes\/building-communities-of-practice\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1337,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/368"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=368"}],"version-history":[{"count":13,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/368\/revisions"}],"predecessor-version":[{"id":374,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/368\/revisions\/374"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1337"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=368"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}