{"id":370,"date":"2011-07-23T22:43:42","date_gmt":"2011-07-23T21:43:42","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=370"},"modified":"2012-10-29T21:44:39","modified_gmt":"2012-10-29T20:44:39","slug":"my-doctoral-journey","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/my-doctoral-journey\/","title":{"rendered":"My doctoral journey"},"content":{"rendered":"<p>Background<\/p>\n<p>The orientation of the doctorate in education toward professional practitioners has offered me an ideal opportunity to reflect on the theory and practice of Continuing Professional Development (CPD) in digital technologies, the field I have been engaged in since the late 1980s. My interest in effective CPD programmes began almost as soon as I began teaching in secondary schools in the 1970s. I soon had a school-wide responsibility for the Continuing Professional Development programmes as well as teaching English, Drama and Media Studies. This remit included the introduction of Information and Communications Technology (ICT) CPD at a time in the early 1980s when teachers were given funding, as of right, for twenty-day courses as well as part-time Masters and Ph.Ds. In 1987, I was seconded to the Education Computing Unit (ECU), King’s College, University of London, to author an educational adventure game and a newsroom simulation with a group of cross-curricula teachers funded by BT. Many of the teachers in the groups were seconded on a twenty one day course entitlement that allowed teacher to pursue an interest related to their teaching. I was seconded to the project for a year.<\/p>\n<p>The team at the ECU were driven by the belief that educational software should not be designed for drill and practice purposes, but should develop the users’ negotiating skills and problem solving capacity. These days we would define these pedagogical approaches as constructivist and social interaction strategies that underpin the approach to learning in this doctorate where they are defined. Since ECU was of this pedagogical persuasion, we were designing educational software in an international group in which the exchange of knowledge was important. This exhilarating CPD experience as a classroom teacher convinced me that educators need hands-on experience of designing, using and evaluating digital technologies in order to translate their value into their own classrooms. This presupposed that the classroom itself was orientated towards learning in groups rather than rows of pupils sitting in front of computer screen in IT suites engaged in the kind of drill and practice exercises that we now call ‘information transmission’<a href=\"#_ftn1\">[1]<\/a> (Preston and Squires, 1988; Preston, 1989; Preston, 1995c).<\/p>\n<p>Conditions for CPD were changing dramatically in 1989, however, when I started as an ICT adviser in London. The twenty-one day CPD entitlement was gone. Suddenly I was teaching groups of teachers from all over London with varying levels of knowledge who had only one day of support cover every year. Often they had no personal access to computers either at home or at school. This training model, short on time and funding, contrasted with my conviction that teachers need CPD programmes designed help them engage for a lifetime in learning about digital technologies.<\/p>\n<p>By 1992 my ‘constructive’ and ‘social interaction’<a href=\"#_ftn2\">[2]<\/a> learning approach, demonstrated in my own software titles, had resulted in an invitation to work in Chile and the Czech Republic. We were all passionate about the ways in which digital technologies could be used to democratise teaching and learning. After some significant transnational discussions about learning in social groups my English, Czech and Chilean colleagues joined together to found the first international community of practice (CoP) for teachers, the MirandaNet Fellowship<a href=\"#_ftn3\">[3]<\/a> (Preston, 1993; Preston, 1995 a &amp; b; Preston, 1999; Lengel, Preston and Mannova 2000). Since then, academic members have developed theoretical and the practical underpinnings, building on Lave and Wenger’s (1991) research into CoPs in education and business. These MirandaNet academics include Allison Allen, John Cuthell, Margaret Danby, Niki Davis, Bryn Holmes, Christina Howell Richardson, Marilyn Leask, Bozena Mannova, John Potter, Bronwyn Stuckey and Sarah Younie, whose papers are discussed, as relevant, in more detail in the thesis. Colleagues from industry who have generously supported the MirandaNet ideal of partnership with teachers include Richard Allen, Ray Barker, Chris Binns, Rachel Jones, Dominic Savage and Chris Yapp. MirandaNet has also had the support of many policy makers such as Doug Brown, Niel McLean and Tim Tarrant who remain in the professional organisation after they have supported particular research projects.<\/p>\n<p>Bridget Somekh, who has supported MirandaNet from the first, gave early workshops in action research in 1994 that supported the constructionist philosophy. The key idea of a progression from Scholar to Fellow was that of Harvey Mellar. Caroline Daly and Norbert Pachler have furthered our understanding of effective knowledge-building and community development in Continuing Professional Development pursuing the same idea that learning is a form of social interaction and not about content first and foremost. My experience over the last thirty years suggests that teachers need to be engaged in this kind of social interaction with digital technology at an intellectual level, rather than a focus on skills alone, so that they can guide pupils in making complex decisions about academic, cultural and social uses of digital technologies and multimodal texts in different contexts.<\/p>\n<p>The digital context<\/p>\n<p>By 2004 I was publishing the evaluation of the New Opportunities Fund (NOF) UK national training programme in ICT for teachers. What emerged in the NOF research was that the lack of appropriate accreditation or formative evaluation was a major factor in the relative failure of this programme (Preston, 2004a). In my doctoral research, I wanted to advance understanding of innovative multimodal methods of assessing teachers’ learning, methods that were formative, which reinforced social interaction and provided models for the teaching of children. Multimodality in this context denotes meaning-making through signs that include speech, gestures, animation, images, ‘body language’ and other forms of non-verbal communication. Very little assessment of learning of the multimodal kind is happening in schools. However, multimodal learning now includes the informal social networking spaces in which learning takes place outside school like Bebo<a href=\"#_ftn4\">[4]<\/a> and Facebook<a href=\"#_ftn5\">[5]<\/a> – those liminal spaces that those who are pushing on the boundaries of digital possibilities inhabit intellectually (Preston and Cuthell, 2009a).<\/p>\n<h4>The professional doctorate<\/h4>\n<p>There are three parts to the doctorate: the portfolio, the Institution Focused Study (IFS) and the final thesis. My first aim in designing my doctoral research across these three parts was to work with teachers to develop their action research publications and tools that would develop their own powers of reflection as co-researchers. My second aim was to reflect on my practice as a teacher adviser. My objectives were to increase my understanding of different research methodologies; to improve my understanding and competences in academic writing; and, to increase my publications in established academic journals.<\/p>\n<p>At the beginning of the doctorate programme I expected to settle into academic disciplines immediately. The portfolio lectures by some academic luminaries were stimulating: exploring professionalism, research methods and globalisation. However, this first portfolio phase deflected me from the aim of learning to write in an academic style. However, I had developed strong writing habits already because, with the confidence derived from my first degree in English, Drama and Media, I had published short stories, poetry and articles in newspapers and professional magazines. This confidence led me on to experimentation with style and forms of argumentation before I had fully mastered that academic genre. However, this is not a counsel against the portfolio approach because fellow students who had a more restricted writing background flourished under the four different supervisors in this phase of the Ed.D.<\/p>\n<p>My experimental tendencies continued into my Institute Focused Study (IFS). At this late point in my career I needed to consider the succession for the MirandaNet CoP. The international outreach has given me an invaluable global perspective on the socio-cultural changes in multimodality realized information and communication practices that are having a profound influence on our lives. The resulting ethnographical study, called Etopia<a href=\"#_ftn6\"><sup><sup>[6]<\/sup><\/sup><\/a><sup>,<\/sup> compared and contrasted my learning about computers from my childhood with similar periods in MirandaNet’s growth; over the years MirandaNet has grown from fifteen members in the UK and the Czech Republic to more than seven hundred members in seventy countries. The evidence for the Etopia study was taken from my journals and articles in which I had identified key incidents that had shaped my own learning and MirandaNet’s development as a learning organisation (Senge,1990).<\/p>\n<p>The Etopia study traces the ways in which the Fellows, who have shared their expertise through MirandaNet e-journals, continue to develop leading-edge uses of digital technologies that promote collaborative knowledge building as well as professional impact on policy. These new approaches are underpinned by an emergent model for online learning called Braided Learning (see definition in Chapter one) developed through the observation of the practice of communities of practice like MirandaNet, The Association for Information Technology in Teacher Education (ITTE)<a href=\"#_ftn7\">[7]<\/a> and Naace<a href=\"#_ftn8\">[8]<\/a>, which is the professional association for those concerned with advancing education through the use of ICT.<\/p>\n<p>The IFS was a productive period in which I co-authored a paper about six international models of online learning, published in a free online journal called First Monday (Haythornthwaite, 2007) and published one academic paper about Braided Learning in The International journal of Web-Based Communities (Preston, 2008a). Although these publications were not derived directly from my doctoral research, they were a direct outcome of the detailed and consistent feedback about fundamental academic principles and appropriate writing styles that I was now receiving from my supervisors.<\/p>\n<p>The chronological framework that resulted from the Etopia study became the focus of an international conference on CPD models funded by the WLE Centre at the Institute of Education, University of London, where MirandaNet research about the vision which CPD experts in England had for teachers’ learning was reported (Preston and Cuthell, 2007). MirandaNet researchers and practitioners in the US and the UK joined in the discussion in London called “What Works Where?”, covering the varied modes of CPD in their country. Key incidents in the learning lives of the delegates, inspired by the framework were reported and these reports were videoed for the Etopia knowledge hub.<\/p>\n<p>A key contributor to this conference was Niki Davis, a founder member of MirandaNet. Of particular relevance was her academic partnership during this period in revisiting the statistics from the MirandaNet evaluation of the UK ICT national CPD programme funded by the New Opportunities Fund from 1999-2003 (Preston, 2004a). A sequence of two papers, investigating the value of Guskey’s five principles for successful CPD programmes, both of which accepted by the British Journal of Education Technology, emphasised the need for an ecological approach to CPD (Davis, Preston and Sahin, 2009a and 2009b). Under the tutelage of one of my co-authors\/colleagues I gained helpful insight into handling statistical information as well as into the process of responding to detailed peer reviews from an e-journal. A further contribution to the Etopia conference was a model for professional engagement developed in the third paper in the ecological series (Davis, 2008). The delegates suggested that this model should be built as an amphitheatre in Second Life,<a href=\"#_ftn9\">[9]<\/a> a free 3D virtual world where users can socialize, connect and create using voice and text chat. Educators can comment on practice in this environment, thus constituting another resource being developed by a MirandaNet Fellow, Leon Cych<a href=\"#_ftn10\">[10]<\/a>.<\/p>\n<p>The evidence presented in this thesis has reinforced my confidence in the validity of my approach to CPD. The experience enabled me to become more explicit in welcoming teachers and students as co-researchers in a collaborative effort to understand learning in multimodal contexts (Leask and Preston, 2011, in press). The study has presented opportunities for some teachers to develop as confident writers for other teachers. Finally, this study has provided me with evidence to challenge mono-modal forms of assessment at all stages of professional learning including the doctoral level.<\/p>\n<p>In contrast to my aspirations towards multimodal assessment, doctoral students participating in a study of Ed.D., assessment expressed some concern about the lack of rigour in the portfolio, but showed no enthusiasm for a shift to a ‘second generation’ models of assessment (Brown, Carnell et al., 2006). My contention is that the majority of students taking doctorates may be hesitant about multimodal assessment: firstly, because they cannot imagine the value of exploring other modes of communication and, secondly, because they fear that other modes may not bring success. The only way to spread the experience, in my opinion, is to begin some well-designed pilots that prepare post-graduate students for changes in teaching and learning.<\/p>\n<p>During this study I have presented my emergent findings at Bath Spa University, Bristol University, Brunel University, Cumberland Lodge, Coventry University, Helsinki University, Leicester University, the Institute of Education and King’s College, University of London and the University of Tallinn. Papers have also been presented at other institutions in Australia, Czech Republic, Greece, Japan, New Zealand, Portugal and the US. Lively discussions have taken place amongst doctoral students, teachers and researchers; about research techniques, learning in communities of practice and the value of multimodal assessment as well as the forms it should take. The emerging literature study provided the editorial of the Reflecting Education Editorial on multimodal concept mapping<a href=\"#_ftn11\">[11]<\/a> , a chapter of an international handbook on collaborative mapping (Marriott and Torres, 2009). This handbook that covers the emerging potential of collaborative mapping was prefaced by Novak and Cañas, the famous developers of concept mapping whose work is discussed in this thesis.<\/p>\n<p>Further research<\/p>\n<p>Whilst I was completing my doctorate, MirandaNet, colleague Marilyn Leask and I were funded by a UK government agency, Becta, to take these concept mapping theories and practices further by testing out the value of multimodal concept maps in the context of teachers’ professional development in England (Leask and Preston, 2011, in press).<\/p>\n<p>In a second opportunity granted by the WLE Centre at the Institute of Education, University of London, John Cuthell, a MirandaNet colleague and I, explored how remotely authored digital concept maps can be analysed to provide a deeper understanding of the dynamics of collaborative knowledge creation that has involved map makers internationally. To date collaborative concept maps have been explored in the context of a MirandaNet activity called a MirandaMod<a href=\"#_ftn12\">[12]<\/a>. This is a virtual form of an ‘unconference’ &#8211; an event where the participants decide the learning agenda themselves. Everyone who wishes to can present on the topic and joins in the sharing of knowledge face to face or online. Digital technologies make MirandaMods possible through the use for example, of instant messaging software, microblogging, streamed video and digital concept maps in remote knowledge creation (Preston, 2011, in press: Cuthell, Preston and Cych, 2011, in press). Learning through social interaction gains an international dimension in this context.<\/p>\n<p>The value of the doctorate<\/p>\n<p>The professional value of this study has been to validate theoretically, the change I have perceived in my professional stance from expert lecturer to facilitator and lead-learner. In this latter role I have supported professional co-researchers in a community of practice where all expertise is equally valued, even the expertise of the pupils. More importantly, the doctorate has given me the sense of belonging to a community of supportive academics who have voluntarily engaged in my apprenticeship with countless gestures of support and encouragement.<\/p>\n<div>\n<hr size=\"1\" \/>\n<div>\n<p><a href=\"#_ftnref1\">[1]<\/a> A type of traditional pedagogy where the teachers is the expert discussed in Chapter two.<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref2\">[2]<\/a> Two more types of pedagogy discussed in Chapter two where the learners, a individuals and as groups have more engagement in the learning process.<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref3\">[3]<\/a> www.mirandanet.ac.uk<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref4\">[4]<\/a> http:\/\/www.bebo.com\/<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref5\">[5]<\/a> http:\/\/www.facebook.com\/<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref6\">[6]<\/a> The Etopia study can be found in www.mirandanet.org.uk\/blog<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref7\">[7]<\/a> &lt;http:\/\/www.itte.org.uk&gt; last accessed 29<sup>th<\/sup> July 2009.<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref8\">[8]<\/a> &lt;http:\/\/www.naace.org\/&gt; last accessed 29<sup>th<\/sup> July 2009.<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref9\">[9]<\/a> &lt;http:\/\/secondlife.com\/&gt; last accessed 29<sup>th<\/sup> July 2009.<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref10\"><strong>[10]<\/strong><\/a> &lt;http:\/\/www.l4l.co.uk\/&gt; last accessed 24<sup>th<\/sup> July 2009.<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref11\">[11]<\/a> &lt;http:\/\/reflectingeducation.net&gt; last accessed 29<sup>th<\/sup> July 2009.<\/p>\n<\/div>\n<div>\n<p><a href=\"#_ftnref12\">[12]<\/a> www.mirandanet.org.uk\/mirandamods<\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Background The orientation of the doctorate in education toward professional practitioners has offered me an ideal opportunity to reflect on the theory and practice of Continuing Professional Development (CPD) in digital technologies, the field I have been engaged in since &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/my-doctoral-journey\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":2,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/370"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=370"}],"version-history":[{"count":7,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/370\/revisions"}],"predecessor-version":[{"id":2914,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/370\/revisions\/2914"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=370"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}