{"id":3903,"date":"2013-02-07T21:12:29","date_gmt":"2013-02-07T20:12:29","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=3903"},"modified":"2014-10-04T18:10:20","modified_gmt":"2014-10-04T17:10:20","slug":"3903-2","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/3903-2\/","title":{"rendered":"ICT or &#8216;Computing&#8217;? a New Zealand perspective"},"content":{"rendered":"<h2>An outside perspective on the British educational current issues landscape<\/h2>\n<p><em>This paper is a thought piece. It derives from thinking about the latest news on the changes to the ICT curriculum in Britain, what arose at the Education Futures conference (Bedford, November 5-7, 2012), what I’ve read on the mirandalink threads,  and from considering some of those in relation to the New Zealand educational ICT landscape. My musings are my own, and are intended to stimulate discussion.<\/em><\/p>\n<p>Education is, internationally, a political football, even though the rules are not international, but adapted according to the vagaries of political interests. Politicians interfere with it for mainly ideological ends; seldom, it seems, is educational policy based on the lessons from educational evidence. The implementation of rhetoric about improving achievement, standards, or addressing gaps is often worse than the problem it seeks to fix. The No Child Left Behind policy for example, is a notable example that exacerbated the educational outcomes for disadvantaged students (Kim &amp; Sunderman, 2005)<\/p>\n<p>Gove&#8217;s documented interference in ICT in the UK is a case in point. Given my reading of the Mirandanet discussion threads, his perspective seems to be predicated on insisting that UK students of the twenty-first century replicate the education of someone who went through school in the twentieth century. This was a time before computers were on our laps and in our pockets, or the means by which trains, planes, traffic lights and police co-ordinate their activities, or how local councils check drains, or how people are paid, banks play with money or politicians keep in touch with constituents, including passing on information to schools. It ignores the powerful acts of people-power that crowd-sourcing or instant update  technologies like Twitter can create. It ignores the reality that satellites take pictures of us and where we live, or that our location can be plotted when our phones are switched on.<\/p>\n<p>Every newspaper and article about Gove, every sound bite, every book, telephone call, television programme and movie is now a product of digital technologies. It is difficult to find texts mediated by something else instead. We wouldn’t have the Hobbit series of movies if it wasn’t for digital technologies. We also wouldn’t have the creativity of people learning to use them to solve problems, analyse data, and create the marvellous things (and not so marvellous) that have never existed before.<\/p>\n<p>Most infrastructure relies on computer technologies. Most contact between people is mediated in some way by those same affordances. To assume that ICT in education is the preserve of specialised computer science knowledge is one way of understanding this deeply embedded fabric. However, it can be akin to suggesting that because we all use transport of some kind, we should all be mechanics and know what&#8217;s under the hood. It implies that individuals are supposed to be wise and knowledgeable about what is often highly specialised learning. Another way is to notice what Pachler et al (2010) identified about young peoples’ use of digital tools: that they appropriate them, use them as cultural and identify tools and think nothing of using them all the time. In fact, I use my devices all the time too. I’m writing this on a computer, using GoogleDocs. Beside me is my iPad, where I’m consulting texts in my iBooks library, such as Burden et al’s (2012) iPad report, and a copy of a book containing a chapter of mine (Wright, 2012). I can stream live my favourite radio programme (Radio NZ) from an app on my iPad &#8211; as long as I have wifi &#8211; anywhere in the world.  In my pocket is my smartphone. It is not uncommon for many of us to have more than one kind of computer in use simultaneously.<\/p>\n<p>When pre-school children get hold of an iPad, it only takes them a few minutes to start manipulating it. They aren’t thinking about what makes it work, other than it does. While knowing something of the building blocks of how computers work is a great idea, has not knowing what’s under the hood (of cars, boats, planes, books, shoes, or how stuff gets into a supermarket) ever stopped people using these things for their own ends?<\/p>\n<p>Perhaps it&#8217;s a mistake to concentrate ICT knowledge and practice in one subject.<br \/>\nLike literacy and numeracy, technological tools are only any good when they are being<br \/>\nused in some context, and for some purpose. Isolation or abstraction from context has never been an entirely successful learning strategy. There is a huge body of knowledge about this. Vygotsky (1978) for example, talked about starting with the known and working outwards from that, not starting and stopping with the abstraction.  Understanding pedagogy helps us know that. People learn by solving problems by using the tools at hand. These might be technological, or they might be mental processes. All are contextual. One doesn&#8217;t learn to use Twitter, for example, by reading a book about it. It is understood by using it. For example, in initial teacher education as a tool for reflecting about practice (2012), or as a personal\/professional learning network. It isn&#8217;t learned by understanding coding. Knowing what it is that will benefit to our students about coding is part of the conversation. Is it to help students create new things with and about computer technologies?  Is it so they can hack successfully, infiltrating things that others would want to keep secret (think Wikileaks) as an act of social justice or mayhem? Is to learn more about safe practices online? Is it to be critical thinkers about what they see, read and experience online?  In the end, it is our pedagogical knowledge and experience that will help transform our students’ learning and achievement with and through digital technologies (Wright, 2010). To underestimate the value of that is to demonstrate ignorance about what pedagogy is.<\/p>\n<p>Perhaps Gove feels he can interfere is because he sees teaching as a technicist job, where someone, who has never taught, can dictate how professionals should do their jobs. Do politicians dare do that to doctors or lawyers? Issues about technology and education are issues about what it means to teach and learn. Take for instance, the evaluation of iPads in various schools in Scotland (Burden et al, 2012). This report outlines the strong links between policy and practice, educational impact and what helps students deeply engage in learning.  The report indicates the complexity of school dynamics, infrastructure, leadership and decision-making, and its effects on what will become the best learning bang for the learning buck. It also clearly outlines the personalisation of learning with these devices. Perhaps it highlights how deeply personal learning has always been, but we’ve forgotten it in the sea of mass education, where more and more students are squashed into ever decreasing resource provisions.<\/p>\n<p>Perhaps it necessary to return to first principles: that both teaching and learning really matter, that neither are linear, unproblematic or clear-cut. That they are heavily context-dependent and this includes the kinds of technologies and affordances available to both learners and teachers, who, in fact, are necessarily part of the learning complex, and who illustrate the intimately connected nature of teaching and learning; that we can be both simultaneously.<\/p>\n<p>I suppose I’m grateful that in New Zealand, whatever the political flavour of the government of the day, there is a consistent development agenda about digital technologies in learning contexts. The government is, on the back on the Ministry of Economic Development, rolling out ultrafast broadband to schools through the Ministry of Education. This Ministry also supports education-oriented sites like TKI (<a href=\"http:\/\/www.tki.org.nz\/\">http:\/\/www.tki.org.nz\/<\/a>), NetSafe (<a href=\"http:\/\/www.netsafe.org.nz\/\">http:\/\/www.netsafe.org.nz\/<\/a>), Education Counts (<a href=\"http:\/\/www.educationcounts.govt.nz\/publications\">http:\/\/www.educationcounts.govt.nz\/publications<\/a>), which is a repository of educational reserach the Ministry has commissioned. It is also making free to schools myportfolio, a school version of the Mahara portfolio site. myportfolio is used by growing numbers of schools for both students and teachers as a means for collating and reflecting on, achievement and learning. Schools are using it as a place for teachers to collect artefacts of their practice as part of their annual attestation for meeting the Registered Teachers Criteria. It is also a site I’m using with my secondary graduate group, as a way to demonstrate their learning and use the site as part of their cv. I created one page to demonstrate Teaching as Inquiry to them, to model one way of structuring a page that also directly linked to their assessment task (<a href=\"http:\/\/myportfolio.school.nz\/user\/noelinewright\/teachingasinquiry\">http:\/\/myportfolio.school.nz\/user\/noelinewright\/teachingasinquiry<\/a>).<\/p>\n<p>Within TKI, there is an area called software for learning, designed to help teachers make decisions about what to use and why. These kinds of mechanisms indicate a structural support of elearning and digital technologies in schools. Something, it seems, is being dismantled in the UK.<\/p>\n<p>Mirandanet-organised conferences bring together people from a wide range of interests to examine the state of play in the UK regarding the ICT curriculum. It is through such meetings and the affordance of the discussion threads that education with and through digital technologies is being practiced in a wide educational community that transcends political and geographic borders. Its advocacy agenda is a wonderful antidote to the onslaught of ignorant political will.<\/p>\n<p>Dr Noeline Wright<br \/>\nThe University of Waikato<br \/>\nHamilton, New Zealand<\/p>\n<h3>References<\/h3>\n<p dir=\"ltr\">Burden. K ., Hopkins, P., Male, T., Martin, S., &amp; Trala, C. (2012). Scottish Mobile Personal Device Evaluation. Hull, UK: The University of Hull. Accessed at:<\/p>\n<p dir=\"ltr\"><a href=\"http:\/\/www2.hull.ac.uk\/ifl\/ipadresearchinschools.aspx\">http:\/\/www2.hull.ac.uk\/ifl\/ipadresearchinschools.aspx<\/a><\/p>\n<p dir=\"ltr\">Kim, J. S. &amp; Sunderman, G. L. (2005). Measuring academic proficiency under the No Child Left Behind Act: Implications for educational equity. Educational Researcher. 34(8) 3-13<\/p>\n<p dir=\"ltr\">Pachler, N., Bachmair, B., &amp; Cook, J. (2010). Mobile Learning: Structures, agency, practices. New York, Dordrecht, Heidelberg, London: Springer Science+Business Media<\/p>\n<p dir=\"ltr\">Wright, N. (2010). e-Learning and implications for schools: A literature review. Hamilton: The University of Waikato, commissioned by the Ministry of Education. Accessed at: <a href=\"http:\/\/www.educationcounts.govt.nz\/publications\/ict\/e-learning-and-implications-for-new-zealand-schools-a-literature-review\/executive-summary\">http:\/\/www.educationcounts.govt.nz\/publications\/ict\/e-learning-and-implications-for-new-zealand-schools-a-literature-review\/executive-summary<\/a><\/p>\n<p dir=\"ltr\">Wright, N. (2012). Microblogging for reflection: Developing teacher knowledge through Twitter. In, Melanie Ciussi and Erik Gerbers Freitas (Eds). Leading Issues in e-Learning Research: For researchers, teachers, and students. (pp. 71-84). Reading, UK: Academic Publishing International Ltd<\/p>\n<p dir=\"ltr\">Vygotsky L.S. (1978). Mind in society: The development of higher psychological processes. Cambridge: MA: Harvard University Press.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An outside perspective on the British educational current issues landscape This paper is a thought piece. It derives from thinking about the latest news on the changes to the ICT curriculum in Britain, what arose at the Education Futures conference &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/3903-2\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":4058,"menu_order":90,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3903"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=3903"}],"version-history":[{"count":23,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3903\/revisions"}],"predecessor-version":[{"id":4294,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3903\/revisions\/4294"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4058"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=3903"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}