{"id":3969,"date":"2013-02-26T00:47:14","date_gmt":"2013-02-25T23:47:14","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=3969"},"modified":"2013-10-13T12:45:28","modified_gmt":"2013-10-13T11:45:28","slug":"ict-curriculum-what-next","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/ict-curriculum-what-next\/","title":{"rendered":"ICT Curriculum &#8211; what next?"},"content":{"rendered":"<p>“The wonder of MirandaNet is that we have a diverse community of experience, opinion, culture and practice that provides more facets to a discussion topic than a well cut diamond,” said Geoff Scott Baker, one of our company associates.<\/p>\n<p>This mirandalink debate that Geoff was commenting on was the second consultation on the new ICT curriculum that the DfE in England have renamed ’Computing’. This is one aspect of concerns in Europe about the lack of STEM students. One international perspective on appropriate ICT curricula in schools was provided by José Ramos, a member from Universidade de Évora, Portugal. Like the rest of Europe, Portuguese universities are concerned that, whereas every year there are more jobs in the IT market needing more qualified people in the STEM areas. However, as in the UK,  the Portuguese universities are seeing fewer STEM students applying from schools. As a result the aim to bring in computational thinking into schools is to be achieved by introducing  Computer Science into the ICT curriculum from about nine years old. Scratch, Kodu, Serious Games or other computational environments specially designed for children are being introduced. “The aim of this strategy was to avoid the traditional teaching of more formal languages (C++ or Java or others) as some sectors of the computer science universe are promoting&#8230; E-safety for children is another matter of concern and has a special place. Spain, Greece and some other European countries are undertaking similar initiatives”.<\/p>\n<p>But whereas, José believes that in Portugal the Computing curriculum includes, in a balanced way, Computer Science, Digital Literacy and Information Technology, many MirandaNetters did not think this was true of the new Computing Curriculum proposed in England.<\/p>\n<p><strong>The English Computing curriculum consultation<\/strong><\/p>\n<p>Much of the discussion on Mirandalink focused on the new content and the removal of old subjects. In terms of coding many colleagues also mentioned the visual programming tool, Scratch, that introduces computational thinking to students. Neil Stanley has his reservations, “As for visual programming tools I have noted some problems where there is a &#8216;try it and see&#8217; developmental model &#8211; this often works in, say, Scratch (though it may be less than efficient) but doesn&#8217;t transfer to a text based code model where the underlying algorithm needs to be resolved before you move into code”.<\/p>\n<p>Concerns were raised on mirandalink about what would be lost with the new emphasis on Computing and which subject teachers would take up the slack: like presentation skills and provenance.<\/p>\n<p>In his masterly analysis of the new curriculum, Miles Bery, Roehampton University, finds most significant losses in the Computing curriculum are in the areas of digital literacy and creativity: The removal of the fifth aim, for example, for all strands that suggested that young people should be able to critically articulate the individual, cultural, and societal impacts of digital technology, and to know how to stay safe, exploit opportunities, and manage risks. Also removed have been<\/p>\n<p>KS1 and 2 statements providing an entitlement to creative work in digital media: and, in KS1, the ability to create, manipulate and evaluate digital content in a range of formats for use by a familiar audience.<\/p>\n<p>Another very telling removal is the aim of working collaboratively to plan, create, test and evaluate a range of digital products for a given audience: critically evaluate digital content, including its context, provenance and trustworthiness; reflect on the personal, social, economic, and ethical impacts of technology and technological change, and the implications for rights, responsibilities, and freedoms.<\/p>\n<p>All these omissions culminate in the removal of the ability to manage their online identity, participate in online communities, develop and critically evaluate digital media, and take account of ethical, legal, social, and environmental consequences of information systems. It would seem that only the mechanistics of Computing are to be taught in school, not the consequences of competence.<\/p>\n<p>David Longman, Swansea University, summarized the dangers of the swing against ICT at present which he saw as ‘risky’. The issues that face people at work and in everyday are less to do with computational thinking than with managing, finding, linking, processing and otherwise funnelling the ocean of information that we live in.<\/p>\n<p>The trouble with computer science is that it churns out technical systems that in turn churn out yet more information! His point is that the analysis of information and knowledge about its provenance is not the concern of Computer Science. A key questions must be to ask will other subject tutors be asked to take these aspects of computing on? And if not who will be teaching young people how to manage their lives that are increasingly affected by the internet”.<\/p>\n<p><strong>Fundamental career changes for ICT teachers.<\/strong><\/p>\n<p>The most urgent questions for most MirandaNetters was framed by Sarah Younie at De Montford University, “How will teachers be trained to deliver the computing aspect of the new curriculum by 2014? Here concern is about those new to teaching who are just going through teacher training as well as those serving teachers already delivering the current ICT curriculum who need upskilling.<\/p>\n<p>Caroline Humphries asks these questions from a practical school perspective pointing out the lack of information available for the launch of the Computing curriculum in 2014, “Staff at our Bedford maintained school are keen to &#8216;up-skill&#8217;, as needed, to implement the proposed new IT curriculum in 2014. However, what we really lack is an incentive scheme, e.g., government funding to support the initial, extensive outlay of funds to upgrade our school server and Internet access, as well as the cost to purchase and install appropriate &#8216;mobile&#8217; computer hardware and software for 300 plus pupils and staff. Additionally, with funding, we could offer loan\/purchase options to parents thereby allowing our pupils&#8217; in-school use of IT equipment via portable devices (whether they be mobiles, video cameras, Netbooks or iPad equivalents) to be extended into the home environment”.<\/p>\n<p>Dai Barnes, who is a teacher, took a similar line to Carol Humpries, suggesting that all retraining professionals should should receive £5k for going through the conversion process. Jocelyn Wishart, Bristol University, pointed out that qualifications are complex and professionals have, more often than not, come via different professional occupations stemming from different undergraduate qualifications. In her old position as a PGCE ICT lead most of her students came from business backgrounds: ICT was the province of the Business Studies in school. But as an A Level Computing teacher most of her colleagues had a Computer Science or Joint Hons with Computer Science qualification.<\/p>\n<p>“There is no way the former group could pick up sufficient programming knowledge to teach it with confidence and in an engaging way, said Jocelyn, without paying attention to the necessary underpinning maths and logic support knowledge, skills and understanding that the latter group came already prepared with (unless they are really keen to work at and develop a deep, conceptual understanding)”. She believes this professional upskilling would take a sabbatical rather than &#8216;learning on the job&#8217;.<\/p>\n<p><strong>Learning on the job<\/strong><\/p>\n<p><strong><\/strong>Other MirandaNetters thought learning on the job was possible. Geoff Scott Baker is of the opinion that ICT teachers will not need to have C# or Java qualifications, “ We just need professional teachers with the imagination to open up students minds to the possibilities that driving ICT can deliver. Creating interesting web pages to publish project work can be undertaken using a word processor or via simple free online services such as Google Sites”.<\/p>\n<p>In the same vein Dominik Lukes believes “so many of today&#8217;s programming stars learned coding by needing to accomplish a specific tasks, not by following a curriculum requirement”. He also wants to ensure that schools promote Open Standards. Theo Kuechel, a MirandaNet consultant, who is particularly knowledgeable about Visual Learning, was skeptical about the impact of another national teacher training programme like NOF that was set up from 1999 to 2003 (Preston 2004). He cited several reasons why teachers as a group would not comply:<\/p>\n<p>“The first issue is cultural: I think there should be a purposeful buy in to &#8211; and a willingness to engage with the concepts of computational thinking and also &#8211; design thinking by schools. This culture needs to be transmitted to the pupils &#8211; encourage fun and exploration &#8211; and their achievements and results are recognised all along their learning paths with badges &#8211; not just at the end with a high stakes exam.<\/p>\n<p>Mentoring is much more likely to be a meaningful process than &#8216;training&#8217;. Teachers will gain more by working together &#8211; in real time, and online. Whilst there may be expert &#8216;graduates or teacher&#8217; in the field &#8211; these are likely to be thinly spread &#8211; perhaps these could be available to all (schools who wish them), on a peripatetic basis, online or face to face.<\/p>\n<p>Schools need to draw on expertise and build partnerships with practitioners from industry. We now have the Internet, and if ever there was a time to draw on its affordances &#8211; this is it. Use the online tools and resources including communities of practice, and perhaps some incorporate some of the lessons we are already beginning to learn from MOOCs. Tools such as Scratch are now becoming available in browsers. Some teachers are already producing, curating and sharing their work. Other teachers are setting up communities of practice with &#8216;making’ very much at the forefront. Wikis will have a role to play as well.<\/p>\n<p>Some MirandaNetters, like Erick Knutsen, are concerned about the impact of the computer industry on the Computing curriculum. “The computer industry is being given undue influence over the rest of British industrial needs for employees able to undertake many of the IT literate tasks that remain. I predict that during the next five years organisations such as the CBI will begin complaining bitterly that schools aren&#8217;t turning out students able to support business functions such as generating spreadsheets for profit\/loss forecasts. This view, I accept, assumes the idea that such skills were being developed in schools already &#8211; I&#8217;m not convinced they were.<\/p>\n<p>Others MirandaNetters are less concerned as the companies may provide for free some of the new training for teachers and children that is required.<\/p>\n<p><strong>We know the answer<\/strong><\/p>\n<p>The answer to managing the complex fall-out from an ill-thought out government policy was presented to me the next week in Croydon. MirandaNetters will have seen my post:<\/p>\n<p>“The main MirandaNet concern in this debate was about retraining teachers, but an answer was announced (on a tablet?) by some young volunteers at a meeting I attended last week of the Code Club who are planning to set up in Croydon schools- the answer is volunteer coders. We can all have some apparently&#8230;<\/p>\n<p>The young woman, in high top trainers with bright pink laces, who introduced the Code Club programme is volunteering with her friends to teach programing in schools saying, “Of course, everyone knows the current ICT curriculum is crap and boring”. Loud applause.<\/p>\n<p>The session started with a video in which Prince Andrew amongst other worthies were promoting this volunteer teaching in schools to a panel of primary children schooled to behave like Alan Sugar. They eventually only hired Prince Andrew because they like his mother.<\/p>\n<p>The worthy mission of <a href=\"http:\/\/www.codeclub.org.uk\/\">Code Club<\/a> is to give every child in the UK the chance to learn to code. They aim to have Code Club in 25% of primary schools in the UK by the end of 2015.<\/p>\n<p>After The Code Club introduction some teenage young men with t-shirts pronouncing their mission &#8216;Lives not Knives&#8217; were explaining how this Code Club initiative is going to help them stop young men from killing each other.<\/p>\n<p>I think I might be losing my sense of humour &#8211; what would you have said had you been there?<\/p>\n<h2>Questions for the Department of Education, England<\/h2>\n<p>Christina Preston has extracted some questions for the DfE from the mirandalink debate that were presented at the <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/02\/Westminster-Forum.pdf\">Westminster Forum<\/a><\/p>\n<p><strong>Continuing the debate<\/strong><\/p>\n<p>Meanwhile thanks to the insights from James Abela, Dai Barnes, Miles Bery, Carol Humphreys, David Fuller, Maria Kingham, Claire Johnson, Eric Knutsen, Marilyn Leask, Dominic Lukes, José Ramos, Geoff Scott Baker, Neil Stanley, Alan Stevens and Sarah Younie.<\/p>\n<p>For more articles and resources on the topic look here:<\/p>\n<ul>\n<li>Miles Bery’s Open Mind <a href=\"http:\/\/milesberry.net\">blogs<\/a> on the topic;<\/li>\n<li>Computing at School (CAS) have a <a href=\"http:\/\/www.computingatschool.org.uk\">resource bank and support network<\/a>;<\/li>\n<li>Theo Kuechel supported his arguments with a series of resources on <a href=\"http:\/\/blogs.kqed.org\/mindshift\/tag\/design-thinking\/\">design thinking<\/a>;<\/li>\n<li>Learn about <a href=\"http:\/\/wiki.mozilla.org\/Badges\/About\">Badges; <\/a><\/li>\n<li>Mentoring on how to use  <a href=\"http:\/\/codingforkids.org\/wiki\/Main_Page\">wikis<\/a>;<\/li>\n<li>DONALD CLARK PLAN B: <a href=\"http:\/\/donaldclarkplanb.blogspot.co.uk\/2012\/12\/wikis-wickedly-clever-underused.html\">Wikis – wickedly clever, underused learning tool<\/a>;<\/li>\n<li><a href=\"http:\/\/www.codecademy.com\/#!\/exercises\/0\">CodeAcademy;<\/a><\/li>\n<li><a href=\"http:\/\/scratched.media.mit.edu\/discussions\/news-and-announcements\/new-resource-teaching-scratch-kids-ages-5-8\">Teachers resources on Scratch<\/a>;<\/li>\n<li><a href=\"http:\/\/plus.google.com\/u\/0\/communities\/104957385931397866529?cfem=1\">Communities of practice about ‘making’<\/a>.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>“The wonder of MirandaNet is that we have a diverse community of experience, opinion, culture and practice that provides more facets to a discussion topic than a well cut diamond,” said Geoff Scott Baker, one of our company associates. This &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/ict-curriculum-what-next\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":4058,"menu_order":60,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3969"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=3969"}],"version-history":[{"count":39,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3969\/revisions"}],"predecessor-version":[{"id":3977,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/3969\/revisions\/3977"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4058"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=3969"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}