{"id":405,"date":"2011-07-24T12:23:58","date_gmt":"2011-07-24T11:23:58","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=405"},"modified":"2014-01-07T15:00:30","modified_gmt":"2014-01-07T14:00:30","slug":"career-milestones","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/career-milestones\/","title":{"rendered":"Career milestones"},"content":{"rendered":"<h2>Career milestones<\/h2>\n<p>I was interested in the use of digital technologies as a catalyst for changes in teaching and learning from my university days when I did a degree in English, Drama and Telecommunication Arts &#8211; a precursor of Media Studies: but always in the semiotics of digital communication rather than the computer science aspects of Information and Communications Technology (ICT).<\/p>\n<p>The early 1980s I was a teacher of English, Drama and Media and a staff trainer in South London schools. After fifteen years in schools I become an adviser in English and Information and Communications Technology with Croydon and the Inner London Education Computing Centre. ILLEC. My approach to ICT in schools changed when I was seconded to Kings College, University of London, to develop an adventure game and a newsroom simulation that turned out to be international best sellers. What was important about this project was the opportunity to involve a cross-curricular group of teachers in an experience that took them to the heart of how computers can change learning. Since 1992 I have been an associate the Institute of Education, University of London where I have worked on a range of research projects into the design, development and implementation of innovative models for work-based Continuing Professional Development programmes. I also run projects with other universities including Bath Spa and the Czech Technical University in Prague.<\/p>\n<p>My work has taken me to many countries like Australia, Bulgaria, China, Chile, Czech Republic, Friesland, Germany, India, Japan, Norway, New Zeaingland, Mexico, Saudi Arabia, South Africa, Syria and the USA. International awards for this innovative CPD research and practice include the Trnkova Medal for support in building democratic strategies for ICT teacher education; the World Academic Council Humanitarian Award for the enrichment of community opportunities for Bulgarian teachers and women returnees by creating Anglo-Bulgarian exchange opportunities face-to-face and online; the European Union of Women of Humanitarian Achievement Award for creating an Anglo-Czech online alliance working on democratic participation.<\/p>\n<p>I founded the <a href=\"http:\/\/www.mirandanet.org.uk\/\">MirandaNet Fellowship<\/a> in 1992 in response to a need expressed by teachers for a supportive community of peer mentors exploring the potential of digital technologies in teaching and learning and being recognised for their efforts. The Fellowship can be defined as a ‘<a title=\"Communities of practice\" href=\"http:\/\/www.mirandanet.org.uk\/blog\/wp-admin\/www.mirandanet.org.uk\/blog\/?page_id=368\">community of practice’, <\/a>a phrase used by Etienne Wenger to explain who professional work together in the style of a medieval trade guild. that was established in response to a need expressed amongst teachers for. There are now about 750 Fellows in more than 80 countries. Scholars become Fellows when they publish a multimodal article about their ICT work. The Fellowship focuses on innovative models Continuing Professional Development (CPD) based on practice-based research (action research) and building international web-based communities of practice. Awards are made at pre- and post- graduate level by the MirandaNet Academy at Bath Spa University. These articles are published in MirandaNet <a href=\"http:\/\/www.mirandanet.org.uk\/ejournal\/\">e-journal<\/a> written by teachers for teachers. This e-journal is provides practising teachers with a professional virtual learning platform where they can publish their evidence and thus create a knowledge base. This e-journal is peer reviewed and has been popular with teachers on practice-based courses. It is therefore, a significant factor in raising the standards of coursework. In this mode we have been observing how digital technologies can underpin new ways of building, sharing and disseminating professional knowledge. We call this emergent theory and practice <a href=\"http:\/\/www.mirandanet.org.uk\/blog\/wp-content\/uploads\/2010\/08\/Braided-Learning-First-Monday-2007-.doc\">Braided Learning.<\/a> The metaphor draws on the strength of a plait braided together from the threads of individual ideas and evidence to create an agreed understanding of the processes involved in building communities of practice.<\/p>\n<p>We have designed a the MirandaNet global portal and <a href=\"http:\/\/www.mirandanet.org.uk\/blog\">the research exchange<\/a> as a resource for professionals who want to know more about the four research methodologies that we have been developing in the MirandaNet Fellowship since 1992. These are:<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/blog\/?page_id=319\"><strong>Action Research<\/strong>: the main principles<\/a> In this space we discuss the how you set about action research and the MirandaNet and World Ecitizens publications by teachers and pupils who are engaged in curriculum exchange across the world. There is also a section on the courses we run for educators where we use action research as the main process for learning<a title=\"World Ectizens\" href=\"http:\/\/www.worldectizens.net\/\">.<\/a><\/p>\n<p><a title=\"communities of practice\" href=\"http:\/\/www.mirandanet.org.uk\/blog\/?page_id=368\"><strong>Building communities of practice<\/strong> <\/a>The methods we have used to develop the MirandaNet Fellowship and sixteen other communities of practice take many ideas from the medieval trade guilds, is to support colleagues who want to make greater use of opportunities that digital technologies offer to make teaching and learning more enriching for students. Becta called the community the ‘Facebook’ of ICT professionals in international education although the aims are more than social- it is about sharing knowledge. UNESCO called MirandaNet the Robin Hood of ICT CPD because teachers teacher each other at no cost. Etienne Wenger (1998) first defined this kind of informal learning group as a ‘community of practice’. He said to MirandaNet members, in an un conference called a <a title=\"MirandaMod\" href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\">MirandaMod , <\/a>that he sees our efforts to apply our knowledge as a means of influencing educational policy at local national and international levels as the next logical stage in his own developing theory.<\/p>\n<p><strong><a title=\"World Ectizens\" href=\"http:\/\/www.worldectizens.net\/\">Concept mapping as a research tool<\/a><\/strong> MirandaNet fellows have been exploring the hypothesis that an analysis of a Multi-dimensional Concept Map (MDCM) provides educators and researchers with different and possibly richer and broader insights into understanding of an issue – in this case that of digital technologies in education &#8211; than written responses alone. ‘Multi-dimensionality’ refers to the characteristics of multimodal hand-drawn or digitally produced concept maps, namely multi-layering and (remote) multi-authoring.<\/p>\n<p><strong><a href=\"http:\/\/www.mirandanet.org.uk\/blog\/?page_id=310\">Critical incidents: experience as research data<\/a><\/strong> This is a space where we would like you to contribute a short anecdote in the comments section about an incident that changed your attitude to computers- for any time from your youth. We have quoted some examples so you know what to do and some information about ethnography which is the overall research strategy where critical incidents can be identified.<\/p>\n<p>Ideas about research and about working with teachers as co-researchers are shared with MirandaNet members through newsletters and a <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/\">blog<\/a>.<\/p>\n<p>Fellows also publish the work pupils involved in MirandaNet exchanges on the <a href=\"https:\/\/wec.mirandanet.org.uk\/\">World ECitizens website.<\/a> This charity, a response by Fellows to global upheavals caused by the events of 9\/11, aims to encourage understanding between different cultures and communities and to share across the world the fascinating diversity within nations.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Career milestones I was interested in the use of digital technologies as a catalyst for changes in teaching and learning from my university days when I did a degree in English, Drama and Telecommunication Arts &#8211; a precursor of Media &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/career-milestones\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":2,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/405"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=405"}],"version-history":[{"count":6,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/405\/revisions"}],"predecessor-version":[{"id":2546,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/405\/revisions\/2546"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=405"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}