{"id":4053,"date":"2013-03-01T20:44:04","date_gmt":"2013-03-01T19:44:04","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=4053"},"modified":"2013-10-13T12:46:11","modified_gmt":"2013-10-13T11:46:11","slug":"industry-perspective-on-the-ict-curriculum","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/industry-perspective-on-the-ict-curriculum\/","title":{"rendered":"ICT curriculum: an industry perspective"},"content":{"rendered":"<p>Steljes is a successful technologies innovation business that brings new products from around the world to the UK, particularly in the education market. The SMART Technologies brand is well known. It was introduced to the UK by Steljes and we continue to work closely with SMART and our other vendors on the development and introduction of new technology products.<\/p>\n<p>John Harris of the Corporate IT Forum described the need for ‘Double Deep’ knowledge in the technologies industries earlier today.  He commented that people who are successful in our industries are not necessarily programmers, but combine an excellent grasp of technologies as well as specific business capabilities.  I fully endorse that view, and interestingly out of its workforce of around 160, Steljes only employs a couple of programmers and of SMART’s staff of around 1600 around a quarter are developers.<\/p>\n<p>So what is the offer to industry? At the BETT show 2012, Michael Gove proposed the development of the ‘wiki curriculum’ to enable the best collective knowledge of industrialists and educators to come together in developing a computer science curriculum. The stated purpose of the proposed curriculum is:<\/p>\n<p><em>‘At the core of computing is the science and engineering discipline of computer science, in which pupils are taught how digital systems work, how they are designed and programmed, and the fundamental principles of information and computation. Building on this core, computing equips pupils to apply information technology to create products and solutions. A computing education also ensures that pupils become digitally literate – able to use, and express themselves through, information and communication technology – at a level suitable for the future workplace and as active participants in a digital world.’<\/em><\/p>\n<p>This is laudable but is not fully and consistently reflected in the subject content.  The primary curriculum is utilitarian and lacks a development of creative application of information technology.  It is focused largely on computational thinking and the development of straightforward computer science skills, both of which are perfectly useful but overall the subject content lacks breadth. I would argue that it is insufficient to develop critical awareness, creativity and higher order thinking skills required in our workplace and indeed by individuals.<\/p>\n<p>Despite the intended aims, leaving these out of KS1 and KS2 is likely to hinder the development of a rich digital literacy, and render pupils less ready to cope with the subject content proposed at KS3 and KS4 where creativity at least gets a mention. The PoS as it stands is likely to develop reasonably competent programmers, but that competence requires a deeper contextualisation to create enticing digital content relevant to the ‘future workplace’ and to participate actively in a digital world.<\/p>\n<p>It is true that many pupils (and staff) found the old ICT dull, largely perhaps though because the National Strategy framework focused rather more on Office applications at the expense of the actual National Curriculum programme of study.  Nonetheless simply introducing ‘computing’ won’t necessarily make any difference, unless we have a serious review of both pedagogy and assessment, both of which will affect pupils’ appetite for and progress in the subject.  A particular gap for me concerns collaboration.<\/p>\n<p>Thinking back to the <em>NextGen<\/em> report and the previous debates we have had about industry needs, particularly in terms of the games industry, developing collaborative problem solving approaches to technical and creative challenges is perhaps regarded as a ‘soft skill’, but it has high value in practice in the workplace.  It is a rare individual that combines outstanding programming, narrative and graphical skills, but a collaborative development team that challenges itself to excel in melding these can achieve a great deal. Starting children off earlier in evaluating what works well across a range of devices, then encouraging them to create, test and redevelop digital products together, and to understand the value of feedback could generate a greater passion for the subject and harness individual creativity to build greater capacity.<\/p>\n<p>Maybe it could be argued that this is the ‘how’, the pedagogical approach to be developed to support the ‘what’ i.e. the subject content, but aggregating the two might add up to a better result both for young people and industry<\/p>\n<p>This lack of attention to pedagogy and limited emphasis on digital literacy (and for that matter on information technology) also relates to assessment. At a time when policy around assessment seems to be moving rapidly in the direction of traditional end of course exams, and with the removal of coursework, a programme of study that is tested through a final assessment will de facto lend itself to acquisition of content rather than some of the creative and process points I have just mentioned. Certainly the proposed KS3 Programme of Study would lend itself to a ‘terminal’ exam, which would be a grave error. Effective assessment of the full range of content, capabilities and competences associated with deep learning of computer science, digital literacy and information technology will need to be rich in its nature, to include commentary on development, a portfolio of multimedia assets and show self and peer review, as well as the demonstration of understanding of Boolean logic.<\/p>\n<p>However, the open nature of the KS4 programme provides a genuine opportunity for innovation and to develop courses, pedagogies and assessment practices more in tune with the requirements for advanced study and \/ or industry apprenticeships.  The challenge is the limited number of schools that will have a genuine opportunity to work with industry partners to achieve something really good, and what happens to pupils in the meantime.<\/p>\n<p>To summarise then, there are many benefits in the introduction of computer science from an early age, but on its own is not enough.  No doubt many young children will be enthralled by discovering what they can ‘make happen’.  However there is much to do, particularly in considering pedagogical approaches, therefore teacher development, to enable the subject to be genuinely developmental and creative.  Greater attention to digital literacy is needed such that ‘computing’ will be intrinsically valuable to the individual as well as fit for industry purposes.  The capacity of both schools and industry to collaborate meaningfully will be limited, therefore serious attention needs to be paid to mechanisms to identify and promulgate successes as they appear.<\/p>\n<p>More points are made in the <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/ict-curriculum-mirandas-views\/industry-perspective-on-the-ict-curriculum\/wedf_computing_280213_v2\/\" rel=\"attachment wp-att-4105\">ICT curriculum<\/a> presentation<\/p>\n<p>Rachel Jones, MirandaNet Ambassador<\/p>\n<p>Transcript of presentation to the Westminster Education Forum 28th February 2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Steljes is a successful technologies innovation business that brings new products from around the world to the UK, particularly in the education market. The SMART Technologies brand is well known. It was introduced to the UK by Steljes and we &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/articles\/ict-curriculum-mirandas-views\/industry-perspective-on-the-ict-curriculum\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":4058,"menu_order":70,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4053"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=4053"}],"version-history":[{"count":8,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4053\/revisions"}],"predecessor-version":[{"id":4082,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4053\/revisions\/4082"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4058"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=4053"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}