{"id":432,"date":"2011-08-24T08:45:36","date_gmt":"2011-08-24T07:45:36","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=432"},"modified":"2012-09-09T21:10:35","modified_gmt":"2012-09-09T20:10:35","slug":"keynotes-and-papers","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/keynotes-and-papers\/keynotes-and-papers\/","title":{"rendered":"Keynote in Argentina: September 2011"},"content":{"rendered":"<p>Your comments are welcome on these presentations given at the <a href=\"http:\/\/www.unju.edu.ar\/\">University of Jujuy<\/a> and International Congress Buenos Aires, Argentina:<\/p>\n<p><a href=\"\/ftp\/ArgentinaBunenoAires010911.ppt\">How do teachers learn best about digital technologies<\/a>?<\/p>\n<p>A presentation about the history of continuing professional development for teachers in the UK since the 1980s&#8230;.<\/p>\n<p style=\"text-align: center;\"><strong>How do teachers learn best?<\/strong><br \/>\nThe development of innovative educational programmes about digital technologies for teachers in England<\/p>\n<p style=\"text-align: left;\">by Dr Christina Preston<\/p>\n<p><em>Outline<\/em><\/p>\n<p>Digital technologies have been used for teaching and learning in England since the 1970s but in the early days training was not always thought to be effective. As a result from 1999-2003  the first national programme was undertaken, designed to give all teachers a grounding in appropriate pedagogies for the use  digital technologies in the classroom.<\/p>\n<p>This keynote will concentrate on the findings from the extensive body of research that has emerged since 1999 on the value and effectiveness of a range of  Continuing Professional Development(CPD) models for teachers.<\/p>\n<p>The questions that will be raised in the keynote are:<\/p>\n<p>Does the effective use of digital technologies in education  depend on a teacher’s computer skills alone, or on those skills developed in context?<\/p>\n<p>Should CPD in digital technologies simply reflect the learning culture of the teacher and the currrent teaching methods or aim to change the learning and teaching culture culture ?<\/p>\n<p>Which CPD model will best suit Argentinian teachers? How can the effectiveness of a CPD model be evaluated against desired learning outcomes?<\/p>\n<p>Is there a place for informal learning about digital technologies for teachers and pupils in communities of practice where their own expertise is valued and knowledge is shared? Can social networking, underpinning the work of communities of practice, support the right to Quality Education for All?” How can the balance between digital literacy and digital safety be maintained when powerful new social media are promoted in schools and in teacher education?<\/p>\n<p>Why are some teachers more reluctant to use digital technologies than others?<\/p>\n<p>What are the digital tools that teachers want in the future?<\/p>\n<p><strong>Key references<\/strong><\/p>\n<p>Daly, C, N. Pachler, C. Pelletier (2009) <em>Continuing Professional Development in ICT for teachers <\/em>And<em> Continuing Professional Development in ICT for teachers: a literature review.<\/em> Becta, coventry <a href=\"http:\/\/www.wlecentre.ac.uk\/cms\/index.php?option=com_content&amp;task=view&amp;id=363&amp;Itemid=87\">www.wlecentre.ac.uk\/cms\/index.php?option=com_content&amp;task=view&amp;id=363&amp;Itemid=87<\/a><\/p>\n<p>Davis, N. E. (2008). How may teacher learning be promoted for educational renewal with IT? International handbook of information technology in primary and secondary education. J. Voogt and G. Knezek. Amsterdam, Kluwer Press: 507-519.<\/p>\n<p>Preston, C. and J. Cuthell (2011in press) <em>MirandaMods: from practice to praxis in informal professional learning contexts. <\/em>Research on e-learning and ICT in Education: Technological, Pedagogical and Instructional Issues&#8221;, published by Springer<\/p>\n<p>Preston, C. (2011) <em>Gaining insight into educators’ understanding of digital technologies: three models for the analysis of multi-dimensional concept maps<\/em>. Doctorate in International Education, Institute of Education, University of London library.<\/p>\n<p>Pachler, N, C. Preston, J. Cuthell, A. Allen and Pinheiro Torres (2011) <em>The ICT CPD Landscape in England<\/em>. Becta, Coventry <a href=\"http:\/\/www.wlecentre.ac.uk\/cms\/index.php?option=com_content&amp;task=view&amp;id=363&amp;Itemid=87\">www.wlecentre.ac.uk\/cms\/index.php?option=com_content&amp;task=view&amp;id=363&amp;Itemid=87<\/a><\/p>\n<p>Allen, A, Preston, C. Payton,and S. Pickering, S. (2009) <em>E-safety guidance for the FE &amp; Skills Sector,<\/em> Becta Coventry.<\/p>\n<p>Leask, M. and C. Preston (2011) <em>ICT Tools for Future Teachers: Becta, <\/em>Coventry. Published http:\/\/www.beds.ac.uk\/howtoapply\/departments\/es\/marilyn-leask\/publications<\/p>\n<p>Davis, N., C. Preston, and I. Sahin (2009a). <em>ICT teacher training: evidence for multilevel evaluation from a national initiative.<\/em> British Journal of Education Technology (BJET). Volume 40. Issue 1 (January 2009 ) (Published Online: Feb 5 2008 12:00AM): 135–148.<\/p>\n<p>Davis, N. E., C. Preston and I. Sahin (2009b). <em>Training teachers to use new technologies impacts multiple ecologies: Evidence from a national initiative’.<\/em> <em>British Educational Research Journal (<\/em>BJET). Volume 40. Issue 5 (September 2009)<\/p>\n<p>Preston, C. and Cuthell, J. (2007) <em>Professional educators&#8217; perspectives on ICT CPD: Past, Present and Future,<\/em> WLE centre. Institute of Education, University of London.<\/p>\n<p>Preston, C. and Cuthell, J (2005) Teaching in ICT rich environments – using e-learning to create a knowledge base for 21<sup>st<\/sup> century teachers. A chapter in Leask, M and Pachler, N (eds) (2nd edn 2005)  Teaching and Learning using ICT in the Secondary School, London, Routledge.<\/p>\n<p>Preston, C (2005) Social Networking between professionals: what is the point? A chapter in Self-regulated Learning in Technology. Edited Stephans, K, R. Carneiro and Underwood, J. Enhanced Learning Environments TACONET Lisbon, Portugal, Shaker Verlag.<\/p>\n<p>Preston, C and Lengel, L (2004) Building communities of practice in “New” Europe a chapter in A Brown, and N Davis (eds): Digital Technology, Communities and Education: World Year Book of Education – 2004 Routledge Falmer<\/p>\n<p>Preston, C. (2004). Learning to use ICT in Classrooms: teachers&#8217; and trainers&#8217; perspectives: an evaluation of the English NOF ICT teacher training programme (1999-2003): summary, full evaluation report and emergent trends for teacher educators and staff-trainers. London, funded by the Teacher Training Agency <a href=\"\/tta\/\">www.mirandanet.org.uk\/tta<\/a>.<\/p>\n<p>Preston, C. and Danby, M. (2004) Building professional capacity in new media skills – An evaluation of the European Computer Driving Licence (ECDL) for Educators <a href=\"http:\/\/www.astonswann.co.uk\/\">www.astonswann.co.uk\/<\/a> <a href=\"http:\/\/www.educatorsecdl.com\/\">www.educatorsecdl.com\/<\/a>, <a href=\"http:\/\/www.mirandanet.org.uk\/associates\/astonswann.htm\">http:\/\/www.mirandanet.org.uk\/associates\/astonswann.htm<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your comments are welcome on these presentations given at the University of Jujuy and International Congress Buenos Aires, Argentina: How do teachers learn best about digital technologies? A presentation about the history of continuing professional development for teachers in the &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/keynotes-and-papers\/keynotes-and-papers\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":474,"menu_order":20,"comment_status":"open","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/432"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=432"}],"version-history":[{"count":30,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/432\/revisions"}],"predecessor-version":[{"id":2557,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/432\/revisions\/2557"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/474"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=432"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}