{"id":4354,"date":"2013-03-21T11:34:17","date_gmt":"2013-03-21T10:34:17","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=4354"},"modified":"2013-03-21T16:04:19","modified_gmt":"2013-03-21T15:04:19","slug":"naace-award","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/naace-award\/","title":{"rendered":"Naace Lifetime Achievement Award"},"content":{"rendered":"<p>I<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/awards\/\"><img loading=\"lazy\" class=\"alignright\" title=\"Naace Lifetime Achievement Award\" src=\"http:\/\/www.mirandanet.org.uk\/images\/Naace_ICT_Impact_awards_2013_logo-winner_small.jpg\" alt=\"Naace Lifetime Achievement Award\" width=\"200\" height=\"154\" \/><\/a>t was almost inevitable that, sooner or later, Christina Preston would receive a <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/awards\/\">lifetime achievement award<\/a> from her home country. She is well-known on the educational ICT scene for her passionate and forthright views about the curriculum and pedagogy. And that applies not only in the UK, but all over the world.<\/p>\n<p>In 1992, Christina founded the <strong>MirandaNet Fellowship,<\/strong> which is a Community of Practice in which teachers, teacher educators, researchers and developers can share practice and exchange views. Many of us enjoy, and benefit enormously, from taking part in the vibrant discussions on MirandaNet’s online mailing list and at events called <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMods<\/a>, a type of seminar in which there is an online audience as well as a physically present one who try to link their ideas together to gain new insights. The event is actually recorded for future reference. More than just a seminar, a MirandaMod is a forum in which people from all different spheres (e.g. teachers and academics) may connect with each other and test out ideas.<\/p>\n<p>In fact, Christina’s mission to foster collaboration goes back even further, as Professor <strong>Margaret Cox<\/strong>, Professor of Information Technology in Education at King&#8217;s College London Dental Institute remembers:<\/p>\n<p>“In the early 1980s, Professor Preston pioneered the development and use of networked educational software in English with the development of <strong>NewsNet<\/strong>, which was the first collaborative software environment engaging students to take on the role of reporters and work as teams to produce articles about specific activities and events in different countries.”<\/p>\n<p>Importantly, Christina designed NewsNet with a group of teachers as a professional development exercise and she has spent the past two decades emphasising the need for teachers to support their practice with research – especially action research which they themselves can carry out in their own classrooms.<\/p>\n<p><strong>Marilyn Leask<\/strong>, Professor of Educational Knowledge Management at the University of Bedfordshire, bears out Christina’s commitment to fostering collaboration:<\/p>\n<p>“There are few people in the education sector who can have given as much personally to support collaboration and sharing knowledge about digital technologies as Professor Preston. Government agencies have come and gone and with them the specialist networks they supported which many educators relied upon. MirandaNet is the only network to continue and is now in its 20th year. This award is well deserved.&#8221;<\/p>\n<p><strong>Telephone Interview<\/strong><br \/>\nI asked Christina Preston 10 questions in a telephone interview. It makes for fascinating reading.<\/p>\n<p><em><strong>TF<\/strong>: What has been your main aim since you started in educational ICT, i.e. the vision which underpins everything you have done?<\/em><\/p>\n<p><strong>CP<\/strong>: In the late 1980s teachers were finding one-day ICT courses inadequate for really understanding what computers could do for teaching and learning. The MirandaNet Fellowship was founded with the aim of supporting teachers better by developing a community of practice where they could teach each other about this complex subject. They had to learn on the job because the large majority had not had access to this subject at university.<\/p>\n<p>A secondary aim, which ties in with this, is to encourage teachers to underpin their practice with action research. We’re carrying on this work with a new Education Futures Collaboration (<a href=\"http:\/\/www.edfuturescollaboration.org\/\">www.edfuturescollaboration.org<\/a>) which aims to join up lots of pockets of innovation, evidence-based practice and excellence in teaching and learning, nationally and internationally.<\/p>\n<p><em><strong>TF<\/strong>: What has been your greatest success or proudest moment (besides the Naace Award!), and why?<\/em><\/p>\n<p><strong>CP<\/strong>: Well, I’m proud of two or three, of course. The Naace Award itself goes without saying, because it’s a great honour to be recognised by one’s own professional association. I was also pleased to receive the Digital Inclusion Associateship, at the University of Jujuy, Argentina in 2011, the Trnkova Medal for support in building democratic strategies for ICT teacher education from the Czech Technical University in 2002, and the World Academic Council Humanitarian Award for the enrichment of community opportunities for Bulgarian teachers and women returnees in 2000.<\/p>\n<p>But I think the one I am most proud of is the European Union of Women &#8211; Humanitarian Achievement Award for creating an Anglo-Czech online alliance working on democratic participation in learning. Dr Bozena Mannová, my partner in this activity, had to come to England specially in order to be interviewed. We’d been working together on that particular community of practice since 1995, but Bozena felt she hadn’t done anything special. She feels that, like other Czechs, she has a very deep-seated sense of failure because the Czechs had “allowed” themselves to be occupied.<\/p>\n<p>We had a very tough interview from the EUW Board and at the end Bozena realised how much she had achieved herself since the wall came down. She said to me: “I have done something, haven’t I?” It was a very touching moment for me, because much of my work is trying to help professionals to believe that they know as much about education as anybody else. My aim is to help them explain what they want to do, work out how to do it, and do it. That’s a vital aspect of living in a democracy: the freedom to realise your own potential.<\/p>\n<p><em><strong>TF<\/strong>: What in the course of your career so far have you been most grateful for?<\/em><\/p>\n<p><strong>CP<\/strong>: Absolutely the support of colleagues, especially Dr Bozena Mannová, Dr John Cuthell, Professor Marilyn Leask and Professor Margaret Cox, but many, many more too – and feedback from all MirandaNet’s 800 members in 80 countries.<\/p>\n<p><em><strong>TF<\/strong>: What in your opinion has been the greatest missed opportunity in educational ICT? And what, if anything, can we do about it?<\/em><strong><\/strong><\/p>\n<p><strong>CP<\/strong>: Well, my background is in teaching English, Drama and Media Studies, and what worries me the most is the reduction in the time we spend helping youngsters and teachers with digital literacy – especially ownership, provenance, and ethics using digital technologies, as well as pedagogy in teaching about them. If we don’t pay attention now to issues like ownership of information and provenance then we’re going to run into massive problems from a citizenship point of view.<\/p>\n<p>We can tackle these issues by facilitating teacher ownership of this whole area. I always suggest that teachers undertake their own action research projects as part of their professional development.<\/p>\n<p><em><strong>TF<\/strong>: What still needs to be done?<\/em><\/p>\n<p><strong>CP<\/strong>: It is a pity that Information and Communications Technology looks as if it is being reduced mainly to ‘Computing’ skills in the new programmes. The shortage of youngsters in England trained to enter the computing industry needs to be tackled quickly &#8211; but it will not only be programmers who are required. An understanding of computational logic is very valuable as well of course but Digital Literacy and Information Technology must be given equal weight with Computing Science<\/p>\n<p><em><strong>TF<\/strong>: What’s something you know you do differently than most people?<\/em><\/p>\n<p><strong>CP<\/strong>: Well it all comes down to my background, in media and so on. I’m generally very focussed on the meaning that is being conveyed, and the performance. Performance in communication is very important to my approach to how we use digital technologies. I’m not very impressed by whizzy pyrotechnics for their own sake.<\/p>\n<p>The MirandaMods are a very good example of trying to use remote technology, with an emphasis on what people are saying, how they are saying it and whether they are collaborating on something innovative. The emphasis is on effective communications rather than on wonderful new technology that doesn’t achieve much.<\/p>\n<p><em><strong>TF<\/strong>: What would you like to say to those who are just entering the field of educational ICT, in whatever capacity?<\/em><\/p>\n<p><strong>CP<\/strong>: Make sure you try to be an ‘all rounder’ in this area. Make sure you give broad and balanced approach i.e. including computer science and digital literacy, whether you are teaching young people or teachers<\/p>\n<p><em><strong>TF<\/strong>: What are your top tips for anyone wishing to make an impact on a local, national or even international level?<\/em><\/p>\n<p><strong>CP<\/strong>: If you are in ICT, make sure you have a genuine vision, not just a desire to use technology: it’s important to avoid being sidetracked by technology. Take MirandaNet. We were the first community of practice for teachers, founded in 1992. We’ve had a website since 1994. That’s very important: your website is your shop window, so make sure you use it.<\/p>\n<p><em><strong>TF<\/strong>: What do you see as the role of Naace? How might the impact of our fellowship continue to develop into the future?<\/em><\/p>\n<p><strong>CP<\/strong>: I think Naace have done a tremendous job of building up an inclusive community of practice with immense knowledge about delivering Information and Communications Technology. They rely on this knowledge to influence politicians and policy makers. I think they should now bring in a stronger focus on Computer Science skills at one extremity and research and pedagogy at the other extremity.<\/p>\n<p>I also think all the professional associations of educators should have ownership of their own practice and theory like medics and lawyers. In this context, as I said earlier, we are partnering with the Education Futures Collaboration &#8211; and we hope Naace will too – in order that the wider education community own our own resources. The current Coalition in England closed Teachers TV and Becta and other government funded websites where our research was held. What now want this kind of evidence to be reconstituted into MESH (Mapping Education Specialist knowHow) pathways (<a href=\"http:\/\/www.MESHguides.org\/\">www.MESHguides.org<\/a>). MESH provides access to subject-specific research-based knowledge about barriers to students’ learning and interventions most likely to dissolve barriers. The MESH approach uses multimedia concept Maps, as a way of presenting complex knowledge, each node providing a link to an annotatable display of more in-depth fully referenced knowledge. These lead to credible findings like the Cochrane Review that stores doctors’ research in the form of systematic reviews (<a href=\"http:\/\/www.cochrane.org\/cochrane-reviews\">www.cochrane.org\/cochrane-reviews<\/a>).<\/p>\n<p><em><strong>TF<\/strong>: Is there anything else you’d like to add to what you’ve said?<\/em><\/p>\n<p><strong>CP<\/strong>: I believe it is very important for educators to continue to build communities of practice, to raise the professional standing of teachers through action research, and to base what we do on sound pedagogical principles. And we need to continue to try to ensure that politicians and government are held to account. We live in a very exciting time as far as technological developments are concerned, but it’s educational ownership and ethical elements that we need to get right.<\/p>\n<p>As we closed the interview, Christina was preparing to go to Australia and New Zealand to further the Education Futures Collaboration aims under the thought-provoking title “Re-engineering: a call for collective action”. The work continues, but let’s leave the last word to Professor Cox:<\/p>\n<p>“I am sure that when most of us are forgotten Professor Preston’s name will live on across the globe in villages, schools, colleges, universities and ministries because she manages to drive forward the use of new technologies in all sectors of education, but achieves the hardest task of all which is to take everyone with her.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It was almost inevitable that, sooner or later, Christina Preston would receive a lifetime achievement award from her home country. She is well-known on the educational ICT scene for her passionate and forthright views about the curriculum and pedagogy. And &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/naace-award\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":2,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4354"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=4354"}],"version-history":[{"count":9,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4354\/revisions"}],"predecessor-version":[{"id":4358,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4354\/revisions\/4358"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/2"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=4354"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}