{"id":4549,"date":"2013-04-15T08:30:48","date_gmt":"2013-04-15T07:30:48","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=4549"},"modified":"2013-04-24T16:48:23","modified_gmt":"2013-04-24T15:48:23","slug":"community-playthings-research","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/community-playthings-research\/","title":{"rendered":"Community Playthings research"},"content":{"rendered":"<h1 align=\"center\"><\/h1>\n<p>&nbsp;<\/p>\n<h1 align=\"center\"><em>The price of beauty <\/em><\/h1>\n<h1 align=\"center\"><em>and usefulness in learning <\/em><\/h1>\n<h4 align=\"center\"><strong>A study of value for money in nursery setting<\/strong><\/h4>\n<p>&nbsp;<\/p>\n<h2><strong><em>Research summary<\/em><\/strong><\/h2>\n<p>Community Playthings is a well-established company that has been making furniture for nurseries in Robertsbridge, East Sussex since the 1970s. They also provide a free design and training service for teachers who can visit the community in Robertsbridge as well as a variety of free design guides and educational resources that cover the philosophical and pedagogical approaches that underpin the furniture design.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide11.jpg\"><img loading=\"lazy\" class=\"aligncenter size-full wp-image-4568\" title=\"Slide 1\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide11.jpg\" alt=\"\" width=\"720\" height=\"540\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide11.jpg 720w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide11-300x225.jpg 300w\" sizes=\"(max-width: 720px) 100vw, 720px\" \/><\/a><\/p>\n<p>The company has a reputation for listening to their customers, and the products and their variations are a direct result of feedback. However, the quality of the wood and the exacting design and production processes makes Community Playthings furniture more expensive than other products in this field. Ever keen to listen to customers the company commissioned research to investigate what customers thought about the value for money issues.<\/p>\n<h2><strong><em>The sample<\/em><\/strong><\/h2>\n<p>In collaboration with the Community Playthings team I designed a research programme that focused on a qualitative interview approach rather than a statistical survey because it was agreed that the results would provide a deeper picture of the value of the furniture in terms of learning. In the first stage I visited five nurseries to learn how the furniture was used. In the second stage sixteen interviews were conducted with a range of educators who have bought Community Playthings furniture and blocks or advised teachers to buy them: heads, teachers and assistants in nurseries; purchasers for nursery chains placed in England and internationally; an adviser in a local authority; a design consultant; as well as an academic who take a theoretical perspective on the value of the furniture settings and blocks in learning. Some had bought suites costing from £10,000, whereas others had only a few pieces and were saving up to buy more. Of the second group most were replacing cheaper equipment when it was no longer useable. I also interviewed four nursery heads who had considered buying this furniture but had decided against it. This represented 20% of the sample and was included to provide a balanced result.<\/p>\n<p>This summary offers some of the key findings from the research. In the third stage I analysed the interview transcripts to extract the themes that emerged. The full report provides more detail about each of the categories summarised here.<\/p>\n<h2><strong><em>The findings<\/em><\/strong><\/h2>\n<h3><strong>Academic validation<\/strong><\/h3>\n<p>Overall it was the ethos of calm and of independent learning behind the Community Playthings design that was admired by the educators who engaged in this study. Several of the purchasers of suites followed established approaches to nursery learning like Montessori, Reggio Emilia and the Forest Schools movement. Helen Tovey<a title=\"\" href=\"#_ftn1\"><sup><sup>[1]<\/sup><\/sup><\/a>, a specialist in nursery education at Roehampton University, explained that Community Playthings also provide an excellent support for the design of a Froebelian environment which is creative, open-ended and includes a balance of bought and found materials, made and natural. The environment is based on respect, trust and warm responsive relationships providing rich first-hand play experience. The environment is seen as flexible, transformable and responsive to children’s changing interests and preoccupations.<\/p>\n<h3><strong>Design factors<\/strong><\/h3>\n<p>Overall respondents agreed that the furniture was visually inviting, restful and durable. The products inspired imaginative play because they were not too prescriptive. A head who had been closely involved in the design process was convinced that there is significant impact on learning based on how a room is designed: ‘children are inspired to big active play or more concentrated activity by the area’s design, but the biggest impact is how the areas are linked together. These links help the children make connections between different kinds of activity’.<\/p>\n<div id=\"attachment_4550\" style=\"width: 391px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide1.jpg\"><img aria-describedby=\"caption-attachment-4550\" loading=\"lazy\" class=\" wp-image-4550\" title=\"Slide1\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide1-300x225.jpg\" alt=\"\" width=\"381\" height=\"285\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide1-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Slide1.jpg 720w\" sizes=\"(max-width: 381px) 100vw, 381px\" \/><\/a><p id=\"caption-attachment-4550\" class=\"wp-caption-text\"><strong>A word-cloud showing how often the interviewees used key words in connection with Community Playthings furniture.<\/strong><\/p><\/div>\n<p><em><\/em>Many of the respondents had praised the Community Playthings team for their consistency of colour and scale, which means that items match and fit together whenever they are added. Purchasers found the unpacking service valuable, whereas others had included their staff team in the planning, and some the children as well.<\/p>\n<p>Designs were well thought out and respondents were able to describe the quality of the design of the furniture in great detail. The word-cloud in the first diagram provides a visual analysis of the sixteen interview scripts.<\/p>\n<p>The sample of teachers identified themselves pedagogically by their lack of attraction to ‘the shiny and brightly coloured newness’ of some other ranges of furniture. One commented that a child does not benefit from being blasted with primary colours. Several were critical of the feel of plastic, the way in which plastic shows wear and the fact that plastic does not age gracefully. Several teachers who are committed to the Community Playthings ethos also complained about the kind of toy labelled ‘educational’ that leaves nothing to the imagination.<\/p>\n<p>In contrast, the educators were enthusiastic about the calmness of the Community Playthings fabric colours and the neutrality of the wood. One nursery also had evidence that the design of the furniture had a calming effect on the children in a deprived catchment area in London with a mixed multicultural population.<\/p>\n<p>The theme of giving deprived children the best environment that could be afforded ran throughout the interview responses. The phrase used by one head to describe the furniture was ‘beautiful and useful’. These words were quoted from William Morris, a 19<sup>th<\/sup> century English textile designer. He was an artist, writer, and libertarian socialist, associated with the Pre-Raphaelite Brotherhood and English Arts and Crafts Movement who declared: ‘Have nothing in your home that is neither beautiful nor useful’.<\/p>\n<p>In this spirit one head observed, <em>‘<\/em>Sometimes we are providing them with an idea of how life could be when they come to us from deprived circumstances.’ Another head observed, ‘We offer them the peace and order they do not enjoy at home’. Probed about the aesthetics of the furniture another teacher said, ‘I do believe the environment makes a difference even for very young children. I’ve seen a troubled boy quietly swaying in a rocking chair stroking the wooden arms gently. He was at peace in those moments’.<\/p>\n<p>Teachers’ favourite items in the range were varied &#8211; not always the most obvious as they seemed to be background items. For example, frequently mentioned was the shelving for equipment that one head had found ‘assists with the organisation of the classroom and contributes to a sense of order which is very important’. <strong> <\/strong>Another head praised the sense that ‘there is a place for everything and everything in its place’. <strong><\/strong><\/p>\n<p>Community Playthings blocks were seen as a unique response to Froebel’s invention in the 1850s and were valued as ‘the start of mathematics, geometry, aspects of science, gradients and architecture bringing in the notion of an integrated curriculum’. The hollow bricks were praised for the way they combine; ‘they are beautiful, weather well, have soft edges and smell of the wood’.<\/p>\n<h3><strong>Professional development<\/strong><\/h3>\n<p>Observation of others’ practice in their own nurseries clearly helped teachers to form their own ideas about learning informally and honestly. ‘It is all too easy to squash children’s ideas’, said one respondent, ‘and also to give them toys and equipment that do not stimulate their imagination’.<\/p>\n<p>Two-thirds of the respondents had been to the workshops in Robertsbridge for professional development programmes linked to the installation of Community Playthings furniture in their nursery. Each said that the experience had been beneficial: an underlying theme in the answers was the growth of a sustained relationship with the Community Playthings advisers. Several remarked on the care and effort that goes into the making of the furniture. A better understanding of the design issues was valued and more specific hints and tips like the fact that the wheels on the mobile storage unit can be fixed for stability or changed to allow mobility. Most importantly visitors to Robertsbridge felt that the staff had listened to their comments and suggestions.<\/p>\n<h3><strong>Value for money<\/strong><\/h3>\n<p>This was the most contentious area of investigation, because Community Playthings is the most expensive furniture range in the nursery field. Although there was no direct evidence of value in obvious measures like occupancy rates and OFSTED results, in this sample many indicated there was a subliminal effect. Several practitioners commented on how appreciative the parents were of quality equipment for their children. ‘There is an unmistakeable ‘wow’ factor when parents walk into the room for the first time’. Another head explained that if a parent or a teacher commented that children preferred bright primary colours she encouraged them to question this assumption: ‘What kind of environment do you chose, if you want to relax? ‘ she asks, ‘Why would children be any different from you?’<\/p>\n<p>One school was thrilled with their ‘outstanding’ OFSTED judgment which is only awarded to 12% of nurseries. The head said she felt that the Community Playthings equipment helped her staff give of their best. Another head of a group of nurseries said, ‘There is no doubt that buying Community Playthings is an investment. After many years of building up our stocks I now enjoy a reduced rate of buying because the furniture wears so well and does not need replacing even with heavy use’.<\/p>\n<p>In another thoughtful contribution to the discussion about value, one experienced head tried to present a balanced argument:<\/p>\n<p>‘The price is a big stumbling block. Have we been lulled into a false sense of security about filling our nurseries? Fifteen years ago we were all saving up for Community Playthings, and luxuriating in one piece. Then we could afford complete suites, which I do not think we will see again. Many managers will be going back to purchasing one piece at a time. So, as I said, it is expensive and there is some danger of conformity in design, but Community Playthings are still our preferred supplier in these straitened times: we have just bought 27 settings. We could get more for our money elsewhere but our parents and teachers like the Community Playthings ethos.’<\/p>\n<p>The most important advice came from Helen Tovey who pointed out that:<\/p>\n<p>‘The furniture should be bought to underpin the learning theory promoted because this is where the real value is. I have seen a room that was never changed which goes against the underlying principles. Some people ‘get it’ and some do not. It is a pity if people buy without understanding about the learning that can be engendered. The settings should be capable of combining opposites. Equipment should be used flexibly but should provide also predictability. Children learn best when they are challenged and surprised but also when the routine is known. The Community Playthings furniture offers all these contrasts because children’s play is not predictable. The settings must be transformable. A static environment or one that children cannot change themselves does not promote the best learning. Children are best supported in their learning by a framework uniting order and disorder. If the furniture is never moved then the main value of flexibility has not been exploited.’<\/p>\n<h2><strong><em>The limitations to this research<\/em><\/strong><\/h2>\n<p>The limitations to this research must be acknowledged. The sample is small and drawn from a Community Playthings list of clients and academics who have a close knowledge of the ethos and the products because they have purchased them. Normally a researcher aims to find a balance between what is good and what needs improving especially when the funder is keen to learn and improve. For this reason 20% of the sample had decided not to buy after some investigation this time round. Their reason, when I asked, was exclusively the high cost of the furniture, but they were all saving to buy one or two pieces when they could. In this context I found that my objectivity was often compromised because the interview experience was akin to interviewing the owner of a much-loved vintage car, or an Apple computer, or even a parent talking about their children. I pressed respondents hard to offer suggestions they would make for improvements in the products and about whether the quality of the furniture justified the cost. The main report covers some important points, but in each case critical answers were couched in a tone of affection that only an exceptional product could engender.<\/p>\n<h2><strong><em>Conclusion<\/em><\/strong><\/h2>\n<p>All the respondents were asked to give advice to other teachers who might be thinking about buying Community Playthings. One manager of a nursery chain looked back to his childhood, ‘When I was at pre-school over 35 years ago, we had the Community Playthings lofts and indoor climbing frame. Although they have moved on, at some level I am influenced by my early love of those products when I buy’.<\/p>\n<p>Another customer was more forthright, ‘Go for it’, she said, ‘you will never regret it. Integrity is rare in retail&#8217;.<\/p>\n<p><strong>The full report can be downloaded<\/strong>:<\/p>\n<div>\n<ul>\n<li><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/04\/Master-full-report-150413.pdf\">Research report into Community Playthings nursery furniture<\/a><\/li>\n<\/ul>\n<p><strong>Good Teaching Room Design: <\/strong><\/p>\n<ul>\n<li><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/4572-2\/\">A more general article collating MirandaNet members&#8217; views<\/a><\/li>\n<\/ul>\n<p><strong>Dr Christina Preston,<\/strong><\/p>\n<p>Professor of Educational Innovation,<br \/>\nMirandaNet Fellowship (www.mirandanet.ac.uk)<\/p>\n<hr align=\"left\" size=\"1\" width=\"33%\" \/>\n<div>\n<address><a title=\"\" href=\"#_ftnref1\"><sup><sup>[1]<\/sup><\/sup><\/a>Tovey, H (2012) Bringing the Froebel Approach to your Early Years Practice, London: Routledge.<\/address>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; The price of beauty and usefulness in learning A study of value for money in nursery setting &nbsp; Research summary Community Playthings is a well-established company that has been making furniture for nurseries in Robertsbridge, East Sussex since the &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/publications\/community-playthings-research\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":5,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4549"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=4549"}],"version-history":[{"count":23,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4549\/revisions"}],"predecessor-version":[{"id":4555,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4549\/revisions\/4555"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=4549"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}