{"id":4681,"date":"2013-05-07T10:01:57","date_gmt":"2013-05-07T09:01:57","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=4681"},"modified":"2013-08-29T20:51:51","modified_gmt":"2013-08-29T19:51:51","slug":"mirandanet-working-lunch-28th-may","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/mirandanet-working-lunch-28th-may\/","title":{"rendered":"MirandaNet workshop- what is a good computing education?"},"content":{"rendered":"<p>&nbsp;<\/p>\n<h2>What constitutes a good computing education that produces an effective workforce and well rounded citizens?<\/h2>\n<p>A debate about theoretical underpinnings for new Computing agenda in education.<\/p>\n<h2>The context<\/h2>\n<p>This workshop has been designed by Dr Chris Yapp, MirandaNet Fellow,  based on the issues that have arisen relating to the Information and Communications Technology\/Computing agenda in writing in his forthcoming book. Key stakeholders have been invited to this working lunch to share their thinking and to consider what kind of guidance might be helpful to teachers in this new situation for which many have not been trained. We hope that the invitees will bring many different perspectives to this debate.<\/p>\n<h2>The proposition<\/h2>\n<p>Throughout Europe the need for computer literate workers is growing and education is being asked to adjust their agenda to new circumstances in the use of technologies. In addition, as the use of computers becomes more pervasive, citizens need to be more sophisticated in their knowledge and practice both in work and at leisure.<\/p>\n<p>Now that strong opinions are emerging about the content of the Computing curriculum in schools will all the professionals involved in education reach a consensus about the subject? Over the next two years MirandaNet aims to nurture this possibility.<\/p>\n<h2>The aim<\/h2>\n<p>Over the next two years MirandaNet aims to support a Thinking Tank of key stakeholders who will develop a MESH pathway (1) in the form of a digital concept map resource authored with and for teachers. This MESH Pathway will record existing knowledge and new knowledge about creative theory and practice in the use of digital technologies. The construction of the map will begin with  three branches representing the three UK strands of the draft Computing curriculum: Digital Literacy, Information Technology and Computer Science. A fourth branch will be Assessment to include methods of measuring knowledge and skill as well as the means of assessing  leadership in this area.<\/p>\n<h2> The opportunity<\/h2>\n<p>This opportunity has arisen because MirandaNet has a won a small resource, through a European grant, to look at Creativity in Computing. We plan to develop a MirandaNet community for professionals that will record their thinking on these issues as well as any resources in the public domain. In this way we plan to create a valuable record of what is known and what is contested.<\/p>\n<p>During the two years of the grant we also plan to support interactive debate face to face and online about what we do not yet know. In the long run, we would like to drill down in particular to recording actual teaching practices that appear to be effective.<\/p>\n<h2>The issues<\/h2>\n<p>In the draft of his new book,Exploring Education Futures: rethinking the role of the educator, Chris Yapp has found the response to the issues challenging. He suggests that the qualities needed to be able to use Word, Excel or PowerPoint are not the same as those required by an educational leader who need to understand how to use Information and Communications as part of the mix of resources along with people and facilities. This was an area that SLICT started to address, but has languished since.<\/p>\n<p>In essence there is a difference between automation (substituting technology for people) and Transformation (using technology to enhance performance of people). The difference between education and learning is that education is the organisation of learning. Educational practise is weakly served by research.<\/p>\n<p>To tackle these issues in an increasingly pervasive technology environment, his argument is that over and above fresh thinking on pedagogy we need fresh thinking about the organisational design and ethos of learning institutions.<\/p>\n<p>So, the agenda is not around Computing and pedagogy but around leadership of transformation in learning. The questions we will tackle in this workshop are:<\/p>\n<ul>\n<li>What are the outcomes we seek for learners in a 21st Century social, economicand technological context? Skills, competences and attitudes (personal, creativity, knowledge&#8230;)?<\/li>\n<li>What are the value systems for learning institutions?<\/li>\n<li>How can we create a framework for education to become evidence based?<\/li>\n<li>How do we balance the evaluation of educational technology contexts in pedagogical, social and economic aspects of learning?<\/li>\n<li>How do we build the system wide knowledge base for transformation?<\/li>\n<li>How do we build the learning competences of professionals to design, deliver and enhance the systems of learning, based on evidence?<\/li>\n<li>What is a 21st Century Learning Platform?<\/li>\n<\/ul>\n<p>We are keen to hear your views&#8230;.<\/p>\n<h2>Time<\/h2>\n<p>27th May 1100 &#8211; 1600 with lunch<\/p>\n<h2>Place<strong> <\/strong><\/h2>\n<p><strong>Royal Over-Seas League<br \/>\n<\/strong>Over-Seas House<br \/>\nPark Place, St James’s Street<br \/>\nLondon<br \/>\nSW1A 1LR<br \/>\nTel: +44 (0)20 7408 0214<br \/>\nFax: +44 (0)20 7499 6738<br \/>\n<a href=\"http:\/\/www.rosl.org.uk\/\">http:\/\/www.rosl.org.uk\/<\/a><br \/>\nNearest tube Green Park<\/p>\n<h2>Next event<\/h2>\n<p>This meeting is a forerunner to the MirandaNet symposium and MirandaMod at the ITTE 2013 conference at Bedfordshire University on July 9th where we hope the debate can be continued. More details <a href=\"http:\/\/www.itte.org.uk\/\">here.<\/a><\/p>\n<h2>Note about MESH<\/h2>\n<p>[1] <a href=\"http:\/\/www.meshguides.org\/\"><strong>MESH<\/strong><\/a><strong> <\/strong>(<a href=\"http:\/\/www.meshguides.org\/\">www.meshguides.org<\/a>)<br \/>\n<strong><span style=\"text-decoration: underline;\">M<\/span><\/strong><strong>apping <span style=\"text-decoration: underline;\">E<\/span>ducation <span style=\"text-decoration: underline;\">S<\/span>pecialist know<span style=\"text-decoration: underline;\">H<\/span>ow<\/strong> (MESH) provides access to subject specific research-based knowledge about barriers to students’ learning and interventions most likely to dissolve barriers. The MESH approach uses multimedia mindmaps, as a way of presenting complex knowledge, each node providing a link to an annotatable display of more in-depth fully referenced knowledge. Read more<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/government-briefing\/\"> here.<\/a><\/p>\n<h2>For all enquiries<\/h2>\n<p><span style=\"font-size: small;\"><span style=\"font-family: Gill Sans;\"><span>Dr Christina Preston<br \/>\nProfessor of Educational Innovation<br \/>\nLearning Futures Research Centre<br \/>\nUniversity of Bedfordshire<br \/>\nwww.beds.ac.uk\/<\/span><\/span><\/span><\/p>\n<p>Founder of the MirandaNet Fellowship<br \/>\nwww.mirandanet.ac.uk<\/p>\n<p>World Ecitizens<br \/>\nwec.mirandanet.org.uk<\/p>\n<p><span style=\"color: #0000ff;\"><span style=\"text-decoration: underline;\"><a href=\"c&#104;&#114;&#105;&#x73;&#x74;&#x69;na&#64;&#109;&#x69;&#x72;&#x61;&#x6e;da&#110;&#101;&#x74;&#x2e;&#x61;&#x63;&#46;&#117;&#107;\">&#99;&#x68;r&#x69;s&#116;&#x69;&#110;&#x61;&#64;&#109;&#x69;&#114;&#x61;n&#x64;&#x61;&#110;&#x65;t&#x2e;a&#99;&#x2e;&#117;&#x6b;<\/a><br \/>\n<\/span><\/span>Mobile    07 801 336 048   Skype christinapreston Phone  020 8686 8768<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; What constitutes a good computing education that produces an effective workforce and well rounded citizens? A debate about theoretical underpinnings for new Computing agenda in education. The context This workshop has been designed by Dr Chris Yapp, MirandaNet Fellow,  &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/mirandanet-working-lunch-28th-may\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1222,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4681"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=4681"}],"version-history":[{"count":15,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4681\/revisions"}],"predecessor-version":[{"id":4683,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4681\/revisions\/4683"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1222"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=4681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}