{"id":4967,"date":"2013-06-08T23:04:15","date_gmt":"2013-06-08T22:04:15","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=4967"},"modified":"2014-02-23T14:05:01","modified_gmt":"2014-02-23T13:05:01","slug":"mirandanet-symposia-at-itte","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/bedford-itte-conference-8th-10th-july-2013\/mirandanet-symposia-at-itte\/","title":{"rendered":"MirandaNet symposia and Mirandamod &#8211; 9th July 2013"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p style=\"text-align: center;\"><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo-.jpg\"><img loading=\"lazy\" class=\"wp-image-5041 aligncenter\" title=\"LLL and Hands on logo\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo-.jpg\" width=\"259\" height=\"194\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo-.jpg 720w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo--300x225.jpg 300w\" sizes=\"(max-width: 259px) 100vw, 259px\" \/><\/a><\/p>\n<p style=\"text-align: center;\"> <strong>Collaborative professional knowledge building activities for teacher educators, vocational trainers and primary and secondary school teachers<\/strong><\/p>\n<p style=\"text-align: center;\"><strong>July 9th Handson workshop at the <a href=\"www.parkinn.co.uk\/hotel-bedford\">Park Inn<\/a>, Bedford, Bedfordshire<\/strong><\/p>\n<p style=\"text-align: center;\"><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Kaynotes1.jpg\"><img loading=\"lazy\" class=\"aligncenter  wp-image-5198\" title=\"Kaynotes\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Kaynotes1.jpg\" width=\"211\" height=\"115\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Kaynotes1.jpg 2968w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Kaynotes1-300x163.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Kaynotes1-1024x558.jpg 1024w\" sizes=\"(max-width: 211px) 100vw, 211px\" \/><\/a><\/p>\n<p><strong>Aims: to understand more about how the principles of teaching and learning creatively can be applied to mastering the effective use of digital technologies across the curriculum at these levels:<\/strong><\/p>\n<ul>\n<li><strong>higher education with a particular emphasis on teacher education <\/strong><\/li>\n<li><strong>vocational education <\/strong><\/li>\n<li><strong>primary and secondary education<\/strong><\/li>\n<\/ul>\n<p><strong>Summary<\/strong><\/p>\n<p>This workshop follows on from a workshop in London on May 28th that explored a key element in the HandsOn project: the value of MOOCs in education. The day was held as an element of the ITTE conference in order to keep the meeting costs as low as possible.<\/p>\n<p>In this all day workshop the expert participants who all use digital technologies in teaching and learning  looked at the connection between creativity and ICT in general concluding with investigating closely how learning about digital technologies in teaching and learning can be enhanced by creative thinking techniques.<\/p>\n<p>The programme began with two keynotes: the first was a general address about the need to reconceptualise technology in order to enhance teaching and learning. The second keynote was an introduction to the main principle of the EU funded HandsOn project. These keynotes were followed by three symposia on topics related to creativity in teaching and learning, creative practice in ICT and the need for creativity in teaching ICT. Finally  a MirandaMod was staged that aimed to draw together on a digital map some key ideas about the different ways in which  creativity can be used on the teaching of ICT. The MirandaMod at the end of the day provided the participants with an opportunity to understand other points of view and build new knowledge.<\/p>\n<p><strong>09:00 &#8211; 09:30<\/strong><\/p>\n<h2>Keynote: Reconceptualising technology- enhanced teaching and learning.<\/h2>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Michelle.jpg\"><img loading=\"lazy\" class=\"aligncenter size-medium wp-image-5200\" title=\"Michelle\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Michelle-300x206.jpg\" width=\"300\" height=\"206\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Michelle-300x206.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Michelle-1024x705.jpg 1024w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Michelle.jpg 1748w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/p>\n<h4>Dr Michelle Selinger, Cisco and MirandaNet member<\/h4>\n<p>Distance, virtual and blended learning are used interchangeably, yet in the last 20 years the opportunity and tools have developed so rapidly we have had little time to fully digest and reconsider teaching in the light of these changes. What is the role of the teacher in today&#8217;s technology-rich, socially networked and globalised society? Do we need new terminology to help us reconceptualise teaching and learning, and if so, how do we ensure that it really is acted on and we implement all the changes we have all been trying so hard to develop in this time frame?<\/p>\n<p><strong>09:30-10:00<\/strong><\/p>\n<h2>Keynote: Innovation in teaching and learning<\/h2>\n<h4>Professor Christina Preston: MirandaNet partner in the EU Handson Project<\/h4>\n<p>The EU HandsOn partners from Catalonia, England, Greece, Slovenia and The Netherlands. are engaged in developing an innovative design for a MOOC that will engage teachers in schools, vocational training and higher education in learning about ICT through using digital technologies. The pilot topic will be using creative thinking techniques to help teachers to master the value of ICT in cross curricula practice.<\/p>\n<div id=\"attachment_5189\" style=\"width: 148px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IMG_2363.jpg\"><img aria-describedby=\"caption-attachment-5189\" loading=\"lazy\" class=\"wp-image-5189 \" title=\"IMG_2363\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IMG_2363-812x1024.jpg\" width=\"138\" height=\"174\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IMG_2363-812x1024.jpg 812w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IMG_2363-238x300.jpg 238w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IMG_2363.jpg 2036w\" sizes=\"(max-width: 138px) 100vw, 138px\" \/><\/a><p id=\"caption-attachment-5189\" class=\"wp-caption-text\">Explaining the EU HandsOn project<\/p><\/div>\n<p>In this presentation the five key aims of the project are related to potential activities that HandsOn will be developing:<\/p>\n<ul>\n<li>Provision of a holistic environment for teachers skills development in ICT;<\/li>\n<li>The integration of ICT tools into teacher and learning;<\/li>\n<li>Matching tools to pedagogical practice;<\/li>\n<li>Enabling collaborative strategies;<\/li>\n<li>Promoting learning by doing.<\/li>\n<\/ul>\n<div><span style=\"font-size: medium; line-height: 24px;\">Explanations of the MirandaMod collaborative activities that follow at the end of the workshop as well as a description of the use of collaborative digital maps for storing professional knowledge lead into the workshop activities for the day: the symposia and the MirandaMod.<\/span><\/div>\n<p>The presentation can be found <a href=\"http:\/\/wcce2013.umk.pl\/?q=node\/1\">here<\/a>.<\/p>\n<p>(A similar presentation was also given in Torun in Poland at the WCCE 2013 conference on June 2nd to fifty educators from around the world who are interested in teaching ICT issues)<\/p>\n<h2>The Symposia: creative practice and creativity in the ICT curriculum<\/h2>\n<p>In the three symposia that follow the invited presenters offer different points of view on the theme aimed at stimulating discussion. At the end of the session, the chair draws out some key points for consideration and web publication.<\/p>\n<h2><strong>Primary and secondary practice in creativity in &#8216;Computing&#8217;.<\/strong><\/h2>\n<h3><em>10:45 &#8211; 11:45 Symposium topic one :creative practice in classrooms.<\/em><\/h3>\n<p>Chaired by Christina Preston<\/p>\n<p><strong>Visual Learning or Visual Culture?<\/strong><br \/>\nTheo Kuechel, Senior MirandaNet Fellow<\/p>\n<p>Many teachers are becoming more adventurous in their use of visual materials. Digital technologies are having a profound impact on our culture and one of the most significant is a clearly perceptible shift from a text based to a visually enabled culture.<\/p>\n<p>Through visual metaphors we engage with on our everyday technologies, mobile devices and computer interfaces, we are moving (back) to more visually oriented ways of working. Infographics and video narratives are regularly included in learning activities. Mind-maps enable us to share our ideas collaboratively (Cuthell 2010), and visual curation tools help us build and share knowledge. Whilst it is easy to capture, create, edit and share visual data its potential for learning is not yet fully recognised or exploited.<\/p>\n<p>This has nothing to do with the “(myth of) learning styles”, (Wheeler, 2011), but is about digital and visual literacy and their importance for learning. Our challenge in education is to recognise the impact of visual culture on cognition and beyond, and to harness its potential for learning and our practice as educators. As Papert (1975) prophesised, the use of computer metaphors by children will have effects beyond what is normally classed as “cognitive skill”. We expect it will influence their language, imagery, games, social interactions (Papert 1975).<\/p>\n<p><strong>References<\/strong><br \/>\nCuthell, J., <em>Towards a Theory of Visual Learning<\/em>, <a href=\"http:\/\/www.virtuallearning.org.uk\/?page_id=148\">http:\/\/www.virtuallearning.org.uk\/?page_id=148<\/a>   accessed 31 May 3 2013<br \/>\nPapert, S,.(1975) <em>An Evaluative Study of Modern Technology in Education,  <\/em><a href=\"http:\/\/www.papert.org\/articles\/AnEvaluativeStudyofModernTechnology.html\">http:\/\/www.papert.org\/articles\/AnEvaluativeStudyofModernTechnology.html<\/a> <em>accessed<\/em> 31 May 2013<br \/>\nWheeler, S., (2011) <em>A convenient Untruth, <\/em><a href=\"http:\/\/steve-wheeler.blogspot.co.uk\/2011\/11\/convenient-untruth.html\">http:\/\/steve-wheeler.blogspot.co.uk\/2011\/11\/convenient-untruth.htm<\/a><a href=\"http:\/\/steve-wheeler.blogspot.co.uk\/2011\/11\/convenient-untruth.html\"><em>l<\/em><\/a><em> accessed 2 June 2013 <\/em><\/p>\n<p><strong>Flat Classroom Project: From Consumption to Creation<\/strong><\/p>\n<p>Dr Katya Toneva: St Mary&#8217;s University College,<\/p>\n<p>In the Autumn term 2011, the International Community School (ICS), London, took part in the global collaborative Flat Classroom Project [2]. The Flat Classroom Project (FCP) is featured in Thomas Friedman&#8217;s book “The World is Flat” [3].<\/p>\n<p>The general goal of the project outlined in [1] is: “to &#8216;flatten&#8217; or lower the classroom walls so that instead of each class working isolated and alone, two or more classes are joined virtually to become one large classroom.<\/p>\n<p>Web 2.0 applications and social software used within the Flat Classroom Project have significantly changed the way of using computers from consumption to creation:<\/p>\n<ul>\n<li>Stimulate the learner’s creativity by enhancing the spontaneous and playful dimension of learning  (via wikis, blogs and online forums).<\/li>\n<li>Encourage creativity via edutainment (video storyboards, online presentations via Elluminate web-conferencing software, etc.).<\/li>\n<\/ul>\n<p><strong>References:<\/strong><br \/>\n[1] K. Toneva and J. Cuthell &#8211; Using “Liminal Spaces” for Web-Based Collaboration and Enhancing Learning: http:\/\/www.thinkmind.org\/index.php?view=article&amp;articleid=colla_2012_4_10_50051<\/p>\n<p>[2] Flat Classroom Project web-site: http:\/\/www.flatclassroomproject.net\/about.html<\/p>\n<p>[3] T. Friedman – The World is Flat book, 3rd edition, Chapter 13, “If it&#8217;s not happening it&#8217;s because you&#8217;re not doing it”, pp. 501-503, 2011<\/p>\n<p><strong>Does the introduction of personal mobile technologies ensure that the students become independent and creative learners?<\/strong><br \/>\nJim Fanning: MirandaNet Fellow and Assistant Headteacher, responsible for the development of technology across the curriculum, Tideway School.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Tideway.pdf\">Tideway<\/a> presentation<\/p>\n<p>Early in 2012 a development programme was established at Tideway School to investigate the implementation and use of personal mobile technologies in the classroom. The process involved: members of the technology team visiting schools that had already integrated a range of mobile technologies into daily use; the identification of relevant research and its circulation to staff; feedback from those early adopters in school who were already using mobile devices; school involvement in a DoE funded research project; and a survey of parent, student, governor and staff views on the use of personal devices. Once this data had been collected and evaluated, a development plan was implemented. By January of 2013 wi-fi had been set up across the school and all staff devices enabled for use on the system. In this presentation I will be explaining the outcomes from the next step, the introduction of the scheme to students and the observation of their practices.<\/p>\n<p><strong>Putting the whizz into Computer Science lessons at KS1 <\/strong><\/p>\n<p>Mark Dorling: Digital Schoolhouse Coordinator and Teacher of Computing at Langley Grammar School, Board of Management for Computing At School, and National CPD Coordinator for Computing At School.<\/p>\n<p>This presentation will explore how Mark puts the whizz into Computer Science learning and finds hooks to engage and excite pupils (particularly girls) of all ages! He will highlight how classroom practitioners can combine Digital Literacy, Information technology and Computer Science into a single Computing curriculum. Mark argues that there is an event more silent &#8216;C&#8217; in STEM than &#8216;Computing&#8217; and that is &#8216;Creativity&#8217;; with this in mind, he will show case example cross curricular and creative curriculum computing lessons from Key Stage one &#8211; three. Mark will briefly examine how programming doesn&#8217;t have to be hard if you teach children to solve problems by utilising Computational Thinking.<\/p>\n<p><strong>11:45 &#8211; 12:45 &#8211; Symposium topic two: using digital technologies creatively in the fields of inclusivity and SEN<\/strong><\/p>\n<p>Chaired by Christina Preston<\/p>\n<p><strong>ICT as a tool for Inclusion: policy issues for teacher educators, advisers and staff trainers<\/strong><br \/>\nJohn Galloway:  Tower Hamlets LEA and MirandaNet Member<\/p>\n<p>This presentation discusses the role of ICT (or Computing) in inclusion, now that awareness of the range of special educational needs and disabilities (SEND) in our schools is  an established part of initial teacher training.  There are many ways in which ICT can support learning, both in the accessibility of materials and resources provided, and in the creative possibilities for pupil responses.   I offer suggestions of ways teachers can connect children’s individual learning needs with effective teaching strategies, and consider how the various technologies available can support this.<\/p>\n<p>I argue that teachers need not necessarily know what every assistive technology option is, but they do need to be aware that they exist, a task that is becoming easier.  What was once specialist is now ubiquitous: touch screens,  text to speech, dictation, personalisation of the user interface, are commonplace on the devices in our pockets.  The possibilities for using ICT to support inclusion in the classroom are increasing, and teachers need to be aware of what they are.<\/p>\n<p><strong>Creativity in the Field of Inclusivity and SEN<\/strong><br \/>\nCharlotte Davies and John Clingan, Directors, Fit 2 Learn CIC and MirandaNet member<\/p>\n<p>This presentation will explain current advances in neurology and non-invasive therapies that have identified the importance of the arts and sports in human development and their key role in creating people that are fit to learn in all areas.<br \/>\nThe arts and sports curricula provide the opportunity to:<\/p>\n<ul>\n<li>check that children are developing their full range of cognitive skills;<\/li>\n<li>open cognitive sensory and muscle pathways;<\/li>\n<li>develop cognitive skills and integrate them with the full range of sensory and muscle development.<\/li>\n<\/ul>\n<p>The Fit2Learn project has identified how failure to develop these skill areas in the classroom can be corrected through non-invasive therapies. These therapies will be explained as they have been used in schools particularly in South London. In particular the plans for teachers to input data and use this to improve their practice will be explained and suggestions requested for improvements.<strong><\/strong><\/p>\n<p><strong>Improving collaborative learning in the classroom: evaluating the impact on group learning of an innovative, unobtrusive sound system, a Flexcat.<\/strong><br \/>\nRoger Turner, LightSpeed,MirandaMet associate working with Professors Christina Preston and Marilyn Leask, University of Bedfordshire and MirandaNet Fellows<\/p>\n<p>A prototype sound system is being trialled in a primary school and secondary academy in the London Boroughs of Hillingdon and Camden respectively. This pilot builds on existing research into the impact on learning when hearing is boosted by Lightspeed audio distribution technology. The presentation introduces the innovative technology, Flexcat, which has been specifically designed to support the delivery of a differentiated curriculum where small group collaborative learning predominates.  The teacher is able to address the whole class or just one group and is able to unobtrusively listen in to group work activity.  The system is designed to improve teacher direction and re-direction of individual groups whether inside or outside the classroom. The research measures whether this intervention significantly improves the quality of informal formative assessments, feedback to students and lesson planning. The results of the evaluation will be discussed in terms of the primary benefits of using the system for teachers and students.<\/p>\n<p><strong>Big Brother or supportive sister?<\/strong><br \/>\n<strong> The Role of Video Technology in the Mentoring and Coaching<\/strong><br \/>\nDewi Lloyd. IRIS Connect MirandaNet associate with Professor Christina Preston<\/p>\n<p>Digital video technology has been proven in research to be valuable in supporting the development the development of reflective practice by enabling trainee teachers to review their own teaching whilst in the presence of a mentor or coach. Asking the learners to provide feedback on the trainee’s teaching is also an interesting route. Experiments highlight the transformative contribution such learning conversations can make to enhancing the professional knowledge of both mentors and trainees. In particular Kennewell et al’s study investigated the benefits for teachers of Video Supported Reflective Dialogue (VSRD) through which teachers identified particular extracts from a video of one of their lessons to use as the basis for reflective analysis with a cognitive coach skilled in the use of dialogic discourse. The pair co-constructed knowledge with a view to deepening their understanding about the process of teaching and learning. This approach is also valuable for SEN teachers who often feel isolated in a large school. Using the latest video technology they can mentor each other by viewing lessons and annotating them thus developing new techiques (Rik Bennett 2010).<\/p>\n<p>What will be discussed in this presentation is the advanced technology that is now available and the issues that appear to be emerging from these research which are the locus of control regarding who selects what will be seen (the observer or the observed); and the locus of control for the analysis (i.e.who deconstructs and reconstructs the practice?). These  are important issues for the professional.<\/p>\n<p><strong>References<\/strong><br \/>\nKennewell S, H.Jones, S. Parkinson. J. Loughran, A. Lewis, H. Beauchamp (2010) Final Report to Becta concerning the use of stimulated and reflective dialogue for professional development in ICT <a href=\"http:\/\/dera.ioe.ac.uk\/1455\/\">http:\/\/dera.ioe.ac.uk\/1455\/<\/a><br \/>\nBennett, R. (2010) The Role of Video Technology in the Mentoring and Coaching of Teachers (Becta). This last report and a fuller understanding of the IRIS Connect research background can be found at www.irisconnect.co.uk\/research<\/p>\n<h2><em>16:00 &#8211; 17:00 Symposium topic three: Will the new &#8216;Computing&#8217; curriculum in England be more relevant for children&#8217;s futures than the old one?<\/em><\/h2>\n<p>Chaired by Christina Preston<em><\/em><\/p>\n<p><strong>How does the current UK Computing curriculum sit within the wider discourse about computational thinking?<\/strong><br \/>\nSiobhan Ramsey: Sandbox Education and CAS member<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/SiobhanRamsey.pdf\">SiobhanRamsey<\/a><\/p>\n<p>Today the  architects and developers of modern technologies demonstrate the ability to think computationally and work creatively to solve real world problems with computers. The recent global debate has touched on the plurality of approaches to computation thinking within computing, its development across subject boundaries and disciplines and the impact of teaching CT strategies and dispositions on the quality of learning.<\/p>\n<p>Reflection on computing and programming in the &#8216;real world&#8217; are leading to an awareness that from &#8216;commenting on code&#8217; to &#8216;creating prototypes for UX&#8217;, to &#8216;generating innovative solutions that trigger social change&#8217;, computing is as much a social as it is a technological process. The questions is what kind of leadership should be offer schools and teacher to work with the new computing curriculum for forge authentic and creative experiences for learners?<\/p>\n<p><strong>Literacy from Scratch: a joint project between schools in London and Prague<\/strong><br \/>\nLawrence Williams,  Brunel University Education Department and MirandaNet Ambassador.<\/p>\n<p>Literacy from Scratch” is a response to the United Kingdom (UK) government’s initiative to develop computer programming skills in both the Primary phase of education (pupils aged 5 to 11) and the Secondary phase (aged 11 to 18).<\/p>\n<p>The project has several related aspects: it involves the reworking of Primary and Secondary Initial Teacher Training (ITT) programmes at Brunel University, through which Postgraduate students are taught how to use the MIT Scratch programming language, to create sustained and animated narrative work. This work has also been developed by a whole year group (187 Year 8 pupils aged 12 -13) at a local London secondary school.<\/p>\n<p>Materials are posted here: <a href=\"http:\/\/www.literacyfromscratch.org.uk\/\">www.literacyfromscratch.org.uk<\/a><\/p>\n<p><strong>Do simplified tools designed for the classroom represent a &#8216;dumbed-down cop-out&#8217; in the effort to teach coding?<\/strong><br \/>\nDrew Buddie, Naace Board of Management, MirandaNet member and Head of ICT, Royal Masonic School<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Drew.jpg\"><img loading=\"lazy\" class=\"aligncenter size-medium wp-image-5204\" title=\"Drew\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Drew-298x300.jpg\" width=\"298\" height=\"300\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Drew-298x300.jpg 298w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Drew-150x150.jpg 150w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Drew-1018x1024.jpg 1018w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Drew.jpg 1953w\" sizes=\"(max-width: 298px) 100vw, 298px\" \/><\/a><\/p>\n<p>The unseeming alacrity with which the subject formerly known as ICT has found itself usurped by the term Computing within education, has left many ICT teachers feeling very vulnerable. The problem for them is how they will gain the skills to teach principles of programming and computational thinking to young people without adequate government support. The new emphasis on computing science has given rise to the use of  a number of applications that can be used to teach coding in a much more simplified way, such as Scratch, Blockly, Waterbear, and Greenfoot for example. However, many professional programmers have expressed concerns about this simplification of coding skills.  My contention will be whether programs like Scratch and Blockly can really be considered as proper coding tools, or whether they represent a &#8216;dumbed-down cop-out&#8217;.<\/p>\n<p><strong>What should the balance be in the classroom between Digital Literacy, Information Technology and Computer Science?<br \/>\n<\/strong><\/p>\n<p>Ian Lynch, GEBOL associate and MirandaNet Fellow<\/p>\n<p>In the MirandaNet submission to the Department for Education about the Computing curriculum members’ advised that the balance between Digital Literacy, Information Technology and Computer Science should not be weighted too much towards coding. MirandaNet Fellows agreed that with Scratch and Raspberry Pi computer science can be an exciting activity, however, some children will not find coding absorbing if this is the main or even the only activity available to them. We will begin a discussion about what other creative means can be found to teach the Computing Science component creatively.<\/p>\n<p><em>You can find other MirandaNet responses to the new Computing Curriculum <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/articles\/ict-curriculum-mirandas-views\/\">here<\/a><\/em><\/p>\n<h2>17:00 &#8211; 18:00 MirandaMod: Digital Pedagogy and Creativity<\/h2>\n<p><strong><br \/>\n17:00 <\/strong><strong>Learn, practise, teach creativity and ICT<\/strong><\/p>\n<p>Christina Preston introduced the <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMod<\/a> as an opportunity for professionals to share their experience  collaboratively and creatively build build a knowledge. All the experts who had been in<\/p>\n<p>In this MirandaMod we were developing a theme that has emerged from our membership of EU project, Hands-On, that aims at facilitating the integration of ICT tools in teaching by developing an open and learning-by-doing environment where teachers will develop their skills with innovative educational tools<\/p>\n<p>MirandaNet Fellows, Ian Lynch,  Theo Kuechel and Dr Katya Toneva set the scene for an in-depth discussion between the participants and the creation of a knowledge map that can be continued after the event as a element in the Hands-On MOOC.<\/p>\n<p>17:00 Setting the scene<\/p>\n<p><strong>The MirandaMod debate:  the relationship between creativity,  thinking skills, computational thinking and visual thinking.<\/strong><\/p>\n<p><strong>Ian Lynch<\/strong> offered the contention that there is nothing new in creative computational thinking which is about abstraction: in particular, deconstruction and decomposition pattern recognition, analysis\/reductionism and replicable procedures (algorithms) which have been well-established in the scientific method before computers made computer science popular. So what makes computational thinking really unique?<br \/>\n<em>(You can read Ian Lynch&#8217;s  Article drawing a link between the new Computing Curriculum and the Emperor&#8217;s new clothes <a href=\"https:\/\/docs.google.com\/document\/d\/1PvF2GymBqu8utVM6m3h168ysSCFe7bYhTAO-vsDACGA\/edit\">here<\/a>.)<\/em><br \/>\n<strong><\/strong><\/p>\n<p><strong>Theo Kuechel<\/strong> expanded on these ideas about thinking, computational and creative,  from a visual perspective by showing the structure of  the digital map we will be creating together. We hope to demonstrate that whilst it is easy to capture, create, edit and share visual data its potential for learning is not yet fully recognised or exploited.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Assessment-in-Learning-IL-TK.jpg\"><img loading=\"lazy\" class=\"aligncenter size-medium wp-image-5205\" title=\"Assessment in Learning IL TK\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Assessment-in-Learning-IL-TK-300x296.jpg\" width=\"300\" height=\"296\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Assessment-in-Learning-IL-TK-300x296.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Assessment-in-Learning-IL-TK-1024x1010.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/p>\n<p><strong>17:30 &#8220;Thinking Hats&#8221; Exercise: Opportunities and Challenges<br \/>\n<\/strong><\/p>\n<p><strong>Dr Katya Toneva<\/strong> helped all the participants  bridge to the apparent gap between computation thinking, visual thinking and creative thinking skills by selecting  three &#8220;thinking hats&#8221; styles to stimulate ideas about the use of digital technologies to teach thinking skills. The digital map will be the focus of  building knowledge  as an expert community, recording:<\/p>\n<ul>\n<li>what we know now<\/li>\n<li>what challenges we need to overcome<\/li>\n<li>what new ideas we can introduce<\/li>\n<\/ul>\n<p><strong>What should the question be?<\/strong><\/p>\n<p>Because the HandsOn project is exploring creativity as a mode for teaching teachers in the pilot they decided on assembling  current professional knowledge in two areas: using creativity techniques in teaching teachers about using digital tools in teaching; and, learning and in learning how to use digital tools across the curriculum?<\/p>\n<p>Ideas were then collated using De Bono&#8217;s three hats creative thinking exercise defining each hat with a colour. Three simple question  were decided for the map branches based on the De Bono&#8217;s modes of working and these became the branches for collecting idea on the map:<\/p>\n<ul>\n<li>The White Hat: what is known now?<\/li>\n<li>The Black Hat: what challenges must be overcome?<\/li>\n<li>The Green Hat: what new ideas can be introduced into practice? what techniques generate creativity?<\/li>\n<\/ul>\n<div><span style=\"font-size: medium;\"><span style=\"line-height: 24px;\"><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Group-work.jpg\"><img loading=\"lazy\" class=\"aligncenter size-medium wp-image-5206\" title=\"Group work\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Group-work-300x175.jpg\" width=\"300\" height=\"175\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Group-work-300x175.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Group-work-1024x598.jpg 1024w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a><\/span><\/span><\/div>\n<h2>Firstly the White Hat: what is known now?<\/h2>\n<p><strong>Tasks where teachers and students can demonstrate creativity<\/strong><\/p>\n<ul>\n<li>the teacher&#8217;s choice of digital tools;<\/li>\n<li>designing a grassroots personal learning programme or curriculum;<\/li>\n<li>designing a grassroots collaborative learning programme or curriculum;<\/li>\n<li>ownership of orginal ideas;<\/li>\n<li>teaching beyond the test;<\/li>\n<li>teachers having more influence on the assessment programme to ensure that creativity is encouraged;<\/li>\n<li>teachers having more influence on the assessment programme to ensure that creativity is encouraged;<\/li>\n<li>peer assessment;<\/li>\n<li>collaborative working between across the school and between schools especially international connections;<\/li>\n<li>redefining the teachers’ and the students’ role in teaching and learning;<\/li>\n<li> students teaching others;<\/li>\n<li>encouraging the student voice;<\/li>\n<li>encouraging student ownership.<\/li>\n<\/ul>\n<h2>Secondly Black Hat thinking: what are the obstacles to integrating ICT into teaching and learning?<\/h2>\n<p>The obstacles that prevent creativity in learning about how to use digital tools across the curriculum and using digital tools in teaching and learning:<\/p>\n<ul>\n<li>poor CPD models that do not take account of the research in this area about the best ways to support teachers;<\/li>\n<li>inappropriate digital resources that constrict or prevent creativity like software designed on an information transmission model;<\/li>\n<li>assessment that does not recognise, encourage or value creative activity;<\/li>\n<li>the lack of opportunity for teachers to be creative within the government inspection criteria.<\/li>\n<\/ul>\n<h2>Thirdly Green Hat thinking: What kind innovations are required to promote creativity?<\/h2>\n<p><em>These ideas are expressed as action research questions that some HandsOn teachers and pupils might like to explore.<\/em><\/p>\n<p>Ignoring the status quo and thinking innovatively about how to promote creativity in learning about how to use digital tools across the curriculum and using digital tools in teaching and learning:<\/p>\n<ul>\n<li>What is the correlation between the various concepts of creativity in the curriculum both for teachers and pupils?. Can any consensus be found?;<\/li>\n<li>Are there some digital technologies that encourage creativity than others? Are some more accessible than others?<\/li>\n<li>Which pedagogies underlie the various digital technologies e.g. behaviourism, social constructivism etc.? Which of these pedagogies best support, develop, extend creativity?<\/li>\n<li>What are the qualities of a creative teacher; a creative student; a collaborative community of practice? How can these qualities be best encouraged by the use of digital technologies?<\/li>\n<\/ul>\n<p><strong>Where are we going?<\/strong><\/p>\n<h3>The participants decided to continue to develop the map after the MirandaMod. The workshop exercise was seen to be the first step in creating a map in which the central question was:<\/h3>\n<h3>‘What (pedagogical) strategies can be developed to support creative approaches to learning using digital technologies (ICT)?’<\/h3>\n<p>This map can be viewed here ( a public url that does not allow people to change the map, Theo?)<\/p>\n<p><strong>Comments on the running of a MirandaMod.<\/strong><\/p>\n<p>The workshops were designed to fulfill the objective of <a href=\"http:\/\/www.mirandanet.org.uk\/mirandamods\/\">MirandaMods <\/a>in general. This is an event developed by MirandaNet Fellows where expert educators collaborate to take their knowledge further and to store the results for other educators to use and develop later. The resources are here.(to be added)<\/p>\n<p>Threaded through all the symposia in July was the theme of creativity in teaching and learning.  In particular colleagues to concentrate on ways in which digital technologies can be used to promote creative thinking and practice in schools. In this context, each of the symposia were designed to come to a group view about the most important issues raised when all the speakers&#8217; perspectives are considered. Each of the speakers had been asked to concentrate on the key debating points in their 12 minute presentation which left 12 minutes in the session for the participants to draw out the main points collaboratively.<\/p>\n<p>****************************************************************************<\/p>\n<p>Thanks for support from our associates who sponsored the HandsOn drinks reception after the workshop.<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IRIS_TAG_RGB_LRG_007.png\"><img loading=\"lazy\" class=\"alignleft  wp-image-5090\" title=\"IRIS_TAG_RGB_LRG_007\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IRIS_TAG_RGB_LRG_007.png\" width=\"325\" height=\"203\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IRIS_TAG_RGB_LRG_007.png 1905w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IRIS_TAG_RGB_LRG_007-300x186.png 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/IRIS_TAG_RGB_LRG_007-1024x636.png 1024w\" sizes=\"(max-width: 325px) 100vw, 325px\" \/><\/a><\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Lightspeed-logo-hi-res.jpg\"><img loading=\"lazy\" class=\"alignleft size-full wp-image-5089\" title=\"Lightspeed logo hi-res\" alt=\"\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Lightspeed-logo-hi-res.jpg\" width=\"440\" height=\"81\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Lightspeed-logo-hi-res.jpg 440w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/Lightspeed-logo-hi-res-300x55.jpg 300w\" sizes=\"(max-width: 440px) 100vw, 440px\" \/><\/a><\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><strong><br \/>\n<\/strong><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp;  Collaborative professional knowledge building activities for teacher educators, vocational trainers and primary and secondary school teachers July 9th Handson workshop at the Park Inn, Bedford, Bedfordshire Aims: to understand more about how the principles of teaching and learning creatively &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/bedford-itte-conference-8th-10th-july-2013\/mirandanet-symposia-at-itte\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":4264,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4967"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=4967"}],"version-history":[{"count":177,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4967\/revisions"}],"predecessor-version":[{"id":5860,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4967\/revisions\/5860"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/4264"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=4967"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}