{"id":5215,"date":"2013-08-29T10:20:36","date_gmt":"2013-08-29T09:20:36","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=5215"},"modified":"2013-08-31T22:34:54","modified_gmt":"2013-08-31T21:34:54","slug":"what-about-moocs-may-28th","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/what-about-moocs-may-28th\/","title":{"rendered":"What about MOOCs? May 28th"},"content":{"rendered":"<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo-.jpg\"><img loading=\"lazy\" class=\"aligncenter size-medium wp-image-5041\" title=\"LLL and Hands on logo\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo--300x225.jpg\" alt=\"\" width=\"300\" height=\"225\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo--300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/06\/LLL-and-Hands-on-logo-.jpg 720w\" sizes=\"(max-width: 300px) 100vw, 300px\" \/><\/a>This workshop was designed to involve the wider MirandaNet community in developing signing up, dissemination, sustainability strategies to support the EU HandsOn project. The aims of this project are:<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/08\/Aims.jpg\"><img loading=\"lazy\" class=\"aligncenter  wp-image-5224\" title=\"Aims\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/08\/Aims-300x225.jpg\" alt=\"\" width=\"336\" height=\"252\" srcset=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/08\/Aims-300x225.jpg 300w, https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2013\/08\/Aims.jpg 720w\" sizes=\"(max-width: 336px) 100vw, 336px\" \/><\/a><\/p>\n<p>The workshop programme looked at these aims from the point of view of introducing  MOOCs into education:<\/p>\n<ul>\n<li>1000 &#8211; 1130: Rethinking Education in the Digital Era: Putting MOOCs in context; Chris Yapp<\/li>\n<li>1130-1200 Introducing the HandsOn Programme and community building: Christina Preston<\/li>\n<li>1215 – 1230 The HANDSON Project in the context of 21st Century Learning Platforms: Marilyn Leask and Sarah Younie<\/li>\n<li>1215 -1230: Building a mind map as a resource for professional knowledge: Theo Kuechel<\/li>\n<li>1230 – 1245 Accrediting online learning &#8211; Ian Lynch<\/li>\n<li>Lunch<\/li>\n<li>1400-1500 – Workshop on MOOCs Learning spaces –the big issues<\/li>\n<li>1500-1600 Workshop group topics\n<ul>\n<li>Creativity in teaching and learning<\/li>\n<li>Factors involved in learning online<\/li>\n<li>Constructing a map of professional knowledge<\/li>\n<li>Talking about classroom practice<\/li>\n<li>Ideas for dissemination and sustaining the community<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p class=\"MsoNormal\"> <strong>Some  questions we tackled in this workshop were:<\/strong><\/p>\n<h2><strong>Some  questions we tackled in this workshop were:<\/strong><\/h2>\n<p><strong>The big picture<\/strong><\/p>\n<p>How can we create a framework for education to become evidence based?<\/p>\n<p>How do we balance the evaluation of educational technology contexts in pedagogical, social and economic aspects of learning?<\/p>\n<p>How do we build the system wide knowledge base for transformation?<\/p>\n<p>How do we build the learning competences of professionals to design, deliver and enhance the systems of learning, based on evidence?<\/p>\n<p><strong>How do MOOCs fit into the goals of education?<\/strong><\/p>\n<p>How can a MOOC reflect the outcomes we seek for learners in a 21st Century social, economic and technological context?What kind of skills, competences and attitudes (personal, creativity, knowledge) can a MOOC support?<\/p>\n<p>Can a MOOC support the value systems of a learning institutions?<\/p>\n<p>How can a MOOC help in the teaching of  ICT?<\/p>\n<p>How much should teachers know about ICT before they use a MOOC?<\/p>\n<p>Does the use of a MOOC develop students for the workplace?<\/p>\n<p>What is will a 21st Century MOOC look like?<\/p>\n<p><span lang=\"CA\"><strong> A summary of the programme content<\/strong><br \/>\n<\/span><\/p>\n<h3>1. Rethinking Education in the Digital Era: putting the impact of MOOCs<\/h3>\n<h3>in context in schools, in universities and in vocational education<\/h3>\n<h3>Chris Yapp<\/h3>\n<p>(A version of this draft article will be put in the HandsOn Moodle and Blog)<\/p>\n<p><strong>What is a MOOC?<\/strong><\/p>\n<p>When Dr Chris Yapp spoke in London to the MirandaNet members and associates who are supporting the New EU Handson Project because the Handson team are seeking to create a MOOC with mentoring that will provide an exciting new learning environment where teachers, students and workers can undertake effective learning.<\/p>\n<p>In the first place Dr Yapp defined this term, <a href=\"https:\/\/theconversation.com\/pages\/massive-open-online-courses\">Massive Open Online Course<\/a>, which he said is likely to enter into our common vernacular. A MOOC is a course or unit accessible, usually with no prerequisites, to anyone who wishes to enrol, usually for free, and with self-assessment or peer assessment along the way. Many now are being offered by household name universities who may not give you credit towards a degree, but will often award certificates of participation, or even a grade<\/p>\n<p>Most MOOCs are now delivered by acknowledged experts and outstanding teachers. They are very new, and no-one yet knows what they will mean or what role they will play. But many already believe that Pandora’s box has been opened. He acknowledged the work of [1]Professor Jane den Hollander, Deakin University for this definition.<\/p>\n<p><strong>Will MOOCs change education? <\/strong><\/p>\n<p>Dr Chris Yapp  warned the MirandaNet members and associates who are supporting the New EU Handson Project that changing pedagogy is more important than modifying platforms and massifying outreach.<\/p>\n<p>He quotes Diana Laurillard, who in her book, <em>Opening Up Education<\/em> &#8220;Using technology to improve education is not rocket science&#8230;it is much, much harder than that&#8221;<\/p>\n<p>In the recent past it used to be IWBs and then tablets that would transform education. He has heard this kind fo comment a number of times. Others espcted to be catalysts for change have been Second Life, laptops, podcasts- in fact none of these products will change anything.  When we take ideas and translate them into policy or practice too quickly we often lose the plot.<\/p>\n<p>Increase in technology available – e.g.  2:1 ratio for computer in classrooms &#8211; is better resourced education system but not a better system. New models of teaching and learning and organisation of education enabled by IT can transform education- but too often there are gaps in organisational development of schools.<\/p>\n<p>Education in the UK seems to be developing in an opposite way to buiness. Since the 1960s schools have got bigger. Businesses have got smaller. SMEs, freelance. Heading towards 50% freelance in London. MOOCS in education could be going in the wrong direction as well.<\/p>\n<p>There is a core challenge that needs to be considered in the adoption of MOOCs.<\/p>\n<p>Learning is not an industrial process capable of automation. In fact Chris is working with FE colleges that are getting rid of VLEs.<\/p>\n<p>On the contrary education is a set of human processes supported and transformed by technology developments. High technology in learning requires a high skilled workforce. As a species we create technology that transforms our processes. We shouldn’t be risking dumbing down teaching by introducing high technology like MOOCs. More thought is needed in the pedagogical design.<\/p>\n<p>What do we mean by IT? From iT to It &#8211; Technology has been focus. Technology is becoming more pervasive and less relevant. ‘Big data’ is now around. A MOOC- giving huge amounts of data in the pathways of individuals. People take what they want from a course, then give up. They know what they want. Let’s think about<\/p>\n<p>Big Data for education – focusing on huge amounts of data available professional could generate evidence for what works.<\/p>\n<p>From a cost viewpoint and from a strategic viewpoint humans have the possibility of getting far more evidence now than before. Using Vassian techniques rather than Boolean techniques even more persuasive evidence turns up.<\/p>\n<p>So information technology causes change, but also is a means of effecting change.<\/p>\n<p>Claus Moser said ‘Education is cause and consequence of economic progress”.<\/p>\n<p>But we have polarised camps. How do we get to the point where we use technology appropriately to embed in a reformed education system? Until we know this MOOCs will be no more effective than other technologies in the classroom or outside.<\/p>\n<p>The main reason is that the Interplay between cause and effect is deeply problematic with ICT. We talk about IT as though it is all the same. In fact there are two classes:<\/p>\n<ul>\n<li>Sustaining technologies<\/li>\n<li>Disruptive technologies.<\/li>\n<\/ul>\n<p>In other words some technologies allow you to teach in the same way but better  These sustaining technologies embed a lot quicker. For example IWB appear to be sustaining technologies: add value to old class teaching.<\/p>\n<p>Disruptive technologies cause educators to question how they do things. These take longer to embed. For example in the Learning lab at Wolverhampton practice changed over two years: from teacher talking to kids from the front  they circled around the child and constructive talking and learning was increased<\/p>\n<p>MOOCs can be use for conventional teaching on a large scale and they are. Nevertheless, the World Wide Web is fundamentally a disruptive technology. No way round it. Some educators have tried to create walled gardens and limit access. There is still a myth that use of the internet can be controlled. Virtual learning enviroments, promoted by the UK government did this. Now there is a need to dismantle them strategically.<\/p>\n<p>Indeed Chris suggests that we don’t want to talk about technology bit about learning – what would a Vygotskiyan learning platform look like? Then which technologies should the HandsOn team use to deliver the learning goals they have identified?<\/p>\n<p>It is going to be the technology platform that wins in the long term. This will not happen if the schools, colleges and universities that are chosen are learning organisation that can articulate the philosophy of the institution. In this case the HandsOn technology would be part a pedagogical plan not leading the plan.<\/p>\n<h2>A brainstorming session<\/h2>\n<h3>A digital map developed in the brainstorming session based on the thinking hats exercises can be found <a href=\"http:\/\/www.mindmeister.com\/maps\/show\/322540089#\">here<\/a>.<\/h3>\n<p><span style=\"color: #000000;\">The exercises were:<\/span><\/p>\n<p><span style=\"color: #000000;\">White Hat: current good practice in promoting creativity in the use of ICT<br \/>\nGreen  Hat: innovation, provocation and investigation, seeing where a thought goes<\/span><br \/>\nBlack Hat: Discernment: identifying reasons to be cautious and conservative<\/p>\n<h2><strong><span style=\"color: #000000;\">White Hat: current good practice in promoting creativity in the use of ICT<br style=\"color: #000000;\" \/><\/span><br \/>\nTeachers and mentors in a MOOC need to consider some key points<\/strong><\/h2>\n<p>Those how pilot must have the support of their institution<\/p>\n<p>Students will need detailed navigation help<\/p>\n<p>A strong sense of community should be created with common aims<\/p>\n<p>Aims of learning need to be agreed at the start<\/p>\n<p>They need to understand the roles they can take in the threads<\/p>\n<p>Help is required in learning how to send a valuable message<\/p>\n<p>Isolated students need to be drawn back in<\/p>\n<p>A code of conduct needs to be agreed by all<\/p>\n<p>Interactivity is important<\/p>\n<p>Strategies for building collaborative knowledge need to be explicit<\/p>\n<p>Visual learning opportunities are important<\/p>\n<p>Accreditation should be offered that supports constructive learning<\/p>\n<p>Without associated accreditation sustainability will be difficult<\/p>\n<p><strong>A good platform needs to have<\/strong><\/p>\n<p>Lecture videos that can be downloaded, not streamed<\/p>\n<p>Some form of mentoring<\/p>\n<p>Tests to allow the student to assess what they know<\/p>\n<p>Must be some mediation and guidance in discussion<\/p>\n<p>Collaborative tools are important<\/p>\n<p><strong>Benefits<br \/>\n<\/strong>Anyone can drop in and out at no cost<br \/>\nAccess for more people who cannot take conventional routes to education<br \/>\nFree info for anyone who wants it<\/p>\n<p>Can make learning relationships<\/p>\n<p>Can accept people with varied experience<\/p>\n<p>Badges give some kind of reward<strong><strong><\/strong><\/strong><\/p>\n<h2><strong><strong><br \/>\nBlack Hat: Discernment: identifying reasons to be cautious and conservative<\/strong>Problems<\/strong><\/h2>\n<p>Are the big universities making them free now while waiting to put the small ones out of business<\/p>\n<p>With no personal or financial commitment hard to stay motivated<\/p>\n<p>Too many lurkers<\/p>\n<p>Some people interact too much and there are trolls<\/p>\n<p>Threads can be repetitive and boring if not mediated<br \/>\nCan be just the same information transmission pedagogy -just new wrapper<br \/>\nContent is free these days so no need to provide a MOOC<br \/>\nHigh drop out rate<\/p>\n<p>Lack of any personal contact is not real education&#8230;<\/p>\n<p>How real is the assessment if the student is not personally known<\/p>\n<p>Can be hard if there are too many levels of experience to start with<\/p>\n<h2><strong><strong><span style=\"color: #000000;\">Green  Hat: innovation, provocation and investigation, seeing where a thought goes<br \/>\n<\/span><\/strong><\/strong><\/h2>\n<h2><strong><strong><\/strong><\/strong>Action suggested<\/h2>\n<p>&nbsp;<\/p>\n<table border=\"1\" cellspacing=\"0\" cellpadding=\"0\">\n<tbody>\n<tr>\n<td valign=\"top\" width=\"236\">A conference and workshop programme for 2013\/2014<\/td>\n<td valign=\"top\" width=\"236\">Suggested locations in appendix<\/td>\n<td valign=\"top\" width=\"236\">WP7<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Support from companies for forthcoming exhibitions and conferences<\/td>\n<td valign=\"top\" width=\"236\">IRIS, Follett, Ingot, Gebol, LightSpeed, Steljes. Merc, Yellow Dot<\/td>\n<td valign=\"top\" width=\"236\">WP 7<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Support from professional organisations<\/td>\n<td valign=\"top\" width=\"236\">ITTE, Naace, MirandaNet, CAS, BCS, Teacher Development Trust, TeachMeet,  BESA<\/td>\n<td valign=\"top\" width=\"236\">WP6\/7<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Offers from school clusters to pilot HandsOn and fund the teachers as well as VET and HE groups<\/td>\n<td valign=\"top\" width=\"236\">Elliott Foundation, Tideway, Warden Park, Bedfordshire and Leicester Universities, ingots<\/td>\n<td valign=\"top\" width=\"236\">WP6\/WP5<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Coverage in education press<\/td>\n<td valign=\"top\" width=\"236\">John Galloway, Terry Freedman, Merlin John<\/td>\n<td valign=\"top\" width=\"236\">WP7<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Developing pedagogy<\/td>\n<td valign=\"top\" width=\"236\">Leicester and Bedfordshire<\/td>\n<td valign=\"top\" width=\"236\">WP3<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Developing community<\/td>\n<td valign=\"top\" width=\"236\">Leicester and Bedfordshire<\/td>\n<td valign=\"top\" width=\"236\">WP6<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">MOOC design ideas<\/td>\n<td valign=\"top\" width=\"236\">BCS, Leicester and Bedfordshire<\/td>\n<td valign=\"top\" width=\"236\">WP4<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Ideas for accreditation of courses<\/td>\n<td valign=\"top\" width=\"236\">Ingots and Gebol<\/td>\n<td valign=\"top\" width=\"236\">WP6<\/td>\n<\/tr>\n<tr>\n<td valign=\"top\" width=\"236\">Ideas about effective online learning<\/td>\n<td valign=\"top\" width=\"236\">BCS, Leicester and Bedfordshire<\/td>\n<td valign=\"top\" width=\"236\">WP5<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h2 style=\"text-align: left;\"> Recommended reading<\/h2>\n<p><strong>Don’t Lecture Me: Rethinking How College Students Learn<\/strong><\/p>\n<p>“Let me posit a duplication theory of education value: <strong>if something can be duplicated with limited costs, it can’t serve as a value point for higher education.<\/strong> Content is easily duplicated and has no value. What is valuable, however, is that which can’t be duplicated without additional input costs: personal feedback and assessment, contextualized and personalized navigation through complex topics, encouragement, questioning by a faculty member to promote deeper thinking, and a context and infrastructure of learning. Basically: human input costs make education valuable. We can’t duplicate personal interaction without spending more money. We can scale content, but we can’t scale encouragement. We can improve lecturing through <a href=\"http:\/\/mindshift.kqed.org\/2011\/09\/dont-lecture-me-rethinking-how-college-students-learn\/\">peer teaching<\/a>, but we can’t scale the timely interventions and nudges by faculty that influence deeper learning.<\/p>\n<p>Universities that thrive in the future will be those that recognize the need for new value point positioning. Some will pursue an integration approach to value creation, others will rely on world-class faculty, and still others will rely on huge research projects or successful sports teams. Those will be anomalies and outliers. The vast majority of universities that will educate humanity in the coming decades will be those that structure their value point on elements that cannot be easily duplicated and scaled, or at minimum, require input costs to do so. “<\/p>\n<p>Dominik Lukes : Education and Technology Specialist<\/p>\n<p><strong>Some urls referring to MOOCs…<\/strong><\/p>\n<p>http:\/\/www.elearnspace.org\/blog\/2012\/07\/25\/moocs-are-really-a-platform<\/p>\n<p>http:\/\/www8.open.ac.uk\/platform\/news-and-features\/ou-researchers-top-10-innovations-transform-education-in-five-years<\/p>\n<p>http:\/\/ianinsheffield.wordpress.com\/2012\/06\/03\/mooccs101\/<br \/>\n<a href=\"http:\/\/www.pranavmistry.com\/projects\/sixthsense\/\">http:\/\/www.pranavmistry.com\/projects\/sixthsense\/<\/a><br \/>\n<a href=\"http:\/\/www.ted.com\/talks\/view\/lang\/en\/\/id\/685\">http:\/\/www.ted.com\/talks\/view\/lang\/en\/\/id\/685<\/a><br \/>\n<a href=\"https:\/\/plus.google.com\/111626127367496192147\/posts\">https:\/\/plus.google.com\/111626127367496192147\/posts<\/a><br \/>\n<a href=\"http:\/\/www.youtube.com\/watch?v=9c6W4CCU9M4\">http:\/\/www.youtube.com\/watch?v=9c6W4CCU9M4<\/a><\/p>\n<p><a href=\"http:\/\/www.sonicfoundry.com\/webcast\/practical-response-massive-open-online-courses-moocs\">http:\/\/www.sonicfoundry.com\/webcast\/practical-response-massive-open-online-courses-moocs<\/a><\/p>\n<p>http:\/\/theconversation.edu.au\/moocs-neither-the-death-of-the-university-nor-a-panacea-for-learning-8499<\/p>\n<p><a href=\"http:\/\/blogs.kqed.org\/mindshift\/2011\/09\/dont-lecture-me-rethinking-how-college-students-learn\/\">http:\/\/blogs.kqed.org\/mindshift\/2011\/09\/dont-lecture-me-rethinking-how-college-students-learn\/<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This workshop was designed to involve the wider MirandaNet community in developing signing up, dissemination, sustainability strategies to support the EU HandsOn project. The aims of this project are: The workshop programme looked at these aims from the point of &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/events-2\/what-about-moocs-may-28th\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":1222,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5215"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=5215"}],"version-history":[{"count":17,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5215\/revisions"}],"predecessor-version":[{"id":5217,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5215\/revisions\/5217"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/1222"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=5215"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}