{"id":5895,"date":"2014-03-18T22:04:41","date_gmt":"2014-03-18T21:04:41","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/researchexchange\/?page_id=5895"},"modified":"2014-09-14T16:44:44","modified_gmt":"2014-09-14T15:44:44","slug":"about","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about\/","title":{"rendered":"About"},"content":{"rendered":"<p>The MirandaNet Fellowship of educators (www.mirandanet.ac.uk) was founded by Professor Christina Preston in 1992. This professional organisation has now attracted 1,000 members in nearly 80 countries who are committed to using the power of digital technologies as a catalyst for change in teaching and learning practice. The membership breaks down across continents: Europe 49%, UK 28%, China 18%, USA 16%. The annual growth of membership is currently at 12%.<\/p>\n<p>The MirandaNet website attracts 6,000 unique visitors a month because of the breadth and variety of free publications authored by the membership. Visitors often return and read up to eleven pages. The website provides a means of publishing knowledge about digital technologies in learning from members and associates that has been created and developed by a number of means: the internal debating system called mirandalink that provides trending topics; the MirandaNet newsletter and blog; MirandaMods, international knowledge creation webinars that are streamed worldwide; talking head videos from practitioners; members’ book reviews; conference papers and presentations; help sheets and manuals for teachers; research papers for journals; opinion pieces; summaries of educational research; MirandaNet Fellows also prepare policy submissions for politicians.<\/p>\n<p>Some members have the opportunity to join the research projects as co-researchers in the iCatalyst programme – a professional development programme that focuses on the management of change. iCatalyst is another key source of the publications on the website.<\/p>\n<p>Publications are all well indexed and appear prominently on Google searches. In addition, through a range of professional social networks, microblogging, messages to other professional organisation, professional journals and through other internal professional channels the Fellowship has a reach of more than 15,000 other educators who receive MirandaNet news.<\/p>\n<p>MirandaNet research has been been funded by governments, companies, charities, companies and organisations such as the European Union.<\/p>\n<p>MirandaNet Fellowship is not-for-profit and is funded by associate companies who pay an annual subscription in order to develop their products and services in the context of research undertaken by the professional users.<\/p>\n<p>The MirandaNet team is headed by Professor Christina Preston who writes this Research Exchange section of the website. Email &#99;&#x68;&#114;&#x69;s&#x74;i&#110;&#x61;&#64;&#x6d;i&#x72;a&#110;&#x64;&#97;&#x6e;e&#x74;&#46;&#97;&#x63;&#46;&#x75;k. Her details are <a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about\/\">here.  <\/a><\/p>\n<p>&nbsp;<\/p>\n<p><a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2011\/08\/smallchristina.jpg\"><img loading=\"lazy\" class=\" wp-image-418 alignright\" src=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/wp-content\/uploads\/2011\/08\/smallchristina.jpg\" alt=\"smallchristina\" width=\"168\" height=\"231\" \/><\/a><\/p>\n<p>The MirandaNet services and the team can be found<a href=\"http:\/\/www.mirandanet.org.uk\/consultancy\/\"> here<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The MirandaNet Fellowship of educators (www.mirandanet.ac.uk) was founded by Professor Christina Preston in 1992. This professional organisation has now attracted 1,000 members in nearly 80 countries who are committed to using the power of digital technologies as a catalyst for &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5895"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=5895"}],"version-history":[{"count":3,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5895\/revisions"}],"predecessor-version":[{"id":5897,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/5895\/revisions\/5897"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=5895"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}