{"id":90,"date":"2009-05-05T02:05:30","date_gmt":"2009-05-05T01:05:30","guid":{"rendered":"http:\/\/www.mirandanet.ac.uk\/blog\/?page_id=90"},"modified":"2014-10-11T17:40:48","modified_gmt":"2014-10-11T16:40:48","slug":"about-mirandanet","status":"publish","type":"page","link":"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about-mirandanet\/","title":{"rendered":"About the MirandaNet Fellowship"},"content":{"rendered":"<p>&nbsp;<\/p>\n<p class=\"RENormal\"><span lang=\"EN-US\"> With the support of sympathetic colleagues, Christina Preston founded this international professional organisation, the MirandaNet Fellowship, in 1992 in memory of her daughter, Corinna who died of a virus when sixteen years old. She chose the name Miranda because in the Shakespeare play, The Tempest, Miranda, the heroine, nearly says, “Oh brave new world that hath such people in IT”. Christina goes on to say, &#8220;My excuse for this slight rephrasing is that Shakespeare was a great multimodal communicator who simply did not have a computer to hand. The context is appropriate because Miranda is the daughter of Prospero. Like digital technologists of today, Prospero was a magician. My study aims to unpick some of the workings of that magic so that educators can make greater use of opportunities that digital technologies offer to make teaching and learning more enriching for every student whatever their age.<br \/>\n<\/span><\/p>\n<p>In 1992 she founded the MirandaNet Fellowship a professional ‘community of practice’ (Wenger 1998). Wenger, who coined the term. approves of The members’ aim of using their evidence to influence educational policy on educational innovation around the world. The  MirandaNet Fellowship has been called the    ‘Facebook’ of  international ICT  professionals by BECTA. UNESCO called  MirandaNet the Robin Hood of ICT  CPD  because teacher members are  engaged  as action researchers  as well as  co-researchers and  authors. The members are drawn from international ICT policy makers, teachers, teacher educators, staff trainers, regional educators, commercial developers who are passionate about digital technology in teaching and learning and about using technologies to promote cultural understanding and democratic participation. This professional organisation is free to join and supported by the voluntary efforts of more than 750 thousand members from over 80 countries.<\/p>\n<p class=\"RENormal\"><span lang=\"EN-US\">The composition of this community of practice reflects the mixed status of many professional groups that now assemble through the Internet. A growing number of members are taking post-graduate qualifications and are keen to share their knowledge with other members (Stuckey 2005).  Commercial companies also support us by funding our practice-based research projects in order to learn from the knowledge building practices online and the research capacity of the members.<\/span><\/p>\n<p class=\"RENormal\"><span lang=\"EN-US\">MirandaNetterspublish peer-reviewed articles on the web in our ejournals. The generosity of the MirandaNetters in building a free knowledge base is typical of a new approach to copyright on the Web called the ‘Creative Commons’. This is a non-profit organisation that provides free tools so that authors, scientists, artists, and educators can easily mark their creative work with the freedoms they choose. The range stretches from &#8220;All Rights Reserved&#8221; to &#8220;Some Rights Reserved.&#8221; As a result, teachers have the freedom to publish their materials for each other without the mediation of a commercial editor and distributor.MirandaNet Members engage in many other kinds of knowledge creation activities that are underpinned by new modes of social interaction like wikis, blogs, ichat, listservs and unconferences. Miranda has also given her name to a particular kind of unconference, a MirandaMod, that allows members to engage with each other all over the world in real time. The last MirandaMod in real time had 25 contributors meeting in London and contributors coming in on the debate online from 20 countries. This kind of communication is unlike previous modes of knowledge construction because the members are not confined by meeting costs, location, work commitments or family responsibilities so long as they can access the Internet (Preston and Cuthell 2009 in press).<\/span><\/p>\n<p class=\"RENormal\"><span lang=\"EN-US\">So first the contribution to my thinking of members of MirandaNet must be acknowledged: firstly MirandaNet collaborator, John Cuthell, who has worked in intellectual partnership with me over fifteen years on many joint papers and projects; Francis Howlett, MirandaNet web editor, who diligently keeps our website current; and, Anne Dobson who prepares the newsletter. I am also beholden to the Fellows who contribute to the life of the MirandaNet Fellowship especially: Allison Allen, Richard Allen, Miles Bery, Mara Chrystie, Alison Banks, Mark Bennison, Leon Cych, Margaret Danby, Anne Dobson, Jane Finch, Mary Harris, Theo Keuchel, Nigel Riley, Michael Smith, Katya Toneva, Dai Thomas, Keith Turvey, Alistair Wells, and Basia Korcsak, called away at her most innovative and creative.<\/span><\/p>\n<p class=\"RENormal\"><span lang=\"EN-US\">I must also thank the academic community who have supported me in this endeavour. In particular, Marilyn Leask who has partnered me in several projects over the last fifteen years as well as Ron Barnett, Sonia Blandford, Steve Coombs, Caroline Daly, Niki Davis, Bryn Holmes, Christina Howell Richardson, Gunther Kress, Carey Jewitt, Avril Loveless, Bozena Mannova, Di Mavers, Norbert Pachler, John Potter, Bridget Somekh, Leena Vainio and Sarah Younie. Thank you for stimulating my thinking in all kinds of different ways.<\/span><\/p>\n<p class=\"RENormal\"><span lang=\"EN-US\">In the  study I have uploaded here, Etopia, I relate my own learning journey to that of the community of practice<a href=\"http:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about-mirandanet\/building-etopia-here\/\" rel=\"attachment wp-att-248\">Building Etopia here: <\/a><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; With the support of sympathetic colleagues, Christina Preston founded this international professional organisation, the MirandaNet Fellowship, in 1992 in memory of her daughter, Corinna who died of a virus when sixteen years old. She chose the name Miranda because in &hellip; <a href=\"https:\/\/www.mirandanet.org.uk\/researchexchange\/about-the-team\/about-mirandanet\/\">Continue reading <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":2,"featured_media":0,"parent":533,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/90"}],"collection":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/comments?post=90"}],"version-history":[{"count":21,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/90\/revisions"}],"predecessor-version":[{"id":578,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/90\/revisions\/578"}],"up":[{"embeddable":true,"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/pages\/533"}],"wp:attachment":[{"href":"https:\/\/www.mirandanet.org.uk\/researchexchange\/wp-json\/wp\/v2\/media?parent=90"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}